// Class /Script/Engine.Actor
// Size: 0x288
class AActor : public UObject
{
	struct FActorTickFunction PrimaryActorTick; // 0x28 (0x30)
	unsigned char bNetTemporary; // 0x58 (0x1)
	unsigned char bOnlyRelevantToOwner; // 0x58 (0x1)
	unsigned char bAlwaysRelevant; // 0x58 (0x1)
	unsigned char bReplicateMovement; // 0x58 (0x1)
	unsigned char bCallPreReplication; // 0x58 (0x1)
	unsigned char bCallPreReplicationForReplay; // 0x58 (0x1)
	unsigned char bHidden; // 0x58 (0x1)
	unsigned char bTearOff; // 0x59 (0x1)
	unsigned char bForceNetAddressable; // 0x59 (0x1)
	unsigned char bExchangedRoles; // 0x59 (0x1)
	unsigned char bNetLoadOnClient; // 0x59 (0x1)
	unsigned char bNetUseOwnerRelevancy; // 0x59 (0x1)
	unsigned char bRelevantForNetworkReplays; // 0x59 (0x1)
	unsigned char bRelevantForLevelBounds; // 0x59 (0x1)
	unsigned char bReplayRewindable; // 0x59 (0x1)
	unsigned char bAllowTickBeforeBeginPlay; // 0x5a (0x1)
	unsigned char bAutoDestroyWhenFinished; // 0x5a (0x1)
	unsigned char bCanBeDamaged; // 0x5a (0x1)
	unsigned char bBlockInput; // 0x5a (0x1)
	unsigned char bCollideWhenPlacing; // 0x5a (0x1)
	unsigned char bFindCameraComponentWhenViewTarget; // 0x5a (0x1)
	unsigned char bGenerateOverlapEventsDuringLevelStreaming; // 0x5a (0x1)
	unsigned char bIgnoresOriginShifting; // 0x5a (0x1)
	unsigned char bEnableAutoLODGeneration; // 0x5b (0x1)
	unsigned char bIsEditorOnlyActor; // 0x5b (0x1)
	unsigned char bActorSeamlessTraveled; // 0x5b (0x1)
	unsigned char bReplicates; // 0x5b (0x1)
	unsigned char bCanBeInCluster; // 0x5b (0x1)
	unsigned char bAllowReceiveTickEventOnDedicatedServer; // 0x5b (0x1)
	unsigned char bReplicateUsingRegisteredSubObjectList; // 0x5b (0x1)
	unsigned char bActorEnableCollision; // 0x5c (0x1)
	unsigned char bActorIsBeingDestroyed; // 0x5d (0x1)
	unsigned char bAsyncPhysicsTickEnabled; // 0x5d (0x1)
	enum EActorUpdateOverlapsMethod UpdateOverlapsMethodDuringLevelStreaming; // 0x5e (0x1)
	enum EActorUpdateOverlapsMethod DefaultUpdateOverlapsMethodDuringLevelStreaming; // 0x5f (0x1)
	float InitialLifeSpan; // 0x60 (0x4)
	float CustomTimeDilation; // 0x64 (0x4)
	struct TEnumAsByte<ENetRole> RemoteRole; // 0x68 (0x1)
	unsigned char unreflected_69[0x3]; // 0x69 (0x3) 
	int RayTracingGroupId; // 0x6c (0x4)
	struct FRepAttachment AttachmentReplication; // 0x70 (0x60)
	struct FRepMovement ReplicatedMovement; // 0xd0 (0x70)
	class AActor* Owner; // 0x140 (0x8)
	struct FName NetDriverName; // 0x148 (0x4)
	struct TEnumAsByte<ENetRole> Role; // 0x14c (0x1)
	struct TEnumAsByte<ENetDormancy> NetDormancy; // 0x14d (0x1)
	enum ESpawnActorCollisionHandlingMethod SpawnCollisionHandlingMethod; // 0x14e (0x1)
	struct TEnumAsByte<EAutoReceiveInput> AutoReceiveInput; // 0x14f (0x1)
	int InputPriority; // 0x150 (0x4)
	unsigned char unreflected_154[0x4]; // 0x154 (0x4) 
	class UInputComponent* InputComponent; // 0x158 (0x8)
	float NetCullDistanceSquared; // 0x160 (0x4)
	int NetTag; // 0x164 (0x4)
	float NetUpdateFrequency; // 0x168 (0x4)
	float MinNetUpdateFrequency; // 0x16c (0x4)
	float NetPriority; // 0x170 (0x4)
	unsigned char unreflected_174[0x4]; // 0x174 (0x4) 
	class APawn* Instigator; // 0x178 (0x8)
	struct TArray<class AActor*> Children; // 0x180 (0x10)
	class USceneComponent* RootComponent; // 0x190 (0x8)
	unsigned char unreflected_198[0x8]; // 0x198 (0x8) 
	struct TArray<struct FName> Layers; // 0x1a0 (0x10)
	struct TWeakObjectPtr<class UChildActorComponent> ParentComponent; // 0x1b0 (0x8)
	unsigned char unreflected_1b8[0x10]; // 0x1b8 (0x10) 
	struct TArray<struct FName> Tags; // 0x1c8 (0x10)
	struct FMulticastSparseDelegate OnTakeAnyDamage; // 0x1d8 (0x1)
	struct FMulticastSparseDelegate OnTakePointDamage; // 0x1d9 (0x1)
	struct FMulticastSparseDelegate OnTakeRadialDamage; // 0x1da (0x1)
	struct FMulticastSparseDelegate OnActorBeginOverlap; // 0x1db (0x1)
	struct FMulticastSparseDelegate OnActorEndOverlap; // 0x1dc (0x1)
	struct FMulticastSparseDelegate OnBeginCursorOver; // 0x1dd (0x1)
	struct FMulticastSparseDelegate OnEndCursorOver; // 0x1de (0x1)
	struct FMulticastSparseDelegate OnClicked; // 0x1df (0x1)
	struct FMulticastSparseDelegate OnReleased; // 0x1e0 (0x1)
	struct FMulticastSparseDelegate OnInputTouchBegin; // 0x1e1 (0x1)
	struct FMulticastSparseDelegate OnInputTouchEnd; // 0x1e2 (0x1)
	struct FMulticastSparseDelegate OnInputTouchEnter; // 0x1e3 (0x1)
	struct FMulticastSparseDelegate OnInputTouchLeave; // 0x1e4 (0x1)
	struct FMulticastSparseDelegate OnActorHit; // 0x1e5 (0x1)
	struct FMulticastSparseDelegate OnDestroyed; // 0x1e6 (0x1)
	struct FMulticastSparseDelegate OnEndPlay; // 0x1e7 (0x1)
	unsigned char unreflected_1e8[0x80]; // 0x1e8 (0x80) 
	struct TArray<class UActorComponent*> InstanceComponents; // 0x268 (0x10)
	struct TArray<class UActorComponent*> BlueprintCreatedComponents; // 0x278 (0x10)

	/* Functions */

	// Function /Script/Engine.Actor.WasRecentlyRendered (Underlying native function: WasRecentlyRendered 0x9a6e37c)
	bool WasRecentlyRendered(float& Tolerance); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/Engine.Actor.UserConstructionScript (Has no native function)
	void UserConstructionScript(); // (Event | Public | BlueprintEvent)

	// Function /Script/Engine.Actor.TearOff (Underlying native function: TearOff 0x6ffbf00)
	void TearOff(); // (Native | Public | BlueprintCallable)

	// Function /Script/Engine.Actor.SetTickGroup (Underlying native function: SetTickGroup 0x9a6e280)
	void SetTickGroup(struct TEnumAsByte<ETickingGroup>& NewTickGroup); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/Engine.Actor.SetTickableWhenPaused (Underlying native function: SetTickableWhenPaused 0x9a6e2fc)
