// BlueprintGeneratedClass /Game/Athena/Items/EnvironmentalItems/HidingProps/B_HidingProp.B_HidingProp_C
// Size: 0x13d2
class AB_HidingProp_C : public AFortHidingProp
{
	struct FPointerToUberGraphFrame* UberGraphFrame; // 0xf50 (0x8)
	class USceneComponent* ProjectileLocationForwardVector; // 0xf58 (0x8)
	class UStaticMeshComponent* LandedOnCollisionMesh; // 0xf60 (0x8)
	class USphereComponent* Sphere; // 0xf68 (0x8)
	class USceneComponent* HideLocationForwardVector; // 0xf70 (0x8)
	float LootMovementTimelineForward0FC694AE4A45D691CB6BD5A8CD00E521; // 0xf78 (0x4)
	float LootMovementTimelineZ0FC694AE4A45D691CB6BD5A8CD00E521; // 0xf7c (0x4)
	struct TEnumAsByte<ETimelineDirection> LootMovementTimelineDirection0FC694AE4A45D691CB6BD5A8CD00E521; // 0xf80 (0x1)
	unsigned char unreflected_f81[0x7]; // 0xf81 (0x7) 
	class UTimelineComponent* LootMovementTimeline; // 0xf88 (0x8)
	struct FScalableFloat Enabled; // 0xf90 (0x28)
	struct FScalableFloat HidingEnabled; // 0xfb8 (0x28)
	struct FScalableFloat PlayerLimit; // 0xfe0 (0x28)
	struct FScalableFloat TeleportEnabled; // 0x1008 (0x28)
	struct FScalableFloat CanTeleport; // 0x1030 (0x28)
	struct TArray<class AFortPawn*> HidingPlayers; // 0x1058 (0x10)
	struct FGameplayTag EnterGameplayCue; // 0x1068 (0x4)
	struct FGameplayTag ExitGameplayCue; // 0x106c (0x4)
	struct FGameplayTag LandedOnGameplayCue; // 0x1070 (0x4)
	unsigned char unreflected_1074[0x4]; // 0x1074 (0x4) 
	class UMaterialInstanceDynamic* Mid; // 0x1078 (0x8)
	struct FGameplayTag RustleGameplayCue; // 0x1080 (0x4)
	struct FGameplayTag ExitGameplayCuePlayer; // 0x1084 (0x4)
	struct FGameplayTag WhileEnteringGameplayCue; // 0x1088 (0x4)
	unsigned char unreflected_108c[0x4]; // 0x108c (0x4) 
	double ObstructionTraceLength; // 0x1090 (0x8)
	struct TArray<struct TEnumAsByte<EObjectTypeQuery>> DestroyObjectTypes; // 0x1098 (0x10)
	struct TArray<class AFortPawn*> Array; // 0x10a8 (0x10)
	int Int; // 0x10b8 (0x4)
	unsigned char unreflected_10bc[0x4]; // 0x10bc (0x4) 
	struct FVector DeimosPropSpawnerOffset; // 0x10c0 (0x18)
	bool FixedEntranceDirection; // 0x10d8 (0x1)
	unsigned char unreflected_10d9[0x7]; // 0x10d9 (0x7) 
	double MaxInteractAngle; // 0x10e0 (0x8)
	struct FVector WobbleLocationOffset; // 0x10e8 (0x18)
	double InteractBelowPropDistance; // 0x1100 (0x8)
	struct TMap<class AFortPawn*, double> HiddenPlayersAndEnterTimes; // 0x1108 (0x50)
	class AFortPawn* LastPawnToInteract; // 0x1158 (0x8)
	class AB_HidingProp_C* TargetTeleporter; // 0x1160 (0x8)
	struct FGameplayTag TeleporterEnterGameplayCue; // 0x1168 (0x4)
	struct FGameplayTag TeleporterExitGameplayCue; // 0x116c (0x4)
	struct FGameplayTag LoopingTeleportingCue; // 0x1170 (0x4)
	struct FGameplayTag GCWobble; // 0x1174 (0x4)
	struct FTimerHandle* WobbleTimerHandle; // 0x1178 (0x8)
	struct TArray<struct FGameplayTag> BlockEntranceTags; // 0x1180 (0x10)
	struct TArray<struct FGameplayTag> BlockExitTags; // 0x1190 (0x10)
	class UAnimMontage* EnterAnimMontage; // 0x11a0 (0x8)
	class UAnimMontage* ExitAnimMontage; // 0x11a8 (0x8)
	class AFortPawn* LastPawnToHide; // 0x11b0 (0x8)
	struct FGameplayTag TeleportingStateGC; // 0x11b8 (0x4)
	bool RandomWobbleNormal; // 0x11bc (0x1)
	bool SingleOccupant; // 0x11bd (0x1)
	bool Teleporting; // 0x11be (0x1)
	bool JumpOut; // 0x11bf (0x1)
	class UClass* GEOnExitingPropNoJumpBlockActions; // 0x11c0 (0x8)
	bool DestroyInNonSpyLTM; // 0x11c8 (0x1)
	bool ActiveInSpyLTM; // 0x11c9 (0x1)
	unsigned char unreflected_11ca[0x6]; // 0x11ca (0x6) 
	struct TArray<struct FGameplayTag> ForceAllowInteractTags; // 0x11d0 (0x10)
	struct FGameplayTag IsTeleporter; // 0x11e0 (0x4)
	struct FGameplayTag ContainsPlayerRepNof; // 0x11e4 (0x4)
	struct FVector ObstructionTraceExtents; // 0x11e8 (0x18)
	struct FVector ObstructionTraceStartOffSet; // 0x1200 (0x18)
	double ExitLaunchVelocity; // 0x1218 (0x8)
	struct FVector AdditionalLaunchVelocity; // 0x1220 (0x18)
	struct FVector FixedEntraceObstructionTraceEndOffset; // 0x1238 (0x18)
	bool isActiveTeleportExit; // 0x1250 (0x1)
	unsigned char unreflected_1251[0x7]; // 0x1251 (0x7) 
	class UClass* GETeleportAbilityGranted; // 0x1258 (0x8)
	bool DisableWhenSubmergedInWater; // 0x1260 (0x1)
	unsigned char unreflected_1261[0x7]; // 0x1261 (0x7) 
	struct FGameplayTagContainer DisableWhenSubmergedExceptionTags; // 0x1268 (0x20)
	struct TArray<class AFortPawn*> NonCosmeticPawns; // 0x1288 (0x10)
	class UClass* CameraModifier; // 0x1298 (0x8)
	struct FVector NewVar0; // 0x12a0 (0x18)
	class AActor* Pawn; // 0x12b8 (0x8)
	struct FVector LootCachedActorForward; // 0x12c0 (0x18)
	struct TArray<struct FVector> LootVectorOffsets; // 0x12d8 (0x10)
	bool SpawnedLoot; // 0x12e8 (0x1)
	unsigned char unreflected_12e9[0x7]; // 0x12e9 (0x7) 
	double LootMoveForwardDistance; // 0x12f0 (0x8)
	double LootMoveUpDistance; // 0x12f8 (0x8)
	double LootSpawnRadius; // 0x1300 (0x8)
	struct FVector LootSpawnOffset; // 0x1308 (0x18)
	bool ShouldSpawnLoot; // 0x1320 (0x1)
	unsigned char unreflected_1321[0x7]; // 0x1321 (0x7) 
	struct FString LootTierGroup; // 0x1328 (0x10)
	bool SetEntranceRotation; // 0x1338 (0x1)
	unsigned char unreflected_1339[0x7]; // 0x1339 (0x7) 
	class UClass* PropSpecificEffectToApplyToHiders; // 0x1340 (0x8)
	struct FScalableFloat RustlesPerWobble; // 0x1348 (0x28)
	struct FScalableFloat RustleWobbleRadius; // 0x1370 (0x28)
	struct FScalableFloat EnterWobbleRadius; // 0x1398 (0x28)
	double NonJumpExitDistance; // 0x13c0 (0x8)
	class UClass* CameraMode; // 0x13c8 (0x8)
	bool MoveToActorOnEnter; // 0x13d0 (0x1)
	bool IgnorePhysicsBodyCollisionOnEnter; // 0x13d1 (0x1)

	/* Functions */

	// Function /Game/Athena/Items/EnvironmentalItems/HidingProps/B_HidingProp.B_HidingProp_C.LocalOnFailedInteract (Has no native function)
	void LocalOnFailedInteract(class AFortPlayerPawn*& InteractingPawn); // (Event | Public | BlueprintCallable | BlueprintEvent | Const)

	// Function /Game/Athena/Items/EnvironmentalItems/HidingProps/B_HidingProp.B_HidingProp_C.GetMinDistanceFromInteraction (Has no native function)
	float GetMinDistanceFromInteraction(); // (Event | Public | HasOutParms | BlueprintCallable | BlueprintEvent | Const)

	// Function /Game/Athena/Items/EnvironmentalItems/HidingProps/B_HidingProp.B_HidingProp_C.GetPlayerLimit (Has no native function)
	void GetPlayerLimit(int& PlayerLimit, float& CallFuncGetValueAtLevelReturnValue, int& CallFuncFTruncReturnValue, double& CallFuncFTruncAImplicitCast); // (Public | HasOutParms | BlueprintCallable | BlueprintEvent | BlueprintPure | Const)

