// Class /Script/FortniteGame.FortPawn
// Size: 0x1ad0
class AFortPawn : public AFGF_Character
{
	unsigned char unreflected_680[0x88]; // 0x680 (0x88) 
	unsigned char bUseBaseChanged; // 0x708 (0x1)
	unsigned char bIgnoreNextFallingDamage; // 0x708 (0x1)
	unsigned char bAllowDeathFromFallingDamage; // 0x708 (0x1)
	unsigned char bIsDying; // 0x708 (0x1)
	unsigned char bPlayedDying; // 0x708 (0x1)
	unsigned char bIsHiddenForDeath; // 0x708 (0x1)
	unsigned char bIsKnockedback; // 0x708 (0x1)
	unsigned char bIsStaggered; // 0x709 (0x1)
	unsigned char bCanCapsuleBeUsedForTargeting; // 0x709 (0x1)
	unsigned char bUseLineTestForDamageZoneBoneDetection; // 0x709 (0x1)
	unsigned char bMovingEmote; // 0x709 (0x1)
	unsigned char bMovingEmoteForwardOnly; // 0x709 (0x1)
	unsigned char bMovingEmoteFollowingOnly; // 0x709 (0x1)
	unsigned char bMovingEmoteSkipLandingFX; // 0x70a (0x1)
	unsigned char bIsInvulnerable; // 0x70a (0x1)
	unsigned char bSpotted; // 0x70a (0x1)
	unsigned char bRegisterWithAISight; // 0x70a (0x1)
	unsigned char bRegisterWithAimAssist; // 0x70a (0x1)
	unsigned char bPrimaryInputHeld; // 0x70a (0x1)
	unsigned char bSecondaryInputHeld; // 0x70a (0x1)
	unsigned char bPrimaryInputQueued; // 0x70a (0x1)
	unsigned char bWeaponActivated; // 0x70b (0x1)
	unsigned char bIsInGoop; // 0x70b (0x1)
	unsigned char bReplicatedIsInGoop; // 0x70b (0x1)
	unsigned char bIsSliding; // 0x70b (0x1)
	unsigned char bIsSkating; // 0x70b (0x1)
	unsigned char unreflected_70c[0x4]; // 0x70c (0x4) 
	struct FGameplayTagContainer AdditionalPickupTags; // 0x710 (0x20)
	enum EFortPickupSpawnSource SpawnSourceOverride; // 0x730 (0x1)
	unsigned char bIsSwinging; // 0x731 (0x1)
	unsigned char bIsSynchedAction; // 0x731 (0x1)
	unsigned char bSwingingAttached; // 0x731 (0x1)
	unsigned char unreflected_732[0x6]; // 0x732 (0x6) 
	struct FVector SwingAttachLocation; // 0x738 (0x18)
	float SwingAttachLocationUpdateDistanceThreshold; // 0x750 (0x4)
	unsigned char unreflected_754[0xc]; // 0x754 (0xc) 
	struct FSynchedActionWarpPointInfo_Replicated ReplicatedSynchedActionWarpPointInfo; // 0x760 (0x50)
	unsigned char unreflected_7b0[0x61]; // 0x7b0 (0x61) 
	unsigned char bSkipAnalogJump; // 0x811 (0x1)
	struct TEnumAsByte<ETraceTypeQuery> FootstepTraceTypeQuery; // 0x812 (0x1)
	struct TEnumAsByte<EFortFootstepSurfaceType> FootstepSurfaceType; // 0x813 (0x1)
	unsigned char unreflected_814[0x4]; // 0x814 (0x4) 
	class UFortSoundIndicatorComponent* SoundIndicatorComponent; // 0x818 (0x8)
	unsigned char unreflected_820[0x10]; // 0x820 (0x10) 
	enum EUpdateRateShiftBucket UroShiftBucket; // 0x830 (0x1)
	unsigned char bUpdateMeshComponentUpdateFlagOnServer; // 0x831 (0x1)
	unsigned char bUROCanTieToLODs; // 0x831 (0x1)
	unsigned char bPostProcessNavLocation; // 0x831 (0x1)
	unsigned char bHealthSynced; // 0x831 (0x1)
	unsigned char bWeaponHolstered; // 0x831 (0x1)
	unsigned char bSkipReticleColorTrace; // 0x831 (0x1)
	unsigned char bPrioritizePawnCollisionsOnAbilityTargetSelectionVisibilityTest; // 0x831 (0x1)
	unsigned char bTreatAsPawnForHitMarkers; // 0x832 (0x1)
	unsigned char bDisplayPawnHitMarkersForChildActors; // 0x832 (0x1)
	unsigned char bUsesStats; // 0x832 (0x1)
	unsigned char bAllowBuildingActorTeleport; // 0x832 (0x1)
	unsigned char bIsDBNO; // 0x832 (0x1)
	unsigned char bWasDBNOOnDeath; // 0x832 (0x1)
	unsigned char bCachedIsInAthena; // 0x832 (0x1)
	unsigned char bShouldUseCharacterMovementIdleFastPath; // 0x832 (0x1)
	struct TEnumAsByte<EFortMovementStyle> CurrentMovementStyle; // 0x833 (0x1)
	enum EFortControlRecoveryBehavior ControlRecoveryBehavior; // 0x834 (0x1)
	unsigned char TeleportCounter; // 0x835 (0x1)
	unsigned char unreflected_836[0x2]; // 0x836 (0x2) 
	struct FDataTableRowHandle PawnStatHandle; // 0x838 (0x10)
	float SlidingFriction; // 0x848 (0x4)
	unsigned char bIsSlopeSliding; // 0x84c (0x1)
	unsigned char unreflected_84d[0x1]; // 0x84d (0x1) 
	uint16_t PackedReplicatedSlopeAngles; // 0x84e (0x2)
	float SlidingBrakingDeceleration; // 0x850 (0x4)
	unsigned char unreflected_854[0x4]; // 0x854 (0x4) 
	class UFortStormShieldComponent* StormShieldComponent; // 0x858 (0x8)
	struct FMulticastInlineDelegate OnStormShieldComponentCreated; // 0x860 (0x10)
	enum EFortPawnPushSize PushSize; // 0x870 (0x1)
	unsigned char unreflected_871[0xb]; // 0x871 (0xb) 
	float LastSurfaceTraceTime; // 0x87c (0x4)
	struct FVector LastSurfaceTraceLocation; // 0x880 (0x18)
	unsigned char unreflected_898[0x28]; // 0x898 (0x28) 
	struct FMulticastInlineDelegate OnPawnJumped; // 0x8c0 (0x10)
	unsigned char bIsJumping; // 0x8d0 (0x1)
	unsigned char unreflected_8d1[0x3]; // 0x8d1 (0x3) 
	int PawnUniqueID; // 0x8d4 (0x4)
	class AFortWeapon* CurrentWeapon; // 0x8d8 (0x8)
	class AFortWeapon* PreviousWeapon; // 0x8e0 (0x8)
	struct TArray<class AFortWeapon*> CurrentWeaponList; // 0x8e8 (0x10)
	struct FString PreviousAbilityWeaponNameForTelemetry; // 0x8f8 (0x10)
	unsigned char unreflected_908[0x60]; // 0x908 (0x60) 
	struct FName WeaponHandSocketName; // 0x968 (0x4)
	struct FName LeftHandWeaponHandSocketName; // 0x96c (0x4)
	class AActor* SpawnSpot; // 0x970 (0x8)
	struct FGameplayTagContainer DeathTags; // 0x978 (0x20)
	float SpawnImmunityTime; // 0x998 (0x4)
	unsigned char unreflected_99c[0x4]; // 0x99c (0x4) 
	class AFortWaterBodyActor* CurrentWaterBody; // 0x9a0 (0x8)
	bool bShouldSupportSurfaceSwimming; // 0x9a8 (0x1)
	unsigned char unreflected_9a9[0x7]; // 0x9a9 (0x7) 
	class AFortWaterBodyActor* ReplicatedWaterBody; // 0x9b0 (0x8)
	struct TArray<class AFortPickup*> IncomingPickups; // 0x9b8 (0x10)
	struct TArray<struct FFortPickupEntryData> PickupDirectionData; // 0x9c8 (0x10)
	bool bIsStunned; // 0x9d8 (0x1)
	unsigned char unreflected_9d9[0x7]; // 0x9d9 (0x7) 
	struct TArray<struct FWindVolumeData> WindVolumes; // 0x9e0 (0x10)
	struct FVortexParams VortexParams; // 0x9f0 (0x80)
	unsigned char bIsInVortex; // 0xa70 (0x1)
	unsigned char bReplicatedIsInVortex; // 0xa70 (0x1)
	unsigned char unreflected_a71[0x7]; // 0xa71 (0x7) 
	class AFortSkyTube* CurrentSkyTube; // 0xa78 (0x8)
	class AFortSkyTube* ReplicatedSkyTube; // 0xa80 (0x8)
	struct TArray<class AFortSkyTube*> OverlappedSkyTubes; // 0xa88 (0x10)
	struct FScalableFloat bPrioritizeEarlierTubes; // 0xa98 (0x28)
	struct FMulticastInlineDelegate OnSkyTubeChanged; // 0xac0 (0x10)
	struct FMulticastInlineDelegate OnSearchedContainer; // 0xad0 (0x10)
	int AdditiveCringeCount; // 0xae0 (0x4)
	float AdditiveCringeDuration; // 0xae4 (0x4)
	bool bSupportsDamageNumbersAtHitLocation; // 0xae8 (0x1)
	unsigned char unreflected_ae9[0x7]; // 0xae9 (0x7) 
	struct FVector_NetQuantize PushMomentum; // 0xaf0 (0x18)
	unsigned char unreflected_b08[0x4]; // 0xb08 (0x4) 
	float LocalSpin; // 0xb0c (0x4)
	unsigned char unreflected_b10[0x1]; // 0xb10 (0x1) 
	bool bTurnTransitionActiveAndControllingRotation; // 0xb11 (0x1)
	unsigned char unreflected_b12[0x5a]; // 0xb12 (0x5a) 
	struct FGameplayCueTag DeathCueTag; // 0xb6c (0x4)
	struct TArray<struct FFortStatManagerTag> DeathStatTags; // 0xb70 (0x10)
	class USkeletalMeshSocket* DeathHitSocket; // 0xb80 (0x8)
	struct FMulticastInlineDelegate OnPlayerStartDBNO; // 0xb88 (0x10)
	struct FMulticastInlineDelegate OnDBNOStateChanged; // 0xb98 (0x10)
	float DefaultLifespanAfterDeath; // 0xba8 (0x4)
	float TeamBeaconMaxDist; // 0xbac (0x4)
	struct FColor TeamBeaconTextColor; // 0xbb0 (0x4)
	float LastTakeHitTimeTimeout; // 0xbb4 (0x4)
	float LastDamagedTime; // 0xbb8 (0x4)
	unsigned char unreflected_bbc[0x4]; // 0xbbc (0x4) 
	class AFortWeapon* CurrentlyAttachedWeapon; // 0xbc0 (0x8)
	class UPrimitiveComponent* CachedNavFloor; // 0xbc8 (0x8)
	float MaxFootstepDistance; // 0xbd0 (0x4)
	unsigned char unreflected_bd4[0x4]; // 0xbd4 (0x4) 
	class USoundBase* DBNOLandingSound; // 0xbd8 (0x8)
	class USoundBase* DefaultFootstepSound; // 0xbe0 (0x8)
	class USoundBase* DefaultFastFootstepSound; // 0xbe8 (0x8)
	class USoundBase* DefaultLandingSound; // 0xbf0 (0x8)
	class USoundBase* DefaultHardLandingSound; // 0xbf8 (0x8)
	class USoundBase* DefaultJumpSound; // 0xc00 (0x8)
	class UWeaponHitNotifyAudioBank* DefaultHitNotifyAudioBank; // 0xc08 (0x8)
	class UFortSwimmingAudioBank* DefaultSwimmingAudioBank; // 0xc10 (0x8)
	float LineTestForDamageZoneBoneDetectionRadius; // 0xc18 (0x4)
	unsigned char unreflected_c1c[0x4]; // 0xc1c (0x4) 
	struct FPawnDamageZones DamageZones[0x5]; // 0xc20 (0x18) (ARRAY) 
	unsigned char DamageZoneActiveBitMask; // 0xc98 (0x1)
	unsigned char unreflected_c99[0x3]; // 0xc99 (0x3) 
	float TargettingZOffset; // 0xc9c (0x4)
	unsigned char JumpFlashCountPacked; // 0xca0 (0x1)
	unsigned char LandingFlashCountPacked; // 0xca1 (0x1)
	unsigned char unreflected_ca2[0x6]; // 0xca2 (0x6) 
	struct TMap<struct FName, struct FEmoteAudioComponentData> EmoteAudioComps; // 0xca8 (0x50)
	class USoundAttenuation* FrontEndEmoteAudioAttenuation; // 0xcf8 (0x8)
	class USoundAttenuation* InGameEmoteAudioAttenuation; // 0xd00 (0x8)
	class USoundEffectSourcePresetChain* InGameEmoteSoundEffectSoundPresetChain; // 0xd08 (0x8)
	struct TMap<int, class UMeshComponent*> EmoteMeshComps; // 0xd10 (0x50)
	struct TMap<int, class AActor*> EmotePropActors; // 0xd60 (0x50)
	struct TMap<int, class UParticleSystemComponent*> EmoteParticleSystemComps; // 0xdb0 (0x50)
	int EmoteCount; // 0xe00 (0x4)
	float LastEmoteTime; // 0xe04 (0x4)
	float LastEmoteEndTime; // 0xe08 (0x4)
	unsigned char unreflected_e0c[0x4]; // 0xe0c (0x4) 
	class UFortItemDefinition* LastEmoteItemDef; // 0xe10 (0x8)
	class UFortItemDefinition* LastReplicatedEmoteExecuted; // 0xe18 (0x8)
	bool bFireBlockedByEmoteCooldown; // 0xe20 (0x1)
	unsigned char unreflected_e21[0x3]; // 0xe21 (0x3) 
	float EmoteToFireCooldownTime; // 0xe24 (0x4)
	float EmoteWalkSpeed; // 0xe28 (0x4)
	unsigned char unreflected_e2c[0x4]; // 0xe2c (0x4) 
	struct TArray<class UActorComponent*> DynamicComponents; // 0xe30 (0x10)
	struct TArray<class UFortGameplayModifierItemDefinition*> AdditionalModifierDefinitions; // 0xe40 (0x10)
	struct FMulticastInlineDelegate OnPawnTeleported; // 0xe50 (0x10)
	struct FMulticastInlineDelegate OnPawnLanded; // 0xe60 (0x10)
	struct FMulticastInlineDelegate OnPawnStartedEmote; // 0xe70 (0x10)
	struct FMulticastInlineDelegate OnPawnStoppedEmote; // 0xe80 (0x10)
	struct FMulticastInlineDelegate OnHitPawn; // 0xe90 (0x10)
	struct FMulticastInlineDelegate OnDied; // 0xea0 (0x10)
	struct FMulticastInlineDelegate OnDeathEffects; // 0xeb0 (0x10)
	unsigned char unreflected_ec0[0x30]; // 0xec0 (0x30) 
	struct FMulticastInlineDelegate OnDamaged; // 0xef0 (0x10)
	struct FMulticastInlineDelegate OnDidDamage; // 0xf00 (0x10)
	unsigned char unreflected_f10[0x10]; // 0xf10 (0x10) 
	class UFortEmoteComponent* EmoteComponent; // 0xf20 (0x8)
	class UFortFootstepAudioBank* FootstepBank; // 0xf28 (0x8)
	unsigned char unreflected_f30[0x20]; // 0xf30 (0x20) 
	struct FVector CachedStepSurfaceNormal; // 0xf50 (0x18)
	class UFortFoleyFootstepContext* FoleyFootstepContext; // 0xf68 (0x8)
	class UFortFoleyHitContext* FoleyHitContext; // 0xf70 (0x8)
	struct FMulticastInlineDelegate OnWeaponEquippedDelegate; // 0xf78 (0x10)
	struct FMulticastInlineDelegate OnWeaponUnEquippedDelegate; // 0xf88 (0x10)
	struct FMulticastInlineDelegate OnWeaponAttachmentChangedDelegate; // 0xf98 (0x10)
	class UClass* HealthRegenDelayGameplayEffect; // 0xfa8 (0x8)
	class UClass* HealthRegenGameplayEffect; // 0xfb0 (0x8)
	class UClass* ShieldRegenDelayGameplayEffect; // 0xfb8 (0x8)
	class UClass* ShieldRegenGameplayEffect; // 0xfc0 (0x8)
	class UClass* CurrentWeaponAnimLayerOverlayClass; // 0xfc8 (0x8)
	struct FMulticastInlineDelegate OnHolsteredEvent; // 0xfd0 (0x10)
	struct FMulticastInlineDelegate OnUnholsteredEvent; // 0xfe0 (0x10)
	unsigned char unreflected_ff0[0x18]; // 0xff0 (0x18) 
	int WeaponHolsterCounter; // 0x1008 (0x4)
	unsigned char unreflected_100c[0x4]; // 0x100c (0x4) 
	struct TArray<struct FName> WeaponHolsterIds; // 0x1010 (0x10)
	float StaySpottedTime; // 0x1020 (0x4)
	struct FName SpottedEvent; // 0x1024 (0x4)
	class UFortFeedbackBank* DefaultFeedback; // 0x1028 (0x8)
	struct TArray<class AFortEmitterCameraLensEffectDirectional*> ActiveSoundIndicators; // 0x1030 (0x10)
	class UClass* DefaultSoundTrackingVisual; // 0x1040 (0x8)
	struct FGameplayTagContainer SoundTrackingVisibilityTags; // 0x1048 (0x20)
	struct TMap<enum EFortSoundIndicatorTypes, float> PriorityModifiers; // 0x1068 (0x50)
	struct TArray<struct FFortPawnVocalChord> VocalChords; // 0x10b8 (0x10)
	unsigned char unreflected_10c8[0x58]; // 0x10c8 (0x58) 
	bool bIsDisconnectedPawn; // 0x1120 (0x1)
	unsigned char unreflected_1121[0x3]; // 0x1121 (0x3) 
	struct FActiveGameplayEffectHandle* MaxHealthApplicationHandle; // 0x1124 (0x8)
	unsigned char unreflected_112c[0x4]; // 0x112c (0x4) 
	class UClass* MaxHealthApplicationGameplayEffect; // 0x1130 (0x8)
	class UFortHealthSet* HealthSet; // 0x1138 (0x8)
	class UFortControlResistanceSet* ControlResistanceSet; // 0x1140 (0x8)
	class UFortDamageSet* DamageSet; // 0x1148 (0x8)
	class UFortMovementSet* MovementSet; // 0x1150 (0x8)
	class UFortAdvancedMovementSet* AdvancedMovementSet; // 0x1158 (0x8)
	unsigned char unreflected_1160[0x8]; // 0x1160 (0x8) 
	struct FMulticastInlineDelegate OnAbilityDecisionWindowStackUpdated; // 0x1168 (0x10)
	unsigned char unreflected_1178[0x30]; // 0x1178 (0x30) 
	class UFortAbilitySystemComponent* AbilitySystemComponent; // 0x11a8 (0x8)
	struct TArray<struct FFortActiveMontageDecisionWindow> DecisionWindowStack; // 0x11b0 (0x10)
	struct FGameplayTagContainer GameplayTags; // 0x11c0 (0x20)
	struct FText DisplayName; // 0x11e0 (0x18)
	struct TArray<struct FDamagerInfo> Damagers; // 0x11f8 (0x10)
	struct TArray<struct FDamageDoneSourceInfo> TotalDamageDoneTrackers; // 0x1208 (0x10)
	struct TArray<struct FDamageDoneTargetInfo> TargetDamageDoneTrackers; // 0x1218 (0x10)
	struct TArray<struct FDamageDoneSourceInfo> TotalDamageTakenTrackers; // 0x1228 (0x10)
	struct TArray<struct FDamageDoneTargetInfo> TargetDamageTakenTrackers; // 0x1238 (0x10)
	float DamageDoneLastAtTime; // 0x1248 (0x4)
	float DamageTakenLastAtTime; // 0x124c (0x4)
	float LastHitTime; // 0x1250 (0x4)
	float TotalPlayerDamageDealt; // 0x1254 (0x4)
	class UFortHealthBarIndicator* HealthBarIndicator; // 0x1258 (0x8)
	struct FGameplayTag CurrentCalloutTag; // 0x1260 (0x4)
	unsigned char unreflected_1264[0x4]; // 0x1264 (0x4) 
	struct TArray<struct FCalloutEntry> CalloutEntries; // 0x1268 (0x10)
	float HealthBarWidth; // 0x1278 (0x4)
	float HealthBarHeightMultiplier; // 0x127c (0x4)
	unsigned char unreflected_1280[0x10]; // 0x1280 (0x10) 
	struct FSlateBrush SpottedBrush; // 0x1290 (0xc0)
	struct FVector SpottedIconOffset; // 0x1350 (0x18)
	int ClientNonRenderedAnimUpdateRate; // 0x1368 (0x4)
	int MaxEvalRateForInterpolation; // 0x136c (0x4)
	struct TArray<float> AnimUpdateRateVisibleMaxDistanceFactor; // 0x1370 (0x10)
	struct TMap<int, int> LODToFrameSkipMap; // 0x1380 (0x50)
	unsigned char unreflected_13d0[0x10]; // 0x13d0 (0x10) 
	struct FFortConversationSentence CurrentSentence; // 0x13e0 (0xc0)
	unsigned char unreflected_14a0[0x18]; // 0x14a0 (0x18) 
	struct FMulticastInlineDelegate OnPawnHealthChanged; // 0x14b8 (0x10)
	struct FMulticastInlineDelegate OnPawnMaxOvershieldChanged; // 0x14c8 (0x10)
	struct FAthenaBatchedDamageGameplayCues_Shared AccumulatedBatchDataShared; // 0x14d8 (0x78)
	struct FAthenaBatchedDamageGameplayCues_NonShared AccumulatedBatchDataNonShared; // 0x1550 (0x10)
	unsigned char unreflected_1560[0x8]; // 0x1560 (0x8) 
	struct FGameplayCueParameters BatchedGameplayCueParameters; // 0x1568 (0xd0)
	struct FGameplayTagContainer ReplayItemActions; // 0x1638 (0x20)
	unsigned char unreflected_1658[0x20]; // 0x1658 (0x20) 
	struct FGameplayTagContainer HidingVisibilityTags; // 0x1678 (0x20)
	struct FGameplayTagContainer HidingTransitionVisibilityTags; // 0x1698 (0x20)
	class UPegasusGameEventCollector* PegasusTimelineCollector; // 0x16b8 (0x8)
	class UFortAthenaAILODComponent* AILODComponent; // 0x16c0 (0x8)
	unsigned char unreflected_16c8[0x20]; // 0x16c8 (0x20) 
	struct FClientAILODSettings ClientAILODSettings; // 0x16e8 (0x2f0)
	struct FGameplayTag FallbackTag; // 0x19d8 (0x4)
	unsigned char unreflected_19dc[0x4]; // 0x19dc (0x4) 
	struct FString DebugType; // 0x19e0 (0x10)
	struct TMap<uint32_t, struct FRecordedGunshot> RecordedGunshots; // 0x19f0 (0x50)
	unsigned char unreflected_1a40[0x40]; // 0x1a40 (0x40) 
	struct FMulticastInlineDelegate OnPawnComponentAttachedEvent; // 0x1a80 (0x10)
	unsigned char unreflected_1a90[0x30]; // 0x1a90 (0x30) 
	struct TArray<class ABuildingActor*> OverlappingBuildings; // 0x1ac0 (0x10)

	/* Functions */

	// Function /Script/FortniteGame.FortPawn.WillFallFromHeightCauseDamage (Underlying native function: WillFallFromHeightCauseDamage 0x8ac6cfc)
	bool WillFallFromHeightCauseDamage(float& FallDistance); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortPawn.WasDBNOOnDeath (Underlying native function: WasDBNOOnDeath 0x286fc7c)
	bool WasDBNOOnDeath(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortPawn.UnlinkAnimLayer (Underlying native function: UnlinkAnimLayer 0x8ac6c5c)
	void UnlinkAnimLayer(class UClass*& AnimLayer); // (Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortPawn.TriggerFeedbackEvent (Underlying native function: TriggerFeedbackEvent 0x8ac6a74)
