// Class /Script/FortniteGame.FortPlayerPawn
// Size: 0x4330
class AFortPlayerPawn : public AFortPawn
{
	unsigned char unreflected_1ad0[0x40]; // 0x1ad0 (0x40) 
	struct FFortAthenaVehicleInputStateReliable VehicleInputStateReliable; // 0x1b10 (0x2)
	unsigned char bIsNearSafeZoneEdge; // 0x1b12 (0x1)
	unsigned char bPlayingSafeZoneEffects; // 0x1b12 (0x1)
	unsigned char bDoSafeZoneCleanup; // 0x1b12 (0x1)
	unsigned char bIsSwimmingAnimLayerLinked; // 0x1b12 (0x1)
	unsigned char bIsSwimmingAnimLayerPendingRemove; // 0x1b12 (0x1)
	unsigned char bIsSprintJump; // 0x1b12 (0x1)
	unsigned char bHasDisableSprintTag; // 0x1b12 (0x1)
	unsigned char bIsTacticalSprinting; // 0x1b12 (0x1)
	unsigned char bDisableSwimSprintCancel; // 0x1b13 (0x1)
	unsigned char bIsWaterJump; // 0x1b13 (0x1)
	unsigned char bIsWaterSprintBoost; // 0x1b13 (0x1)
	unsigned char bIsWaterSprintBoostPending; // 0x1b13 (0x1)
	unsigned char bPlayingPassengerToPassengerAnimation; // 0x1b13 (0x1)
	unsigned char bPlayingDriverToPassengerAnimation; // 0x1b13 (0x1)
	unsigned char bIsTargeting; // 0x1b14 (0x1)
	unsigned char bIsTargetingConsumableThrow; // 0x1b14 (0x1)
	unsigned char bIsSwappingCharacterParts; // 0x1b14 (0x1)
	unsigned char bBalloonMovementActivated; // 0x1b14 (0x1)
	unsigned char bIsScriptedBot; // 0x1b14 (0x1)
	unsigned char bBuildHotfix; // 0x1b14 (0x1)
	unsigned char unreflected_1b15[0x1]; // 0x1b15 (0x1) 
	struct FLightingChannels FortPlayerPawnLightingChannels; // 0x1b16 (0x1)
	unsigned char unreflected_1b17[0x1]; // 0x1b17 (0x1) 
	enum EFortPawnStasisMode StasisMode; // 0x1b18 (0x1)
	unsigned char unreflected_1b19[0x7]; // 0x1b19 (0x7) 
	struct TArray<enum EFortPawnStasisMode> StasisModes; // 0x1b20 (0x10)
	unsigned char unreflected_1b30[0x1]; // 0x1b30 (0x1) 
	struct TEnumAsByte<EFortBuildingState> BuildingState; // 0x1b31 (0x1)
	int8_t AccelerationZPack; // 0x1b32 (0x1)
	unsigned char unreflected_1b33[0x1d]; // 0x1b33 (0x1d) 
	class UCurveFloat* ParachuteDirectionalSpeedMultiplierCurve; // 0x1b50 (0x8)
	class UCurveFloat* SkydivingDirectionalSpeedMultiplierCurve; // 0x1b58 (0x8)
	class UCurveFloat* BallooningDirectionalSpeedMultiplierCurve; // 0x1b60 (0x8)
	class UCurveFloat* DirectionalSpeedMultiplierCurve; // 0x1b68 (0x8)
	float LastCustomizationTimestamp; // 0x1b70 (0x4)
	float MinimumTimeBetweenSteps; // 0x1b74 (0x4)
	float LastStepTime; // 0x1b78 (0x4)
	unsigned char unreflected_1b7c[0x4]; // 0x1b7c (0x4) 
	struct FMulticastInlineDelegate OnFootstepEvent; // 0x1b80 (0x10)
	struct FMulticastInlineDelegate OnPawnEnterWater; // 0x1b90 (0x10)
	struct FMulticastInlineDelegate OnPawnExitWater; // 0x1ba0 (0x10)
	unsigned char unreflected_1bb0[0x18]; // 0x1bb0 (0x18) 
	struct FMulticastInlineDelegate OnPawnExitSwinging; // 0x1bc8 (0x10)
	float CurrentPawnSquaredSpeedXY; // 0x1bd8 (0x4)
	unsigned char unreflected_1bdc[0x4]; // 0x1bdc (0x4) 
	struct FRotator CurrentPawnVelXYRot; // 0x1be0 (0x18)
	float CurrentPawnSquaredSpeed; // 0x1bf8 (0x4)
	bool bIsInWaterVolume; // 0x1bfc (0x1)
	bool bNotifyBlueprintWhenLandscapeTeleporting; // 0x1bfd (0x1)
	unsigned char unreflected_1bfe[0x6]; // 0x1bfe (0x6) 
	unsigned char CachedTeamControllingRC; // 0x1c04 (0x1)
	unsigned char BalloonActiveCount; // 0x1c05 (0x1)
	unsigned char bParachuteDeployFixedVerticalDistance; // 0x1c06 (0x1)
	bool bIsSkydiving; // 0x1c07 (0x1)
	bool bIsParachuteOpen; // 0x1c08 (0x1)
	unsigned char bLocalIsSkydiving; // 0x1c09 (0x1)
	unsigned char bLocalIsParachuteForcedOpen; // 0x1c09 (0x1)
	unsigned char bIsParachuteForcedOpen; // 0x1c09 (0x1)
	unsigned char bIsSkydivingFromBus; // 0x1c09 (0x1)
	unsigned char bIsSkydivingFromLaunchPad; // 0x1c09 (0x1)
	unsigned char bPendingSkydiveLaunch; // 0x1c09 (0x1)
	unsigned char bIsInSlipperyMovement; // 0x1c09 (0x1)
	unsigned char bReplicatedIsInSlipperyMovement; // 0x1c0a (0x1)
	unsigned char bIsBelowAutoDeployTestHeight; // 0x1c0a (0x1)
	unsigned char bIsProxySimulationTimedOut; // 0x1c0a (0x1)
	unsigned char bIsPedestalHero; // 0x1c0a (0x1)
	unsigned char bInGliderRedeploy; // 0x1c0a (0x1)
	unsigned char bLocalInGliderRedeploy; // 0x1c0a (0x1)
	unsigned char bBeingRepossessed; // 0x1c0a (0x1)
	unsigned char bInitAbilitySystemComponentFromPlayerState; // 0x1c0b (0x1)
	unsigned char bStartedInteractSearch; // 0x1c0b (0x1)
	unsigned char bSignificanceLODDirty; // 0x1c0b (0x1)
	unsigned char bIsUsingJetpack; // 0x1c0b (0x1)
	unsigned char bIsPlayingEmote; // 0x1c0b (0x1)
	unsigned char bShowingOverdriveEffect; // 0x1c0b (0x1)
	unsigned char bIsRespawning; // 0x1c0b (0x1)
	unsigned char bIsRespawningInAir; // 0x1c0b (0x1)
	unsigned char bInitializedPostRepPlayerState; // 0x1c0c (0x1)
	unsigned char bHasWaterParticleSystem; // 0x1c0c (0x1)
	unsigned char bCanShowDefaultSkin; // 0x1c0c (0x1)
	unsigned char bDisabledTetheringSupport; // 0x1c0c (0x1)
	unsigned char bIsInFrontEndHologram; // 0x1c0c (0x1)
	unsigned char unreflected_1c0d[0x4f]; // 0x1c0d (0x4f) 
	struct TWeakObjectPtr<class AActor> HeldObject; // 0x1c5c (0x8)
	unsigned char unreflected_1c64[0x14]; // 0x1c64 (0x14) 
	unsigned char bForceMoveRelativeToCameraRotation; // 0x1c78 (0x1)
	unsigned char bIsWaitingForEmoteInteraction; // 0x1c78 (0x1)
	unsigned char bIsEmoteLeader; // 0x1c78 (0x1)
	unsigned char bShouldSyncAnimationWithEmoteLeader; // 0x1c78 (0x1)
	unsigned char bShouldJitterAnimationSyncWithEmoteLeader; // 0x1c78 (0x1)
	unsigned char bDoubleFileEmoteSecondLine; // 0x1c78 (0x1)
	unsigned char bEmoteUsesSecondaryFire; // 0x1c78 (0x1)
	unsigned char bLockGroupEmoteLeaderRotation; // 0x1c78 (0x1)
	unsigned char unreflected_1c79[0x7]; // 0x1c79 (0x7) 
	int EmoteBandLeaderIndex; // 0x1c80 (0x4)
	unsigned char unreflected_1c84[0x4]; // 0x1c84 (0x4) 
	class AFortPlayerPawn* GroupEmoteLookTarget; // 0x1c88 (0x8)
	class AFortPlayerPawn* GroupEmoteTailTarget; // 0x1c90 (0x8)
	struct TArray<class AFortPlayerPawn*> GroupEmoteFollowers; // 0x1c98 (0x10)
	unsigned char unreflected_1ca8[0x5c]; // 0x1ca8 (0x5c) 
	float GroupEmoteAnimOffset; // 0x1d04 (0x4)
	float GroupEmoteLeaderRotationYawOffset; // 0x1d08 (0x4)
	unsigned char unreflected_1d0c[0x4]; // 0x1d0c (0x4) 
	struct FRotator GroupEmoteLookTargetRotationLeader; // 0x1d10 (0x18)
	unsigned char unreflected_1d28[0x18]; // 0x1d28 (0x18) 
	float GroupEmoteMaximumZDifference; // 0x1d40 (0x4)
	unsigned char unreflected_1d44[0x4]; // 0x1d44 (0x4) 
	struct FMulticastInlineDelegate OnGroupEmoteSyncValueChanged; // 0x1d48 (0x10)
	struct FMulticastInlineDelegate OnGroupEmoteFollowerJoined; // 0x1d58 (0x10)
	struct FMulticastInlineDelegate OnGroupEmoteFollowerLeft; // 0x1d68 (0x10)
	struct FMulticastInlineDelegate OnGroupEmoteSecondaryFirePressed; // 0x1d78 (0x10)
	unsigned char GroupEmoteSyncValue; // 0x1d88 (0x1)
	unsigned char GroupEmoteSoundValue; // 0x1d89 (0x1)
	unsigned char GroupEmoteParticleValue; // 0x1d8a (0x1)
	unsigned char unreflected_1d8b[0x5]; // 0x1d8b (0x5) 
	class UAnimMontage* TransformationMontage; // 0x1d90 (0x8)
	float TransformationMontageStartTime; // 0x1d98 (0x4)
	unsigned char unreflected_1d9c[0x5c]; // 0x1d9c (0x5c) 
	class UAnimMontage* CurrentMontagerLeader; // 0x1df8 (0x8)
	class UAnimMontage* CurrentSyncedMontage; // 0x1e00 (0x8)
	unsigned char bCharacterPartsCastIndirectShadows; // 0x1e08 (0x1)
	unsigned char unreflected_1e09[0x1]; // 0x1e09 (0x1) 
	struct TEnumAsByte<EFortCustomGender> CharacterGender; // 0x1e0a (0x1)
	struct TEnumAsByte<EFortCustomBodyType> CharacterBodyType; // 0x1e0b (0x1)
	unsigned char unreflected_1e0c[0x10]; // 0x1e0c (0x10) 
	float JumpLastActivatedTime; // 0x1e1c (0x4)
	struct FVector PreviousPosition; // 0x1e20 (0x18)
	struct FVector PreviousVelocity; // 0x1e38 (0x18)
	unsigned char unreflected_1e50[0x48]; // 0x1e50 (0x48) 
	uint16_t ReplicatedCustomMeshHeightAdjustTarget; // 0x1e98 (0x2)
	unsigned char unreflected_1e9a[0x2]; // 0x1e9a (0x2) 
	float UnburrowLaunchXYSpeed; // 0x1e9c (0x4)
	float UnburrowLaunchZSpeed; // 0x1ea0 (0x4)
	unsigned char unreflected_1ea4[0x8c]; // 0x1ea4 (0x8c) 
	unsigned char bIsInAnyStorm; // 0x1f30 (0x1)
	unsigned char bIsInsideSafeZone; // 0x1f30 (0x1)
	unsigned char unreflected_1f31[0xf]; // 0x1f31 (0xf) 
	class UClass* SafeZoneAppliedGE; // 0x1f40 (0x8)
	unsigned char unreflected_1f48[0x28]; // 0x1f48 (0x28) 
	class UClass* DisableSlideGameplayEffectClass; // 0x1f70 (0x8)
	class UClass* SelfReviveGameplayEffect; // 0x1f78 (0x8)
	class UClass* TeammateReviveGameplayEffect; // 0x1f80 (0x8)
	struct FScalableFloat SetByCallerReviveHealth; // 0x1f88 (0x28)
	struct FName DBNOInteractionCollisionProfile; // 0x1fb0 (0x4)
	unsigned char unreflected_1fb4[0x4]; // 0x1fb4 (0x4) 
	struct FVector DBNOInteractionBoxExtent; // 0x1fb8 (0x18)
	float DBNODeferTime; // 0x1fd0 (0x4)
	unsigned char unreflected_1fd4[0x4]; // 0x1fd4 (0x4) 
	class UBoxComponent* DBNOInteractCollisionComponent; // 0x1fd8 (0x8)
	struct FGameplayTag EventReviveTag; // 0x1fe0 (0x4)
	float AggroRangeOverride; // 0x1fe4 (0x4)
	float SetByCallerReviveSignalInStorm; // 0x1fe8 (0x4)
	unsigned char unreflected_1fec[0x54]; // 0x1fec (0x54) 
	struct TArray<struct FGameplayAbilitySpecHandle> StasisAbilityHandles; // 0x2040 (0x10)
	struct TScriptInterface<class IFortArmoredInterface> ArmoredInterface; // 0x2050 (0x10)
	class UBuildingEditModeMetadata* LastBuildingMetadata; // 0x2060 (0x8)
	unsigned char unreflected_2068[0x18]; // 0x2068 (0x18) 
	float SprintCancelTime; // 0x2080 (0x4)
	unsigned char unreflected_2084[0x4]; // 0x2084 (0x4) 
	float WaterSprintBoostAllowedTimer; // 0x2088 (0x4)
	unsigned char unreflected_208c[0x88]; // 0x208c (0x88) 
	bool bHasStartedFloating; // 0x2114 (0x1)
	unsigned char unreflected_2115[0x3]; // 0x2115 (0x3) 
	struct FZiplinePawnState ZiplineState; // 0x2118 (0x48)
	struct FCurveTableRowHandle ZiplineJumpDampening; // 0x2160 (0x10)
	struct FCurveTableRowHandle ZiplineJumpStrength; // 0x2170 (0x10)
	struct FScalableFloat ZiplineJumpActivateDelay; // 0x2180 (0x28)
	struct FScalableFloat ZiplineRentryProtectionDelay; // 0x21a8 (0x28)
	float ZiplineSocketZOffset; // 0x21d0 (0x4)
	unsigned char unreflected_21d4[0x4]; // 0x21d4 (0x4) 
	struct FMulticastInlineDelegate ZiplineStateChanged; // 0x21d8 (0x10)
	float ZiplineSpeedFactorTarget; // 0x21e8 (0x4)
	float ZiplineSpeedFactor; // 0x21ec (0x4)
	unsigned char unreflected_21f0[0x8]; // 0x21f0 (0x8) 
	struct FScalableFloat EnableSwimSprintDiveCooldown; // 0x21f8 (0x28)
	struct FScalableFloat SwimSprintDiveCooldown; // 0x2220 (0x28)
	struct FScalableFloat SwimDiveBoostTimeThreshold; // 0x2248 (0x28)
	float ClientSwimDiveInputTime; // 0x2270 (0x4)
	bool bCanPredictJumpApex; // 0x2274 (0x1)
	unsigned char unreflected_2275[0x33]; // 0x2275 (0x33) 
	class UAnimMontage* UnableToPerformActionMontage; // 0x22a8 (0x8)
	class USoundBase* UnableToPerformActionSound; // 0x22b0 (0x8)
	float MoveSoundStimulusBroadcastInterval; // 0x22b8 (0x4)
	unsigned char unreflected_22bc[0xe0]; // 0x22bc (0xe0) 
	float EmoteStartTime; // 0x239c (0x4)
	float EmoteRandomNum; // 0x23a0 (0x4)
	unsigned char unreflected_23a4[0x14]; // 0x23a4 (0x14) 
	bool bPlayingPassengerToDriverAnimation; // 0x23b8 (0x1)
	unsigned char unreflected_23b9[0x17]; // 0x23b9 (0x17) 
	float VehicleSpeedAtTimeOfJump; // 0x23d0 (0x4)
	unsigned char unreflected_23d4[0x4]; // 0x23d4 (0x4) 
	class AActor* CurrentVehicle; // 0x23d8 (0x8)
	class AFortPlayerControllerGameplay* InteractingPCRep; // 0x23e0 (0x8)
	class AActor* VehicleLastTick; // 0x23e8 (0x8)
	unsigned char unreflected_23f0[0x18]; // 0x23f0 (0x18) 
	struct FMulticastInlineDelegate OnVehicleStateChangedEvent; // 0x2408 (0x10)
	struct FMulticastInlineDelegate OnUIGameplayCue; // 0x2418 (0x10)
	struct FMulticastInlineDelegate OnPetAddedOrRemoved; // 0x2428 (0x10)
	class UFortPawnComponent_Tether* TetherComponent; // 0x2438 (0x8)
	float PendingTetherLaunch; // 0x2440 (0x4)
	unsigned char unreflected_2444[0x4c]; // 0x2444 (0x4c) 
	float TetherJumpLastTime; // 0x2490 (0x4)
	bool bSupportsTetheredMovement; // 0x2494 (0x1)
	unsigned char unreflected_2495[0x3]; // 0x2495 (0x3) 
	class ABuildingGameplayActor* BalloonRope; // 0x2498 (0x8)
	struct FMulticastInlineDelegate OnPossessedProp; // 0x24a0 (0x10)
	class ABuildingGameplayActorPlayerPropAttachment* PossessedProp; // 0x24b0 (0x8)
	unsigned char unreflected_24b8[0x30]; // 0x24b8 (0x30) 
	int64_t SlopeCameraOffsetFrameCounter; // 0x24e8 (0x8)
	struct FVectorRK4SpringInterpolator* SlopeCameraOffsetInterpolator; // 0x24f0 (0x8)
	unsigned char unreflected_24f8[0x58]; // 0x24f8 (0x58) 
	struct FVector LargeBodyTypeTargetingOffset; // 0x2550 (0x18)
	unsigned char unreflected_2568[0xe8]; // 0x2568 (0xe8) 
	class UInputComponent* VehicleInputComponent; // 0x2650 (0x8)
	unsigned char unreflected_2658[0x8]; // 0x2658 (0x8) 
	class UAnimMontage* BluePrintPlaceAnimation; // 0x2660 (0x8)
	class UAnimMontage* BluePrintEditAnimation; // 0x2668 (0x8)
	unsigned char unreflected_2670[0x8]; // 0x2670 (0x8) 
	struct FMulticastInlineDelegate OnStartedInteractSearch; // 0x2678 (0x10)
	struct FMulticastInlineDelegate OnEndedInteractSearch; // 0x2688 (0x10)
	struct FMulticastInlineDelegate OnAttemptedInstantInteractSearch; // 0x2698 (0x10)
	struct FName EmoteInteractionCollisionProfile; // 0x26a8 (0x4)
	unsigned char unreflected_26ac[0x4]; // 0x26ac (0x4) 
	struct FVector EmoteInteractionBoxExtent; // 0x26b0 (0x18)
	class UBoxComponent* EmoteInteractCollisionComponent; // 0x26c8 (0x8)
	struct FMulticastInlineDelegate OnPartChanged; // 0x26d0 (0x10)
	unsigned char unreflected_26e0[0x30]; // 0x26e0 (0x30) 
	class UMaterialInstanceDynamic* BlueprintPaperMID; // 0x2710 (0x8)
	struct FTimeline BlueprintPaperPulseTimeline; // 0x2718 (0x90)
	class UCustomColorComponent* AccessoryColorSwatchHandler[0x7]; // 0x27a8 (0x8) (ARRAY) 
	class UFortHero* Hero; // 0x27e0 (0x8)
	struct TWeakObjectPtr<class UFortHeroType> OvrHeroType; // 0x27e8 (0x8)
	enum EFortPawnDisplayContext DisplayContext; // 0x27f0 (0x1)
	unsigned char unreflected_27f1[0x1f]; // 0x27f1 (0x1f) 
	class UCustomPlayerComponent* HACKCustomPRIComponent; // 0x2810 (0x8)
	class UCustomCharacterPart* CharacterParts[0x7]; // 0x2818 (0x8) (ARRAY) 
	class UCustomColorSwatch* CharacterColorSwatches[0x2]; // 0x2850 (0x8) (ARRAY) 
	class UCustomColorSwatch* CharacterPartColorSwatches[0x7]; // 0x2860 (0x8) (ARRAY) 
	class UAthenaCharmItemDefinition* CharacterCharms[0x4]; // 0x2898 (0x8) (ARRAY) 
	struct TArray<class UCustomCharacterPart*> RequiredVariantParts; // 0x28b8 (0x10)
	unsigned char unreflected_28c8[0x8]; // 0x28c8 (0x8) 
	class USkeletalMeshComponentBudgeted* CharacterPartSkeletalMeshComponents[0x7]; // 0x28d0 (0x8) (ARRAY) 
	struct TArray<class AFortPlayerCharm*> CharacterCharmActors; // 0x2908 (0x10)
	int8_t CharacterPartSMHiddenRefCount[0x7]; // 0x2918 (0x1) (ARRAY) 
	unsigned char unreflected_291f[0x9]; // 0x291f (0x9) 
	struct FFortAthenaLoadout BaseCosmeticLoadout; // 0x2928 (0x178)
	struct FFortAthenaLoadout AppliedCosmeticLoadout; // 0x2aa0 (0x178)
	struct TArray<struct FFortAppliedSwapItemAndVariantData> AppliedSwaps; // 0x2c18 (0x10)
	unsigned char unreflected_2c28[0x50]; // 0x2c28 (0x50) 
	struct FFortAthenaLoadout CosmeticLoadout; // 0x2c78 (0x178)
	uint32_t ServerLoadoutChangeSync; // 0x2df0 (0x4)
	unsigned char unreflected_2df4[0x4]; // 0x2df4 (0x4) 
	bool bAllowClientLoadoutChangeSync; // 0x2df8 (0x1)
	unsigned char unreflected_2df9[0x27]; // 0x2df9 (0x27) 
	struct FMulticastInlineDelegate OnMaterialOverrideApplied; // 0x2e20 (0x10)
	struct FMulticastInlineDelegate OnMaterialOverrideCleared; // 0x2e30 (0x10)
	unsigned char unreflected_2e40[0x8]; // 0x2e40 (0x8) 
	struct TArray<struct FFortPawnMaterialOverride> MaterialOverrides; // 0x2e48 (0x10)
	struct TArray<struct FFortPawnMaterialOverride> LocalMaterialOverrides; // 0x2e58 (0x10)
	unsigned char unreflected_2e68[0x10]; // 0x2e68 (0x10) 
	struct TMap<class USceneComponent*, struct FFortPawnMaterialOverrideState> MaterialOverrideStateMap; // 0x2e78 (0x50)
	class UCustomCharacterPart* PreviousCharacterParts[0x7]; // 0x2ec8 (0x8) (ARRAY) 
	class ACustomCharacterPartModifier* CharacterPartModifiers[0x7]; // 0x2f00 (0x8) (ARRAY) 
	struct FFortCharacterPartsRepMontageInfo RepCharPartAnimMontageInfo; // 0x2f38 (0x20)
	struct FFortClientObservedStatArray ClientObservedStats; // 0x2f58 (0x138)
	class UFortPawnSkeletalMeshContext* SkeletalMeshContext; // 0x3090 (0x8)
	unsigned char unreflected_3098[0x18]; // 0x3098 (0x18) 
	class UClass* AnimBPOverride; // 0x30b0 (0x8)
	class UClass* OriginalAnimBP; // 0x30b8 (0x8)
	class USoundBase* OnCrouchStartSound; // 0x30c0 (0x8)
	class USoundBase* OnCrouchEndSound; // 0x30c8 (0x8)
	class UFortFootstepAudioBank* FootstepBankOverride; // 0x30d0 (0x8)
	class UFortFootstepAudioBank* OriginalFootstepBank; // 0x30d8 (0x8)
	int CachedFootStepIndex; // 0x30e0 (0x4)
	unsigned char unreflected_30e4[0x4]; // 0x30e4 (0x4) 
	class UFortWeaponAnimSet* WeaponAnimSetOverride; // 0x30e8 (0x8)
	class UFortLocomotionAnimSet* LocomotionAnimSetOverride; // 0x30f0 (0x8)
	struct TArray<class UClass*> AnimLayersOverride; // 0x30f8 (0x10)
	struct TArray<class UClass*> PreviousAnimLayersOverride; // 0x3108 (0x10)
	struct TArray<class AFortPickup*> QueuedAutoPickups; // 0x3118 (0x10)
	struct TArray<struct FIgnoreCollisionActor> IgnoreActors; // 0x3128 (0x10)
	unsigned char unreflected_3138[0x8]; // 0x3138 (0x8) 
	struct FScalableFloat AutoPickupDropRepickupDelay; // 0x3140 (0x28)
	unsigned char unreflected_3168[0x10]; // 0x3168 (0x10) 
	struct FName CarriedObjectAttachmentSocket; // 0x3178 (0x4)
	float PickupSpeedMultiplier; // 0x317c (0x4)
	struct FSlateBrush MiniMapIconBrush; // 0x3180 (0xc0)
	struct FSlateBrush AboveBelowMiniMapIconBrush; // 0x3240 (0xc0)
	struct FSlateBrush FarOffMiniMapIconBrush; // 0x3300 (0xc0)
	struct FSlateBrush DBNOMiniMapIconBrush; // 0x33c0 (0xc0)
	struct FLinearColor MinimapIconColorSelf; // 0x3480 (0x10)
	struct FLinearColor MinimapIconColorTeammate; // 0x3490 (0x10)
	struct FLinearColor MinimapIconColorEnemy; // 0x34a0 (0x10)
	float MaxIndicatorVisibilityDistForEnemies; // 0x34b0 (0x4)
	float MaxIndicatorVisibilityDistForAllies; // 0x34b4 (0x4)
	unsigned char unreflected_34b8[0x80]; // 0x34b8 (0x80) 
	struct FFortDBNOCarryHoisterData DBNOHoisterData; // 0x3538 (0x10)
	class AFortPlayerPawn* DBNOHoistee; // 0x3548 (0x8)
	class UFortWeaponAnimSet* DBNOHoisterAnimSet; // 0x3550 (0x8)
	float ThrowCarriedPlayerStrengthXY; // 0x3558 (0x4)
	float ThrowCarriedPlayerStrengthZ; // 0x355c (0x4)
	float DropCarriedPlayerForwardOffset; // 0x3560 (0x4)
	float DropCarriedPlayerHeightOffset; // 0x3564 (0x4)
	float DropCarriedPlayerTraceHeight; // 0x3568 (0x4)
	bool bAllowDBNOCarry; // 0x356c (0x1)
	bool bAllowDBNOCarryEnemies; // 0x356d (0x1)
	bool bIsBeingDBNOCarried; // 0x356e (0x1)
	bool bIsDBNOCarrying; // 0x356f (0x1)
	bool bRequestedThrowCarriedPlayer; // 0x3570 (0x1)
	unsigned char unreflected_3571[0xf]; // 0x3571 (0xf) 
	struct FMulticastInlineDelegate OnDBNOHoisterChangedDelegate; // 0x3580 (0x10)
	struct FMulticastInlineDelegate OnRevivedFromDBNODelegate; // 0x3590 (0x10)
	struct FMulticastInlineDelegate OnNewPlayerState; // 0x35a0 (0x10)
	struct FMulticastInlineDelegate OnAbilitySystemComponentInitialized; // 0x35b0 (0x10)
	struct FMulticastInlineDelegate OnPreInvalidateAbilitySystemComponent; // 0x35c0 (0x10)
	unsigned char unreflected_35d0[0x48]; // 0x35d0 (0x48) 
	struct FMulticastInlineDelegate OnFinishedCharacterCustomization; // 0x3618 (0x10)
	struct FMulticastInlineDelegate OnCrouchInputJustPressed; // 0x3628 (0x10)
	class UFortCustomizationAssetLoader* CustomizationAssetLoader; // 0x3638 (0x8)
	unsigned char unreflected_3640[0x110]; // 0x3640 (0x110) 
	bool bEnableUpdateCharacterCustomizationPostLoad; // 0x3750 (0x1)
	bool bHasCharacterCustomizationPostLoadedOnce; // 0x3751 (0x1)
	bool bHiddenAtStartup; // 0x3752 (0x1)
	unsigned char unreflected_3753[0xd]; // 0x3753 (0xd) 
	class UParticleSystem* SpawnParticles; // 0x3760 (0x8)
	class USoundBase* SpawnSound; // 0x3768 (0x8)
	unsigned char unreflected_3770[0x4]; // 0x3770 (0x4) 
	unsigned char bIsLocalPlayer; // 0x3774 (0x1)
	unsigned char bDamagedEnemy; // 0x3774 (0x1)
	unsigned char unreflected_3775[0x1b]; // 0x3775 (0x1b) 
	struct FMulticastInlineDelegate OnDamageComboIncrement; // 0x3790 (0x10)
	struct FMulticastInlineDelegate OnDamageComboReset; // 0x37a0 (0x10)
	unsigned char unreflected_37b0[0x8]; // 0x37b0 (0x8) 
	uint32_t PlayerStatus; // 0x37b8 (0x4)
	uint16_t AccelerationPack; // 0x37bc (0x2)
	unsigned char unreflected_37be[0x2]; // 0x37be (0x2) 
	struct FGameplayAbilityRepAnimMontage RepAnimMontageInfo; // 0x37c0 (0x38)
	int RepAnimMontageStartSection; // 0x37f8 (0x4)
	unsigned char bNetMovementPrioritized; // 0x37fc (0x1)
	unsigned char unreflected_37fd[0x3]; // 0x37fd (0x3) 
	struct FReplicatedMontagePair LandingMontagePair; // 0x3800 (0x20)
	struct FPreviouslyAppliedVariantData PriorVariantData; // 0x3820 (0x88)
	struct TArray<class UFortWorldItemDefinition*> TempWeaponsStack; // 0x38a8 (0x10)
	struct TArray<class UFortAnimNotifyState_RootMotionInterrupt*> RootMotionInterruptNotifyStack; // 0x38b8 (0x10)
	struct TArray<class UAnimMontage*> RootMotionInterruptMontageStack; // 0x38c8 (0x10)
	unsigned char unreflected_38d8[0x38]; // 0x38d8 (0x38) 
	class UFortVisibilityComponent* VisibilityComponent; // 0x3910 (0x8)
	class UPostProcessComponent* BlendablesPostProcessComp; // 0x3918 (0x8)
	unsigned char unreflected_3920[0x4]; // 0x3920 (0x4) 
	unsigned char bUseControllerRotationYawToRestore; // 0x3924 (0x1)
	unsigned char unreflected_3925[0x3]; // 0x3925 (0x3) 
	struct FMulticastInlineDelegate OnBeginSkydivingEvent; // 0x3928 (0x10)
	struct FMulticastInlineDelegate OnEndSkydivingEvent; // 0x3938 (0x10)
	struct FMulticastInlineDelegate OnBeginParachuteMovementEvent; // 0x3948 (0x10)
	struct FMulticastInlineDelegate OnParachuteSpawned; // 0x3958 (0x10)
	struct FMulticastInlineDelegate OnEndParachuteMovementEvent; // 0x3968 (0x10)
	struct FMulticastInlineDelegate OnBallooningGravityCeilingChanged; // 0x3978 (0x10)
	struct FMulticastInlineDelegate OnEnteredAircraft; // 0x3988 (0x10)
	struct FMulticastInlineDelegate OnStopSliding; // 0x3998 (0x10)
	struct FMulticastInlineDelegate OnPawnPossessed; // 0x39a8 (0x10)
	struct FMulticastInlineDelegate OnPawnUnpossessed; // 0x39b8 (0x10)
	struct FMulticastInlineDelegate OnEmoteInteracted; // 0x39c8 (0x10)
	struct FMulticastInlineDelegate OnSafeZoneOccupancyChangedEvent; // 0x39d8 (0x10)
	struct FMulticastInlineDelegate OnHeldObjectPickedUp; // 0x39e8 (0x10)
	struct FMulticastInlineDelegate OnHeldObjectDropped; // 0x39f8 (0x10)
	struct TMap<struct TEnumAsByte<EFortCustomMovement>, class UTexture*> CustomMovementIndicators; // 0x3a08 (0x50)
	unsigned char unreflected_3a58[0x10]; // 0x3a58 (0x10) 
	class USoundBase* CurrentGliderOpenSound; // 0x3a68 (0x8)
	struct TWeakObjectPtr<class UAudioComponent> CurrentGliderOpenAudioComponent; // 0x3a70 (0x8)
	class USoundBase* CurrentGliderCloseSound; // 0x3a78 (0x8)
	struct TWeakObjectPtr<class UAudioComponent> CurrentGliderCloseAudioComponent; // 0x3a80 (0x8)
	unsigned char unreflected_3a88[0xc]; // 0x3a88 (0xc) 
	bool bParachuteLockedOpen; // 0x3a94 (0x1)
	bool bLocalParachuteLockedOpen; // 0x3a95 (0x1)
	unsigned char unreflected_3a96[0x2]; // 0x3a96 (0x2) 
	struct FRepFortMeshAttachment AttachmentMesh; // 0x3a98 (0x10)
	class USkeletalMeshComponentBudgeted* AttachmentMeshComponent; // 0x3aa8 (0x8)
	class UFortPawnScriptedBehavior* BotScriptedBehavior; // 0x3ab0 (0x8)
	unsigned char unreflected_3ab8[0x18]; // 0x3ab8 (0x18) 
	struct TArray<class AFortWaterBodyActor*> IgnoredWaterBodies; // 0x3ad0 (0x10)
	class UFortUnderwaterDamageComponent* UnderwaterDamageComponent; // 0x3ae0 (0x8)
	struct FSlipperySlopeParams SlipperySlopeParams; // 0x3ae8 (0x230)
	class UAthenaGliderItemDefinition* GliderClass; // 0x3d18 (0x8)
	unsigned char unreflected_3d20[0x10]; // 0x3d20 (0x10) 
	class AFortPlayerPetRepState* PetState; // 0x3d30 (0x8)
	class AFortPlayerPet* CosmeticPetInstance; // 0x3d38 (0x8)
	unsigned char unreflected_3d40[0x10]; // 0x3d40 (0x10) 
	class UFortGliderSpawnComponent* GliderSpawnComponent; // 0x3d50 (0x8)
	class AFortPlayerParachute* ParachuteAttachment; // 0x3d58 (0x8)
	unsigned char unreflected_3d60[0x8]; // 0x3d60 (0x8) 
	struct TArray<class UAthenaGliderItemDefinition*> GliderOverrideStack; // 0x3d68 (0x10)
	unsigned char unreflected_3d78[0x10]; // 0x3d78 (0x10) 
	bool bResetGliderOverrideOnLanding; // 0x3d88 (0x1)
	unsigned char unreflected_3d89[0x7]; // 0x3d89 (0x7) 
	struct FScalableFloat ParachuteDeployTraceForGroundDistance; // 0x3d90 (0x28)
	struct FScalableFloat LaunchPadParachuteDeployTraceForGroundDistance; // 0x3db8 (0x28)
	struct FScalableFloat LaunchPadParachuteDeployTraceForDownwardSpeed; // 0x3de0 (0x28)
	struct FScalableFloat ParachuteDeployVelocityBlend; // 0x3e08 (0x28)
	float ParachuteCooldownToOpen; // 0x3e30 (0x4)
	float ParachuteCooldownToClose; // 0x3e34 (0x4)
	struct FScalableFloat GliderRedeployAllowedRow; // 0x3e38 (0x28)
	struct FScalableFloat GliderRedeployLateralVelocityMultiplierRow; // 0x3e60 (0x28)
	struct FScalableFloat GliderRedeployHeighLimitRow; // 0x3e88 (0x28)
	struct FScalableFloat BalloonFallDamageThresholdVelocityZ; // 0x3eb0 (0x28)
	class UClass* PreDrivingAnimBP; // 0x3ed8 (0x8)
	class UClass* CurrentVehicleAnimLayerOverlayClass; // 0x3ee0 (0x8)
	class UClass* CurrentSwimmingAnimLayerOverlayClass; // 0x3ee8 (0x8)
	class UClass* DefaultSwimmingAnimLayerOverlayClass; // 0x3ef0 (0x8)
	unsigned char unreflected_3ef8[0x8]; // 0x3ef8 (0x8) 
	float TimeBeforeSwimmingLayerDeactivated; // 0x3f00 (0x4)
	unsigned char unreflected_3f04[0x4]; // 0x3f04 (0x4) 
	class UFortLinkedAnimGraphComponent* LinkedAnimGraphComponent; // 0x3f08 (0x8)
	class UFortPlayerAnimationComponent* AnimationComponent; // 0x3f10 (0x8)
	class UAudioComponent* ParachuteAudioLoop; // 0x3f18 (0x8)
	float ParachuteAndSkydiveAudioFadeInTime; // 0x3f20 (0x4)
	float ParachuteAndSkydiveAudioFadeOutTime; // 0x3f24 (0x4)
	class UAudioComponent* SkydiveAudioLoop; // 0x3f28 (0x8)
	class USoundBase* SoundOnParachuteForcedOpen; // 0x3f30 (0x8)
	class USoundBase* SkydivingLoop1P; // 0x3f38 (0x8)
	class USoundBase* SkydivingLoop1PMetaSound; // 0x3f40 (0x8)
	class USoundBase* SkydivingLoop3P; // 0x3f48 (0x8)
	class USoundBase* ParachuteOpenLoop1P; // 0x3f50 (0x8)
	class USoundBase* ParachuteOpenLoop1PMetaSound; // 0x3f58 (0x8)
	class USoundBase* ParachuteOpenLoop3P; // 0x3f60 (0x8)
	class UAudioComponent* SwimmingAudioLoop; // 0x3f68 (0x8)
	float SwimmingAudioFadeOutTime; // 0x3f70 (0x4)
	float SwimmingAudioInterpSpeed; // 0x3f74 (0x4)
	class USoundBase* SoundOnSwimmingLoop; // 0x3f78 (0x8)
	unsigned char unreflected_3f80[0x50]; // 0x3f80 (0x50) 
	uint32_t RemoteViewData32; // 0x3fd0 (0x4)
	unsigned char unreflected_3fd4[0x14]; // 0x3fd4 (0x14) 
	float LastQuickBarSwitchRequestTime; // 0x3fe8 (0x4)
	float CrouchStartTime; // 0x3fec (0x4)
	float CrouchEndTime; // 0x3ff0 (0x4)
	float CrouchLerpTime; // 0x3ff4 (0x4)
	float MeleeAbilityCooldown; // 0x3ff8 (0x4)
	bool bDisallowInterrogation; // 0x3ffc (0x1)
	bool bDisallowInterrogationOnNPC; // 0x3ffd (0x1)
	bool bDisallowInterrogationCreative; // 0x3ffe (0x1)
	unsigned char bHideBodyOnDeathRequested; // 0x3fff (0x1)
	struct TWeakObjectPtr<class AFortRemoteControlledPawnAthena> ControlledRCPawn; // 0x4000 (0x8)
	struct FRotator StoredControlRotation; // 0x4008 (0x18)
	unsigned char unreflected_4020[0x4]; // 0x4020 (0x4) 
	enum EFortFacialAnimTypes FacialTypeOverride; // 0x4024 (0x1)
	unsigned char unreflected_4025[0x3]; // 0x4025 (0x3) 
	float GhostModeExitStartTime; // 0x4028 (0x4)
	float GhostModeExitDuration; // 0x402c (0x4)
	unsigned char unreflected_4030[0x138]; // 0x4030 (0x138) 
	struct TMap<struct FName, struct FFortPlayerPawnObjectReference> CachedReferencesByName; // 0x4168 (0x50)
	bool bFXPlayDustOnMovement; // 0x41b8 (0x1)
	unsigned char unreflected_41b9[0x7]; // 0x41b9 (0x7) 
	class UParticleSystemComponent* PSCPlayerInWater; // 0x41c0 (0x8)
	class UParticleSystemComponent* PSCPlayerInWaterSurfaceSwimming; // 0x41c8 (0x8)
	class UNiagaraSystem* NiagaraPlayerInWaterBasicAsset; // 0x41d0 (0x8)
	class UNiagaraSystem* NiagaraPlayerInWaterSwimmingAsset; // 0x41d8 (0x8)
	class UNiagaraSystem* NiagaraPlayerWaterHandSplashAsset; // 0x41e0 (0x8)
	class UNiagaraSystem* NiagaraPlayerWaterFootSplashAsset; // 0x41e8 (0x8)
	class UNiagaraSystem* NiagaraPlayerWaterLargePlayerSplashAsset; // 0x41f0 (0x8)
	class UNiagaraSystem* NiagaraPlayerWaterBoostAsset; // 0x41f8 (0x8)
	struct FName FootSplashLeftSocketName; // 0x4200 (0x4)
	struct FName FootSplashRightSocketName; // 0x4204 (0x4)
	class UFXSystemComponent* NiagaraPlayerStandingInWater; // 0x4208 (0x8)
	class UFXSystemComponent* NiagaraPlayerSwimmingInWater; // 0x4210 (0x8)
	class UFXSystemComponent* NiagaraPlayerHandSplashInWater; // 0x4218 (0x8)
	class UFXSystemComponent* NiagaraPlayerFootSplashInWaterLeft; // 0x4220 (0x8)
	class UFXSystemComponent* NiagaraPlayerFootSplashInWaterRight; // 0x4228 (0x8)
	class UFXSystemComponent* NiagaraPlayerJumpSplashInWater; // 0x4230 (0x8)
	class UFXSystemComponent* NiagaraPlayerWaterBoost; // 0x4238 (0x8)
	unsigned char bWaterFootSplashActive; // 0x4240 (0x1)
	unsigned char bEnableWaterInteractionEffects; // 0x4240 (0x1)
	unsigned char unreflected_4241[0x7]; // 0x4241 (0x7) 
	class UAudioComponent* SlidingAudioComp; // 0x4248 (0x8)
	class USoundBase* SlidingIntensitySound3P; // 0x4250 (0x8)
	class USoundBase* SlidingIntensitySound1P; // 0x4258 (0x8)
	float SlideAudioIntensity; // 0x4260 (0x4)
	unsigned char unreflected_4264[0x4]; // 0x4264 (0x4) 
	class UParticleSystemComponent* PSCPlayerSlideLand; // 0x4268 (0x8)
	struct FMulticastInlineDelegate OnActivateAbility; // 0x4270 (0x10)
	struct FMulticastInlineDelegate OnFiringRangedWeapon; // 0x4280 (0x10)
	struct FScalableFloat ConsecutiveWeakSpotResourceBonus; // 0x4290 (0x28)
	struct FScalableFloat LastHitWeakSpotResourceBonus; // 0x42b8 (0x28)
	unsigned char unreflected_42e0[0x8]; // 0x42e0 (0x8) 
	class UWidget* CustomInteractionWidget; // 0x42e8 (0x8)
	unsigned char unreflected_42f0[0x18]; // 0x42f0 (0x18) 
	class UFortPawnComponent_Convert* ConvertComponent; // 0x4308 (0x8)
	class UFortActorComponent_Affiliation* AffiliationComponent; // 0x4310 (0x8)
	unsigned char unreflected_4318[0x1]; // 0x4318 (0x1) 
	unsigned char bUseViewRotationForCameraOrigin; // 0x4319 (0x1)
	unsigned char bCanUseDefaultPartsOnLateLoad; // 0x4319 (0x1)
	unsigned char padding_431a[0x16]; // 0x431a (0x16)

	/* Functions */

	// Function /Script/FortniteGame.FortPlayerPawn.WhenCosmeticSpecificPartAppliedWithAnyStruct (Underlying native function: WhenCosmeticSpecificPartAppliedWithAnyStruct 0x5a61c70)
	void WhenCosmeticSpecificPartAppliedWithAnyStruct(struct FDelegate& Delegate, bool& SkipNullMesh, struct TEnumAsByte<EFortCustomPartType>& PartType, struct FDelegateHandleController& DelegateHandleControllerOut, struct FInstancedStruct& AnyStruct); // (Final | Native | Public | HasOutParms | BlueprintCallable)

	// Function /Script/FortniteGame.FortPlayerPawn.WhenCosmeticSpecificPartApplied (Underlying native function: WhenCosmeticSpecificPartApplied 0x1fe6ba0)
	void WhenCosmeticSpecificPartApplied(struct FDelegate& Delegate, bool& SkipNullMesh, struct TEnumAsByte<EFortCustomPartType>& PartType, struct FDelegateHandleController& DelegateHandleControllerOut); // (Final | Native | Public | HasOutParms | BlueprintCallable)

