// Class /Script/FortniteGame.FortPlayerController
// Size: 0x2c50
class AFortPlayerController : public AFGF_PlayerController
{
	unsigned char unreflected_8a0[0x30]; // 0x8a0 (0x30) 
	struct FMulticastInlineDelegate OnPlayerPawnPossessed; // 0x8d0 (0x10)
	struct FMulticastInlineDelegate OnEnteredEditMode; // 0x8e0 (0x10)
	struct FMulticastInlineDelegate OnPickupCreated; // 0x8f0 (0x10)
	struct FMulticastInlineDelegate OnLoadoutChanged; // 0x900 (0x10)
	unsigned char unreflected_910[0x30]; // 0x910 (0x30) 
	struct FMulticastInlineDelegate OnViewTargetChanged; // 0x940 (0x10)
	struct FMulticastInlineDelegate OnInputFiltered; // 0x950 (0x10)
	unsigned char unreflected_960[0x18]; // 0x960 (0x18) 
	struct FMulticastInlineDelegate OnFortPawnChangedEvent; // 0x978 (0x10)
	struct FMulticastInlineDelegate OnControllerComponentAttachedEvent; // 0x988 (0x10)
	unsigned char unreflected_998[0x99]; // 0x998 (0x99) 
	bool bInPossession; // 0xa31 (0x1)
	unsigned char unreflected_a32[0xa6]; // 0xa32 (0xa6) 
	class UInputComponent* AircraftInputComponent; // 0xad8 (0x8)
	class UFortMiniMapInputComponent* MiniMapInputComponent; // 0xae0 (0x8)
	class UActorComponent* SprintOverrideComponent; // 0xae8 (0x8)
	class UAudioComponent* SkydiveMusicAudioComp; // 0xaf0 (0x8)
	unsigned char bFailedToRespawn; // 0xaf8 (0x1)
	unsigned char bIsDisconnecting; // 0xaf8 (0x1)
	unsigned char bIsBeingKicked; // 0xaf8 (0x1)
	unsigned char bHasInitiallySpawned; // 0xaf8 (0x1)
	unsigned char bAssignedStartSpawn; // 0xaf8 (0x1)
	unsigned char bReadyToStartMatch; // 0xaf8 (0x1)
	unsigned char bClientPawnIsLoaded; // 0xaf8 (0x1)
	unsigned char bWantsWeaponAutoPickup; // 0xaf8 (0x1)
	unsigned char unreflected_af9[0x7]; // 0xaf9 (0x7) 
	struct FVector SpawnLoc; // 0xb00 (0x18)
	int NumPreviousSpawns; // 0xb18 (0x4)
	bool bCanSpectateBot; // 0xb1c (0x1)
	unsigned char unreflected_b1d[0x3]; // 0xb1d (0x3) 
	struct FMulticastInlineDelegate OnBlueprintReadyCheckCompleted; // 0xb20 (0x10)
	unsigned char unreflected_b30[0x10]; // 0xb30 (0x10) 
	struct FMulticastInlineDelegate OnDelayForPreServerTransitionAnimationEvent; // 0xb40 (0x10)
	unsigned char unreflected_b50[0x18]; // 0xb50 (0x18) 
	class USoundMix* SimpleLoadingScreenSoundMix; // 0xb68 (0x8)
	unsigned char unreflected_b70[0xc]; // 0xb70 (0xc) 
	struct FGameplayTag SprintOverrideAbilityGameplayTag; // 0xb7c (0x4)
	struct TArray<class AFortAIPawn*> ManagedAIs; // 0xb80 (0x10)
	class AFortPlayerPawn* MyFortPawn; // 0xb90 (0x8)
	class AFortPlayerPawn* MyFortPawnBeforeTakeoverOfScriptedPawn; // 0xb98 (0x8)
	class AController* ScriptedPawnControllerBeforeTakeover; // 0xba0 (0x8)
	bool bHasClientFinishedLoading; // 0xba8 (0x1)
	bool bHasServerFinishedLoading; // 0xba9 (0x1)
	unsigned char unreflected_baa[0x2]; // 0xbaa (0x2) 
	float TimeStartedWaiting; // 0xbac (0x4)
	float TimeFinishedNavigationBuild; // 0xbb0 (0x4)
	unsigned char unreflected_bb4[0x4]; // 0xbb4 (0x4) 
	class UMaterialParameterCollection* MaterialParameterCollection; // 0xbb8 (0x8)
	unsigned char unreflected_bc0[0x9]; // 0xbc0 (0x9) 
	bool bLoadingScreenDropped; // 0xbc9 (0x1)
	unsigned char unreflected_bca[0x6]; // 0xbca (0x6) 
	struct FVector PendingSpectatorLocation; // 0xbd0 (0x18)
	struct TWeakObjectPtr<class AActor> ActorUnderReticle; // 0xbe8 (0x8)
	struct TWeakObjectPtr<class AActor> AutoFireReticleTarget; // 0xbf0 (0x8)
	struct FTimerHandle* AutofireTimerHandle; // 0xbf8 (0x8)
	unsigned char unreflected_c00[0x8]; // 0xc00 (0x8) 
	struct TWeakObjectPtr<class ABuildingWeakSpot> WeakspotUnderReticle; // 0xc08 (0x8)
	struct TArray<struct FBuildingWeakSpotData> ActiveWeakSpots; // 0xc10 (0x10)
	float IdleKickLastTimeActive; // 0xc20 (0x4)
	float LastTimeActive; // 0xc24 (0x4)
	unsigned char unreflected_c28[0x20]; // 0xc28 (0x20) 
	bool bRevertPlayerListenerChange; // 0xc48 (0x1)
	unsigned char unreflected_c49[0x1f]; // 0xc49 (0x1f) 
	class UInputComponent* VehicleInputComponent; // 0xc68 (0x8)
	bool bHoldingPrimaryFireFromTouch; // 0xc70 (0x1)
	bool bSupportNextPieceAssist; // 0xc71 (0x1)
	bool bAutoBuildForTrapPlacement; // 0xc72 (0x1)
	bool bAutoBuildForFloorTrapPlacement; // 0xc73 (0x1)
	bool bAutoBuildForWallTrapPlacement; // 0xc74 (0x1)
	bool bAutoBuildForCeilingTrapPlacement; // 0xc75 (0x1)
	bool bNoControllerLighting; // 0xc76 (0x1)
	unsigned char unreflected_c77[0x1]; // 0xc77 (0x1) 
	float ReturnToMainMenuTimeoutDelay; // 0xc78 (0x4)
	unsigned char unreflected_c7c[0x4]; // 0xc7c (0x4) 
	struct FMulticastInlineDelegate OnQuestObjectiveStateChanged; // 0xc80 (0x10)
	unsigned char unreflected_c90[0x18]; // 0xc90 (0x18) 
	class AFortPlayerController* LastDamager; // 0xca8 (0x8)
	unsigned char unreflected_cb0[0x8]; // 0xcb0 (0x8) 
	class AFortPlayerController* LastFallInstigator; // 0xcb8 (0x8)
	unsigned char unreflected_cc0[0x4]; // 0xcc0 (0x4) 
	float LastDamagerCreditThresholdDropElim; // 0xcc4 (0x4)
	float LastDamagerCreditThresholdSelfElim; // 0xcc8 (0x4)
	float LastDamagerCreditThresholdStormElim; // 0xccc (0x4)
	bool bGiveLastDamagerElimCreditOnDrop; // 0xcd0 (0x1)
	bool bGiveLastDamagerElimCreditOnSelfDamage; // 0xcd1 (0x1)
	bool bGiveLastDamagerElimCreditOnStormDamage; // 0xcd2 (0x1)
	unsigned char unreflected_cd3[0x4d]; // 0xcd3 (0x4d) 
	struct FMulticastInlineDelegate OnMcpProfilesInitializedEvent; // 0xd20 (0x10)
	unsigned char unreflected_d30[0x190]; // 0xd30 (0x190) 
	struct FMulticastInlineDelegate OnEnterVehicleDriver; // 0xec0 (0x10)
	struct FMulticastInlineDelegate OnEnterVehiclePassenger; // 0xed0 (0x10)
	struct FMulticastInlineDelegate OnExitVehicle; // 0xee0 (0x10)
	struct FMulticastInlineDelegate OnFullyExitVehicle; // 0xef0 (0x10)
	struct FMulticastInlineDelegate OnVehicleSeatChanged; // 0xf00 (0x10)
	struct FMulticastInlineDelegate OnVehicleAbilitiesRemoved; // 0xf10 (0x10)
	struct FMulticastInlineDelegate OnTetherChanged; // 0xf20 (0x10)
	struct FMulticastInlineDelegate OnClientRefreshHUDForRespawn; // 0xf30 (0x10)
	unsigned char unreflected_f40[0x28]; // 0xf40 (0x28) 
	unsigned char bHoldingObject; // 0xf68 (0x1)
	unsigned char unreflected_f69[0x7]; // 0xf69 (0x7) 
	class UInputComponent* DBNOCarryInputComponent; // 0xf70 (0x8)
	class UInputComponent* HeldObjectsInputComponent; // 0xf78 (0x8)
	unsigned char unreflected_f80[0x48]; // 0xf80 (0x48) 
	unsigned char bWantsToSprint; // 0xfc8 (0x1)
	unsigned char bHoldingSprint; // 0xfc8 (0x1)
	unsigned char bSprintToggleable; // 0xfc8 (0x1)
	unsigned char bForcingJogFromToggle; // 0xfc8 (0x1)
	unsigned char bForceJogHeld; // 0xfc8 (0x1)
	unsigned char bForceBinaryForward; // 0xfc8 (0x1)
	unsigned char bSprintWasCanceledByReload; // 0xfc8 (0x1)
	unsigned char bShouldAttemptReloadOnEquip; // 0xfc8 (0x1)
	unsigned char bSprintBehaviorIsOverridden; // 0xfc9 (0x1)
	unsigned char bSprintByDefaultWhenSprintIsOverridden; // 0xfc9 (0x1)
	unsigned char bSprintByDefault; // 0xfc9 (0x1)
	unsigned char bAutoRunOn; // 0xfc9 (0x1)
	unsigned char bUseHoldToSwapPickup; // 0xfc9 (0x1)
	unsigned char bTargetingToggleable; // 0xfc9 (0x1)
	unsigned char bTargetingToggleableWithTouch; // 0xfc9 (0x1)
	unsigned char bMovementDisabledDueToCancellableAction; // 0xfc9 (0x1)
	unsigned char bIsPlayerActivelyMoving; // 0xfca (0x1)
	unsigned char bPlaceHeldObjectPressed; // 0xfca (0x1)
	unsigned char bJumpInputPressed; // 0xfca (0x1)
	unsigned char unreflected_fcb[0x1]; // 0xfcb (0x1) 
	int InMovementCancellableAction; // 0xfcc (0x4)
	bool bAllowHoldForAmmoCrafting; // 0xfd0 (0x1)
	bool bIsClientTimingOut; // 0xfd1 (0x1)
	unsigned char unreflected_fd2[0x2]; // 0xfd2 (0x2) 
	float ClientTimeoutBlockInputTime; // 0xfd4 (0x4)
	unsigned char unreflected_fd8[0x8]; // 0xfd8 (0x8) 
	uint64_t LastMoveInputFrame; // 0xfe0 (0x8)
	float LastPressGamepadSprintTime; // 0xfe8 (0x4)
	bool bAutoRunWasHoldingForward; // 0xfec (0x1)
	bool bAtNameBaseScreen; // 0xfed (0x1)
	unsigned char unreflected_fee[0x2]; // 0xfee (0x2) 
	struct FMulticastInlineDelegate OnSetFirstPersonCamera; // 0xff0 (0x10)
	unsigned char unreflected_1000[0x70]; // 0x1000 (0x70) 
	class UClass* CinematicCameraClassOverride; // 0x1070 (0x8)
	bool bOnPressExecuteJetpack; // 0x1078 (0x1)
	unsigned char unreflected_1079[0x1f]; // 0x1079 (0x1f) 
	bool bShowHitMarkersForFriendlyFire; // 0x1098 (0x1)
	bool bServerSideHitMarkers; // 0x1099 (0x1)
	unsigned char unreflected_109a[0x16]; // 0x109a (0x16) 
	struct FMulticastInlineDelegate OnUiChoiceCompleted; // 0x10b0 (0x10)
	struct FMulticastInlineDelegate OnRegainedFocus; // 0x10c0 (0x10)
	struct FMulticastInlineDelegate OnReloadCancelingSprint; // 0x10d0 (0x10)
	unsigned char unreflected_10e0[0x18]; // 0x10e0 (0x18) 
	struct FMulticastInlineDelegate OnOpenVoteDialog; // 0x10f8 (0x10)
	unsigned char unreflected_1108[0x28c]; // 0x1108 (0x28c) 
	bool bGamepadAbilityPending; // 0x1394 (0x1)
	bool bForceAllowCursorMode; // 0x1395 (0x1)
	bool bForceAllowCameraMode; // 0x1396 (0x1)
	unsigned char unreflected_1397[0x1]; // 0x1397 (0x1) 
	bool bSuppressEventNotifications; // 0x1398 (0x1)
	unsigned char unreflected_1399[0x6f]; // 0x1399 (0x6f) 
	float LastSpotTime; // 0x1408 (0x4)
	unsigned char unreflected_140c[0x14]; // 0x140c (0x14) 
	struct TArray<struct TWeakObjectPtr<class AFortMarkActor>> CurrentMarks; // 0x1420 (0x10)
	struct TMap<struct FName, class UAudioComponent*> LoopingUIFeedbackComponents; // 0x1430 (0x50)
	class UFortGameplayAbility* PreviewAbility; // 0x1480 (0x8)
	bool bDisableNativeHitMarker; // 0x1488 (0x1)
	bool bDisableNativeDamageNumbers; // 0x1489 (0x1)
	unsigned char unreflected_148a[0x1e]; // 0x148a (0x1e) 
	struct FAIDirectorDebugInfo IntensityGraphInfo; // 0x14a8 (0x28)
	struct FAIDirectorDebugInfo PIDValuesGraphInfo; // 0x14d0 (0x28)
	struct FAIDirectorDebugInfo PIDContributionsGraphInfo; // 0x14f8 (0x28)
	class AFortAIDirectorDataManager* AIDirectorDataManager; // 0x1520 (0x8)
	class AFortMusicManager* MusicManager; // 0x1528 (0x8)
	struct FMulticastInlineDelegate OnBuildPreviewMarkerVisibilityChanged; // 0x1530 (0x10)
	struct FMulticastInlineDelegate OnWeakSpotReset; // 0x1540 (0x10)
	unsigned char unreflected_1550[0x10]; // 0x1550 (0x10) 
	bool bUsePredictedBuildingActors; // 0x1560 (0x1)
	bool bRegisterPredictedBuildingActorsWithGrid; // 0x1561 (0x1)
	bool bPredictedBuildingWallsHaveNoCollision; // 0x1562 (0x1)
	unsigned char unreflected_1563[0x1]; // 0x1563 (0x1) 
	float PredictedActorLifespan; // 0x1564 (0x4)
	struct TArray<struct TWeakObjectPtr<class ABuildingSMActor>> PredictedBuildingSMActors; // 0x1568 (0x10)
	unsigned char unreflected_1578[0x1b0]; // 0x1578 (0x1b0) 
	class UInputComponent* BuildPreviewModeInputComponent; // 0x1728 (0x8)
	class ABuildingPlayerPrimitivePreview* BuildPreviewMarker; // 0x1730 (0x8)
	class ABuildingPlayerPrimitivePreview* BuildPreviewMarkerExtraPiece; // 0x1738 (0x8)
	unsigned char unreflected_1740[0x60]; // 0x1740 (0x60) 
	bool bAllowBuildingPreviewAutoRotation; // 0x17a0 (0x1)
	bool bRequireTraceToExistingBuildingToSetContext; // 0x17a1 (0x1)
	bool bAllowTraceToExistingBuildingToSetContextToRedirectToBlockingBuilding; // 0x17a2 (0x1)
	bool bRequireTraceToExistingBuildingToSetContextExcludeCurrentContext; // 0x17a3 (0x1)
	unsigned char unreflected_17a4[0xcc]; // 0x17a4 (0xcc) 
	class ABuildingActor* TargetedBuilding; // 0x1870 (0x8)
	class AActor* TargetedVehicle; // 0x1878 (0x8)
	class AFortPawn* TargetedFortPawn; // 0x1880 (0x8)
	class UClass* ContextualConversionClass; // 0x1888 (0x8)
	struct TWeakObjectPtr<class USoundBase> StartUpgradeSound; // 0x1890 (0x28)
	struct TArray<class ABuildingActor*> HighlightedPrimaryBuildings; // 0x18b8 (0x10)
	struct TArray<class ABuildingActor*> HighlightedInteractionBuildings; // 0x18c8 (0x10)
	struct TWeakObjectPtr<class ABuildingActor> HighlightedPrimaryBuilding; // 0x18d8 (0x8)
	struct TWeakObjectPtr<class UMaterialInterface> BuildPreviewMarkerParentMaterial; // 0x18e0 (0x28)
	struct TArray<class UMaterialInstanceDynamic*> BuildPreviewMarkerMIDs; // 0x1908 (0x10)
	unsigned char BuildPreviewRotationIterations; // 0x1918 (0x1)
	unsigned char unreflected_1919[0x3]; // 0x1919 (0x3) 
	unsigned char bBuildPreviewMirrored; // 0x191c (0x1)
	unsigned char unreflected_191d[0x3]; // 0x191d (0x3) 
	enum EFortBuildPreviewMarkerOptionalAdjustment BuildPreviewMarkerOptionalAdjustment; // 0x1920 (0x1)
	unsigned char unreflected_1921[0x3]; // 0x1921 (0x3) 
	unsigned char bBuildFree; // 0x1924 (0x1)
	unsigned char unreflected_1925[0x37]; // 0x1925 (0x37) 
	unsigned char bCraftFree; // 0x195c (0x1)
	unsigned char unreflected_195d[0x3]; // 0x195d (0x3) 
	struct TEnumAsByte<EFortCostInfoTypes> CurrentCostInfoType; // 0x1960 (0x1)
	unsigned char unreflected_1961[0x7]; // 0x1961 (0x7) 
	class UClass* CurrentBuildableClass; // 0x1968 (0x8)
	class UClass* PreviousBuildableClass; // 0x1970 (0x8)
	struct TEnumAsByte<EFortResourceLevel> CurrentResourceLevel; // 0x1978 (0x1)
	struct TEnumAsByte<EFortResourceType> CurrentResourceType; // 0x1979 (0x1)
	unsigned char unreflected_197a[0x6]; // 0x197a (0x6) 
	struct FLastBuildableState LastBuildableStateData[0xc]; // 0x1980 (0x10) (ARRAY) 
	unsigned char unreflected_1a40[0x10]; // 0x1a40 (0x10) 
	struct TArray<struct FFortDamageNumberInfo> QueuedDamageNumbers; // 0x1a50 (0x10)
	class AFortDamageNumbersActor* DamageNumbersActor; // 0x1a60 (0x8)
	class UInputComponent* EditModeInputComponent; // 0x1a68 (0x8)
	class ABuildingSMActor* EditBuildingActor; // 0x1a70 (0x8)
	float EditModeDistance; // 0x1a78 (0x4)
	unsigned char unreflected_1a7c[0x4]; // 0x1a7c (0x4) 
	struct FVector LastBuildPreviewGridSnapLoc; // 0x1a80 (0x18)
	struct FRotator LastBuildPreviewGridSnapRot; // 0x1a98 (0x18)
	struct FVector LastBuildPreviewGridSnapCentroid; // 0x1ab0 (0x18)
	class UInputComponent* PickerInputComponent; // 0x1ac8 (0x8)
	class AFortDecoHelper* TrapPickerDecoHelper; // 0x1ad0 (0x8)
	struct TArray<struct FHitResult> TouchEditResults; // 0x1ad8 (0x10)
	unsigned char unreflected_1ae8[0x1]; // 0x1ae8 (0x1) 
	bool bBuildingPlacementTraceSkipInitialPenetrationOfBuildingSMActor; // 0x1ae9 (0x1)
	bool bBuildingPlacementTraceSkipInitialPenetrationOfStaticMesh; // 0x1aea (0x1)
	unsigned char unreflected_1aeb[0x45]; // 0x1aeb (0x45) 
	class AFortQuickBars* ClientQuickBars; // 0x1b30 (0x8)
	unsigned char unreflected_1b38[0x8]; // 0x1b38 (0x8) 
	struct TArray<struct FRecentlyRemovedQuickbarInfo> RecentlyRemovedQuickbarInfo; // 0x1b40 (0x10)
	unsigned char unreflected_1b50[0x50]; // 0x1b50 (0x50) 
	struct FDelayedQuickBarActionContainer DelayedQuickBarActions; // 0x1ba0 (0x120)
	struct TSet<uint32_t> ClientProcessedQuickBarActions; // 0x1cc0 (0x50)
	bool bShouldForceDeleteDroppedItems; // 0x1d10 (0x1)
	unsigned char unreflected_1d11[0x3f]; // 0x1d11 (0x3f) 
	struct FQueuedItemsToDropViaPickup QueuedItemsToDrop; // 0x1d50 (0x20)
	unsigned char unreflected_1d70[0xb0]; // 0x1d70 (0xb0) 
	unsigned char bAutoEquipBetterItems; // 0x1e20 (0x1)
	unsigned char unreflected_1e21[0x7]; // 0x1e21 (0x7) 
	class UClass* WorldInventoryClass; // 0x1e28 (0x8)
	class AFortInventory* WorldInventory; // 0x1e30 (0x8)
	class AFortInventory* OutpostInventory; // 0x1e38 (0x8)
	class AFortInventory* ViewTargetInventory; // 0x1e40 (0x8)
	unsigned char unreflected_1e48[0x4c]; // 0x1e48 (0x4c) 
	unsigned char bHasInitializedWorldInventory; // 0x1e94 (0x1)
	unsigned char bHasInitializedHeroInventory; // 0x1e94 (0x1)
	unsigned char bAccountInventoryWasUpdated; // 0x1e94 (0x1)
	unsigned char bForceWorldInventoryUpdate; // 0x1e94 (0x1)
	unsigned char bIsSavingGadgetLoadout; // 0x1e94 (0x1)
	unsigned char unreflected_1e95[0xcb]; // 0x1e95 (0xcb) 
	class UFortClientPilot_Base* BotPilot; // 0x1f60 (0x8)
	unsigned char unreflected_1f68[0x18]; // 0x1f68 (0x18) 
	class UFortClientBotManager* BotManager; // 0x1f80 (0x8)
	unsigned char unreflected_1f88[0x8]; // 0x1f88 (0x8) 
	class UClass* ClientBotManagerClass; // 0x1f90 (0x8)
	unsigned char unreflected_1f98[0x18]; // 0x1f98 (0x18) 
	struct FFortAthenaLoadout CosmeticLoadoutPC; // 0x1fb0 (0x178)
	class UFortCustomizationAssetLoader* LocalPawnCustomizationAssetLoader; // 0x2128 (0x8)
	unsigned char unreflected_2130[0x18]; // 0x2130 (0x18) 
	bool bDropWeaponsDuringAllMissionStates; // 0x2148 (0x1)
	unsigned char unreflected_2149[0x1f]; // 0x2149 (0x1f) 
	struct FFortRewardReport LatestRewardReport; // 0x2168 (0x70)
	class UFortRegisteredPlayerInfo* MyPlayerInfo; // 0x21d8 (0x8)
	struct TArray<struct FFortUpdatedObjectiveStat> UpdatedObjectiveStats; // 0x21e0 (0x10)
	bool bHasUnsavedPrimaryMissionProgress; // 0x21f0 (0x1)
	unsigned char unreflected_21f1[0x3f]; // 0x21f1 (0x3f) 
	class UStatManager* StatManager; // 0x2230 (0x8)
	class UHeartbeatManager* HeartbeatManager; // 0x2238 (0x8)
	class UFortStatEventManager* StatEventManager; // 0x2240 (0x8)
	struct FFortPersistentGameplayStatContainer CachedPersistentGameplayStats; // 0x2248 (0x10)
	unsigned char unreflected_2258[0x10]; // 0x2258 (0x10) 
	class UFortMontageItemDefinitionBase* LastEmotePlayed; // 0x2268 (0x8)
	struct TMap<class UFortMontageItemDefinitionBase*, int> EmoteUsageCounts; // 0x2270 (0x50)
	struct TArray<struct FVector> AnalyticsBuildingWallTooLowLocations; // 0x22c0 (0x10)
	struct TSet<class AFortPlayerPawn*> NearbyEmotingPawns; // 0x22d0 (0x50)
	struct TMap<struct FName, int> NearbyEmotingPawnCount; // 0x2320 (0x50)
	class UMcpProfileGroup* McpProfileGroup; // 0x2370 (0x8)
	class UFortMcpProfileCommonPublic* CommonPublicMcpProfile; // 0x2378 (0x8)
	class UFortMcpProfileCommonCore* CommonCoreMcpProfile; // 0x2380 (0x8)
	class UFortMcpProfileCampaign* MainMcpProfile; // 0x2388 (0x8)
	class UFortMcpProfileAthena* AthenaProfile; // 0x2390 (0x8)
	class UFortMcpProfileMetadata* MetadataProfile; // 0x2398 (0x8)
	class UFortMcpProfileCreative* CreativeModeProfile; // 0x23a0 (0x8)
	enum EFortPCTutorialCompletedState TutorialCompletedState; // 0x23a8 (0x1)
	unsigned char unreflected_23a9[0x37]; // 0x23a9 (0x37) 
	bool bShouldReceiveCriticalMatchBonus; // 0x23e0 (0x1)
	bool bIgnoreExperienceOwnership; // 0x23e1 (0x1)
	unsigned char unreflected_23e2[0x6]; // 0x23e2 (0x6) 
	struct FMulticastInlineDelegate OnPlayerChangedBuildMode; // 0x23e8 (0x10)
	struct FMulticastInlineDelegate OnAutoRunEnabled; // 0x23f8 (0x10)
	unsigned char unreflected_2408[0x160]; // 0x2408 (0x160) 
	class USoundEffectSourcePresetChain* VoiceInputSourceEffectPresetChain; // 0x2568 (0x8)
	unsigned char unreflected_2570[0xa0]; // 0x2570 (0xa0) 
	struct FVector LocationUnderReticle; // 0x2610 (0x18)
	unsigned char bEnableVoiceChatPTT; // 0x2628 (0x1)
	unsigned char bVoiceChatPTTTransmit; // 0x2628 (0x1)
	unsigned char bInfiniteAmmo; // 0x2628 (0x1)
	unsigned char bInfiniteConsumables; // 0x2628 (0x1)
	unsigned char bInfiniteMagazine; // 0x2628 (0x1)
	unsigned char bNoCoolDown; // 0x2628 (0x1)
	unsigned char bInfiniteDurability; // 0x2628 (0x1)
	unsigned char bUsePickers; // 0x2628 (0x1)
	unsigned char bPickerOpen; // 0x2629 (0x1)
	unsigned char bPickerEnabled; // 0x2629 (0x1)
	unsigned char bCheatGhost; // 0x2629 (0x1)
	unsigned char bCheatFly; // 0x2629 (0x1)
	unsigned char bEnableShotLogging; // 0x2629 (0x1)
	unsigned char bIsNearActiveEncounters; // 0x2629 (0x1)
	unsigned char unreflected_262a[0x2]; // 0x262a (0x2) 
	int OverriddenBackpackSize; // 0x262c (0x4)
	class AFortReplayMovableSpotLight* CurrentReplaySpotLight; // 0x2630 (0x8)
	uint32_t AimHelpMode; // 0x2638 (0x4)
	struct TEnumAsByte<EFortJumpStaminaCost> JumpStaminaCost; // 0x263c (0x1)
	unsigned char unreflected_263d[0x3]; // 0x263d (0x3) 
	struct FName CameraPrototypeName; // 0x2640 (0x4)
	unsigned char unreflected_2644[0x3c]; // 0x2644 (0x3c) 
	bool bHideHudEnglishText; // 0x2680 (0x1)
	bool bAutoChangeMaterial; // 0x2681 (0x1)
	bool bServerAutoChangeMaterial; // 0x2682 (0x1)
	bool bPeripheralLightingEnabled; // 0x2683 (0x1)
	bool bRudderControlEnabled; // 0x2684 (0x1)
	unsigned char unreflected_2685[0x3]; // 0x2685 (0x3) 
	float RudderDeadZone; // 0x2688 (0x4)
	float RudderMaxThrottle; // 0x268c (0x4)
	struct TArray<class AFortSprayDecalInstance*> ActiveSprayInstances; // 0x2690 (0x10)
	struct TArray<class AActor*> ActiveToyInstances; // 0x26a0 (0x10)
	unsigned char ToySummonCounts_26b0[0x50]; // 0x26b0 (0x50) (UNHANDLED PROPERTY TYPE: MapProperty UID: 0)
	bool bSyncPeripheralLightingWithEmoteMusic; // 0x2700 (0x1)
	bool bPushEmoteAudioDataToCosmeticMaterials; // 0x2701 (0x1)
	unsigned char unreflected_2702[0x2]; // 0x2702 (0x2) 
	float LastEmoteMusicFFT100hz; // 0x2704 (0x4)
	float LastEmoteMusicFFT2000hz; // 0x2708 (0x4)
	float EmoteMusicBeatThreshold; // 0x270c (0x4)
	float EmoteMusicEnvelopeBeatCount; // 0x2710 (0x4)
	unsigned char unreflected_2714[0x4]; // 0x2714 (0x4) 
	struct TArray<struct FString> UsedCosmetics; // 0x2718 (0x10)
	unsigned char unreflected_2728[0x168]; // 0x2728 (0x168) 
	bool bZeroingCameraRoll; // 0x2890 (0x1)
	bool bTryPickupSwap; // 0x2891 (0x1)
	bool bClientSideEditPrediction; // 0x2892 (0x1)
	unsigned char unreflected_2893[0x1]; // 0x2893 (0x1) 
	float ClientSideEditPredictionTimeout; // 0x2894 (0x4)
	unsigned char unreflected_2898[0x8]; // 0x2898 (0x8) 
	class ABuildingSMActor* PendingEnterEditModeActor; // 0x28a0 (0x8)
	int RandomCharacterIndex; // 0x28a8 (0x4)
	float AntiAddictionPlayTimeMultiplier; // 0x28ac (0x4)
	bool bUsesWidgetForFPSDisplay; // 0x28b0 (0x1)
	bool bShowFPS; // 0x28b1 (0x1)
	unsigned char unreflected_28b2[0x6]; // 0x28b2 (0x6) 
	struct FMulticastInlineDelegate OnShowFPSChange; // 0x28b8 (0x10)
	bool bShowTemperature; // 0x28c8 (0x1)
	unsigned char unreflected_28c9[0x7]; // 0x28c9 (0x7) 
	struct FMulticastInlineDelegate OnShowTemperatureChange; // 0x28d0 (0x10)
	unsigned char unreflected_28e0[0x58]; // 0x28e0 (0x58) 
	struct FLockOnInfo LockOnInfo; // 0x2938 (0x50)
	bool bLockPrimaryInputMethodToMouse; // 0x2988 (0x1)
	unsigned char unreflected_2989[0x17]; // 0x2989 (0x17) 
	class UFortIndicatorManager* IndicatorManager; // 0x29a0 (0x8)
	unsigned char unreflected_29a8[0x10]; // 0x29a8 (0x10) 
	bool bFinalXPUpdateFailed; // 0x29b8 (0x1)
	unsigned char unreflected_29b9[0x7]; // 0x29b9 (0x7) 
	class UUserWidget* TestUserWidget; // 0x29c0 (0x8)
	enum EFortPawnStasisMode PreviousStasisMode; // 0x29c8 (0x1)
	unsigned char unreflected_29c9[0x7]; // 0x29c9 (0x7) 
	class UClass* BattleMapSpectatorClass; // 0x29d0 (0x8)
	unsigned char unreflected_29d8[0x1d]; // 0x29d8 (0x1d) 
	bool bReleaseBuildingContextOnPlace; // 0x29f5 (0x1)
	unsigned char unreflected_29f6[0x2]; // 0x29f6 (0x2) 
	float TurboPlaceFirstInterval; // 0x29f8 (0x4)
	float TurboPlaceInterval; // 0x29fc (0x4)
	bool bCreativeTurboDelete; // 0x2a00 (0x1)
	unsigned char unreflected_2a01[0x3]; // 0x2a01 (0x3) 
	float TurboDeleteFirstInterval; // 0x2a04 (0x4)
	float TurboDeleteInterval; // 0x2a08 (0x4)
	unsigned char unreflected_2a0c[0x1]; // 0x2a0c (0x1) 
	bool bTurboBuild; // 0x2a0d (0x1)
	unsigned char unreflected_2a0e[0x2]; // 0x2a0e (0x2) 
	float TurboBuildFirstInterval; // 0x2a10 (0x4)
	float TurboBuildRequestFailedInterval; // 0x2a14 (0x4)
	float TurboBuildInterval; // 0x2a18 (0x4)
	unsigned char unreflected_2a1c[0xc]; // 0x2a1c (0xc) 
	class UFortControllerComponent_Telemetry* FortControllerComponentTelemetry; // 0x2a28 (0x8)
	class UFortControllerComponent_InventoryNetworkManagement* InventoryNetworkManagementComponent; // 0x2a30 (0x8)
	class UFortControllerComponent_Interaction* InteractionComponent; // 0x2a38 (0x8)
	class UFortControllerComponent_QuickEdit* QuickEditComponent; // 0x2a40 (0x8)
	class UFortControllerComponent_SmartBuild* SmartBuildComponent; // 0x2a48 (0x8)
	class UFortControllerComponent_Collections* CollectionsComponent; // 0x2a50 (0x8)
	struct FItemVariantHandle PendingExecuteInventoryItemHandle; // 0x2a58 (0x18)
	unsigned char unreflected_2a70[0x18]; // 0x2a70 (0x18) 
	class UClass* QuickHealItemPickerClass; // 0x2a88 (0x8)
	struct FMulticastInlineDelegate OnPlayerSpawnedBuildingActor; // 0x2a90 (0x10)
	struct TArray<struct FString> MeshParentIds; // 0x2aa0 (0x10)
	struct FMulticastInlineDelegate OnToggleFullscreenMap; // 0x2ab0 (0x10)
	unsigned char unreflected_2ac0[0x78]; // 0x2ac0 (0x78) 
	struct FMulticastInlineDelegate OnBoundActionFreed; // 0x2b38 (0x10)
	unsigned char unreflected_2b48[0xb8]; // 0x2b48 (0xb8) 
	float ForcedInputRotationSpeed; // 0x2c00 (0x4)
	unsigned char unreflected_2c04[0x4]; // 0x2c04 (0x4) 
	class APawn* PendingClientRestartPawn; // 0x2c08 (0x8)
	unsigned char unreflected_2c10[0x20]; // 0x2c10 (0x20) 
	struct TArray<struct FFortWorldPartitionGridRangeOverrides> TargetGrids; // 0x2c30 (0x10)
	unsigned char padding_2c40[0x10]; // 0x2c40 (0x10)

	/* Functions */

	// Function /Script/FortniteGame.FortPlayerController.WantsToSecondaryInteract (Underlying native function: WantsToSecondaryInteract 0x8b7441c)
	bool WantsToSecondaryInteract(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortPlayerController.WantsToDBNOCarry (Underlying native function: WantsToDBNOCarry 0x8b743f8)
	bool WantsToDBNOCarry(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortPlayerController.UpdateClientCollection (Underlying native function: UpdateClientCollection 0x8b740fc)
	void UpdateClientCollection(struct FString& CollectionType, struct FString& category, struct FFortMcpCollectedItemProperties& Properties, enum EFortCollectedVariantClientUpdate& UpdateKind); // (Net | NetReliable | Native | Event | Public | NetClient)

	// Function /Script/FortniteGame.FortPlayerController.UnMutePlayer (Underlying native function: UnMutePlayer 0x8b7402c)
