// Class /Script/FortniteGame.FortPlayerControllerAthena
// Size: 0x48e0
class AFortPlayerControllerAthena : public AFortPlayerControllerZone
{
	float FireAbilityToWeaponSwitchTime; // 0x3958 (0x4)
	unsigned char unreflected_395c[0x14]; // 0x395c (0x14) 
	struct FMulticastInlineDelegate OnAircraftStateChange; // 0x3970 (0x10)
	unsigned char unreflected_3980[0x8]; // 0x3980 (0x8) 
	struct FMulticastInlineDelegate OnItemDropSpawnedDelegate; // 0x3988 (0x10)
	struct FMulticastInlineDelegate OnItemDroppedDueToOverflow; // 0x3998 (0x10)
	class UFortWorldItemDefinition* SwappingItemDefinition; // 0x39a8 (0x8)
	float WinScreenDelayTime; // 0x39b0 (0x4)
	bool bSkipPlayWinEffects; // 0x39b4 (0x1)
	bool bAllowPlayersCreditOnLeave; // 0x39b5 (0x1)
	unsigned char unreflected_39b6[0x1]; // 0x39b6 (0x1) 
	bool bLockingOnFocalPoint; // 0x39b7 (0x1)
	class AActor* FocalPoint; // 0x39b8 (0x8)
	struct FVector_NetQuantize FocalPointOffset; // 0x39c0 (0x18)
	float FocalPointFOV; // 0x39d8 (0x4)
	float FocalPointDuration; // 0x39dc (0x4)
	unsigned char unreflected_39e0[0x8]; // 0x39e0 (0x8) 
	struct FMulticastInlineDelegate OnUsingFocalPointChanged; // 0x39e8 (0x10)
	struct FMulticastInlineDelegate OnFocalPointActorChanged; // 0x39f8 (0x10)
	struct FMulticastInlineDelegate OnCinematicCameraSkipped; // 0x3a08 (0x10)
	struct FMulticastInlineDelegate OnSkydiveLeaderChanged; // 0x3a18 (0x10)
	struct FMulticastInlineDelegate OnClientDonationSuccessDelegate; // 0x3a28 (0x10)
	unsigned char unreflected_3a38[0x38]; // 0x3a38 (0x38) 
	float SkydiveLeaderManualCameraTime; // 0x3a70 (0x4)
	unsigned char unreflected_3a74[0x4]; // 0x3a74 (0x4) 
	struct FRotator InterpolatedSkydiveFollowerViewRotation; // 0x3a78 (0x18)
	unsigned char unreflected_3a90[0x18]; // 0x3a90 (0x18) 
	class AFortPlayerState* SkydiveLeader; // 0x3aa8 (0x8)
	unsigned char unreflected_3ab0[0x8]; // 0x3ab0 (0x8) 
	struct FMulticastInlineDelegate OnPickupProjectileCreatedDelegate; // 0x3ab8 (0x10)
	class AFortPlayerStateAthena* LastDownedVictim; // 0x3ac8 (0x8)
	class AFortPlayerStateAthena* LastElimVictim; // 0x3ad0 (0x8)
	unsigned char unreflected_3ad8[0x8]; // 0x3ad8 (0x8) 
	struct FMulticastInlineDelegate OnCameraInStormWallChangeDelegate; // 0x3ae0 (0x10)
	unsigned char unreflected_3af0[0x18]; // 0x3af0 (0x18) 
	bool bLeaveDisconnectedPawnsInGame; // 0x3b08 (0x1)
	unsigned char unreflected_3b09[0x7]; // 0x3b09 (0x7) 
	class AFortPlayerPawn* DisconnectedPawn; // 0x3b10 (0x8)
	class AFortPlayerPawn* PreviousPawn; // 0x3b18 (0x8)
	bool bReplicateViewTargetInventory; // 0x3b20 (0x1)
	unsigned char bHasHadValidPawn; // 0x3b21 (0x1)
	unsigned char bClientNotifiedOfWin; // 0x3b21 (0x1)
	unsigned char bClientNotifiedOfTeamWin; // 0x3b21 (0x1)
	unsigned char bClientNotifiedOfLoss; // 0x3b21 (0x1)
	unsigned char bHideWarmUpLoadingScreen; // 0x3b21 (0x1)
	unsigned char unreflected_3b22[0x46]; // 0x3b22 (0x46) 
	struct TArray<struct FString> PlayersTalking; // 0x3b68 (0x10)
	struct FMulticastInlineDelegate TalkingPlayersChanged; // 0x3b78 (0x10)
	bool bHighlightRecordingEnabled; // 0x3b88 (0x1)
	bool bPlaceDangerMarkerWhenTargeting; // 0x3b89 (0x1)
	bool bDeferringStartRecordingHighlights; // 0x3b8a (0x1)
	unsigned char unreflected_3b8b[0x5]; // 0x3b8b (0x5) 
	struct FString HighlightGroupId; // 0x3b90 (0x10)
	int CachedHighlightCount; // 0x3ba0 (0x4)
	float HighlightFirstKillTime; // 0x3ba4 (0x4)
	int HighlightKillMultiple; // 0x3ba8 (0x4)
	int HighlightDownMultiple; // 0x3bac (0x4)
	float HighlightKillCooldown; // 0x3bb0 (0x4)
	float HighlightKillRewindTime; // 0x3bb4 (0x4)
	float CabinModeCheckTimeInterval; // 0x3bb8 (0x4)
	float CabinModeRestartTimeInterval; // 0x3bbc (0x4)
	float RespawnCameraTime; // 0x3bc0 (0x4)
	float RespawnCameraHoldPositionTime; // 0x3bc4 (0x4)
	struct FVector RespawnCameraInitialLocOffsetInAir; // 0x3bc8 (0x18)
	struct FVector RespawnCameraInitialLocOffsetOnGround; // 0x3be0 (0x18)
	struct FRotator RespawnCameraInitialRotOffsetInAir; // 0x3bf8 (0x18)
	struct FRotator RespawnCameraInitialRotOffsetOnGround; // 0x3c10 (0x18)
	float RespawnCameraOffsetFromHit; // 0x3c28 (0x4)
	bool bNextRespawnInAir; // 0x3c2c (0x1)
	unsigned char unreflected_3c2d[0x3]; // 0x3c2d (0x3) 
	struct FName RespawnCameraBehavior; // 0x3c30 (0x4)
	unsigned char unreflected_3c34[0x2c]; // 0x3c34 (0x2c) 
	int MaximumNumberOfPawnsToSearchForEmoteMusic; // 0x3c60 (0x4)
	unsigned char unreflected_3c64[0xc]; // 0x3c64 (0xc) 
	float PickupSwapHoldTime; // 0x3c70 (0x4)
	bool bUseNewPickupSwapLogic; // 0x3c74 (0x1)
	unsigned char unreflected_3c75[0x3]; // 0x3c75 (0x3) 
	float SpectatorLevelStreamDistance; // 0x3c78 (0x4)
	float RespawnLevelStreamDistance; // 0x3c7c (0x4)
	struct FMulticastInlineDelegate SpectatorStreamingChanged; // 0x3c80 (0x10)
	struct FMulticastInlineDelegate InGameLoadScreenChanged; // 0x3c90 (0x10)
	struct FMulticastInlineDelegate OnLocalPlayerChangedTeams; // 0x3ca0 (0x10)
	unsigned char unreflected_3cb0[0x20]; // 0x3cb0 (0x20) 
	struct FLevelStreamRequestHandshakeState LevelStreamRequestHandshakeState; // 0x3cd0 (0x1)
	unsigned char unreflected_3cd1[0x37]; // 0x3cd1 (0x37) 
	struct FMulticastInlineDelegate OnCreativePlotLinkedVolumeChanged; // 0x3d08 (0x10)
	struct FMulticastInlineDelegate OnCreativePermissionsChanged; // 0x3d18 (0x10)
	struct FMulticastInlineDelegate OnCreativeContentFilterChanged; // 0x3d28 (0x10)
	struct FMulticastInlineDelegate OnClientLeaveIsland; // 0x3d38 (0x10)
	struct FMulticastInlineDelegate OnClientForcedOffIsland; // 0x3d48 (0x10)
	unsigned char unreflected_3d58[0x10]; // 0x3d58 (0x10) 
	struct FMulticastInlineDelegate OnMakeNewCreativePlotFinished; // 0x3d68 (0x10)
	struct FMulticastInlineDelegate OnDestroyCreativePlotFinished; // 0x3d78 (0x10)
	struct FMulticastInlineDelegate OnRestoreCreativePlotFinished; // 0x3d88 (0x10)
	struct FMulticastInlineDelegate OnDuplicateCreativePlotFinished; // 0x3d98 (0x10)
	struct FMulticastInlineDelegate OnIslandEntriesChanged; // 0x3da8 (0x10)
	unsigned char unreflected_3db8[0x10]; // 0x3db8 (0x10) 
	struct FMulticastInlineDelegate OnUpdateCreativePlotName; // 0x3dc8 (0x10)
	struct FMulticastInlineDelegate OnUpdateCreativeDescriptionTags; // 0x3dd8 (0x10)
	unsigned char unreflected_3de8[0x18]; // 0x3de8 (0x18) 
	class ACameraActor* RespawnCameraActor; // 0x3e00 (0x8)
	bool bDelayedTeleporting; // 0x3e08 (0x1)
	bool bBlockTeleporting; // 0x3e09 (0x1)
	unsigned char unreflected_3e0a[0x2]; // 0x3e0a (0x2) 
	int MaxPlotCount; // 0x3e0c (0x4)
	unsigned char unreflected_3e10[0x68]; // 0x3e10 (0x68) 
	struct FMulticastInlineDelegate InGameMatchmakingReadyCheckStarted; // 0x3e78 (0x10)
	struct FMulticastInlineDelegate InGameMatchmakingReadyCheckComplete; // 0x3e88 (0x10)
	struct FMulticastInlineDelegate InGameMatchmakingReadyCheckCanceled; // 0x3e98 (0x10)
	struct FMulticastInlineDelegate InGameMatchmakingStarted; // 0x3ea8 (0x10)
	struct FMulticastInlineDelegate InGameMatchmakingComplete; // 0x3eb8 (0x10)
	struct FMulticastInlineDelegate InGameMatchmakingStateChanged; // 0x3ec8 (0x10)
	struct FMulticastInlineDelegate InGameMatchmakingQueuedStatusUpdated; // 0x3ed8 (0x10)
	struct FMulticastInlineDelegate InGameMatchmakingError; // 0x3ee8 (0x10)
	struct FMulticastInlineDelegate OnInGameMatchmakingCanceled; // 0x3ef8 (0x10)
	struct FMulticastInlineDelegate OnInGameMatchmakingUpdateCheckFailed; // 0x3f08 (0x10)
	struct FMulticastInlineDelegate OnInGameContentDownloadStarted; // 0x3f18 (0x10)
	struct FMulticastInlineDelegate OnInGameMatchmakingUtilityStateChanged; // 0x3f28 (0x10)
	bool bNoInGameMatchmaking; // 0x3f38 (0x1)
	unsigned char unreflected_3f39[0x37]; // 0x3f39 (0x37) 
	class USoundBase* AudioOnExitAircraft; // 0x3f70 (0x8)
	class USoundBase* AudioOnExitAircraftHornDoppler; // 0x3f78 (0x8)
	float MinQuickChatCooldown; // 0x3f80 (0x4)
	float QuickChatOffCooldownTime; // 0x3f84 (0x4)
	bool bMarkedAlive; // 0x3f88 (0x1)
	unsigned char unreflected_3f89[0x7]; // 0x3f89 (0x7) 
	struct TArray<struct FCreativeIslandData> CreativeIslands; // 0x3f90 (0x10)
	bool bIsAllowedToPublish; // 0x3fa0 (0x1)
	unsigned char unreflected_3fa1[0x7]; // 0x3fa1 (0x7) 
	struct TWeakObjectPtr<class UFortGamepadSettings> GamepadSettingsAssetPtr; // 0x3fa8 (0x28)
	unsigned char unreflected_3fd0[0x18]; // 0x3fd0 (0x18) 
	struct FLinearColor TeamMemberIndicatorColor; // 0x3fe8 (0x10)
	unsigned char unreflected_3ff8[0x28]; // 0x3ff8 (0x28) 
	bool bMatchStatsForPlayerSent; // 0x4020 (0x1)
	bool bAddedBookProgressStatsToGamemode; // 0x4021 (0x1)
	bool bHasSentMatchEndedQuestProgress; // 0x4022 (0x1)
	unsigned char unreflected_4023[0x5]; // 0x4023 (0x5) 
	struct FQuickBarData QuickBarDefinitions[0x3]; // 0x4028 (0x10) (ARRAY) 
	unsigned char unreflected_4058[0x11]; // 0x4058 (0x11) 
	bool bEnableBroadcastRemoteClientInfo; // 0x4069 (0x1)
	unsigned char unreflected_406a[0x6]; // 0x406a (0x6) 
	class AFortBroadcastRemoteClientInfo* BroadcastRemoteClientInfo; // 0x4070 (0x8)
	unsigned char unreflected_4078[0x8]; // 0x4078 (0x8) 
	class UFortHero* StrongMyHero; // 0x4080 (0x8)
	struct TArray<struct TWeakObjectPtr<class UObject>> ClientGameWorldHolds; // 0x4088 (0x10)
	unsigned char unreflected_4098[0x28]; // 0x4098 (0x28) 
	float EndMatchHeartbeatTimerDelay; // 0x40c0 (0x4)
	unsigned char unreflected_40c4[0x4]; // 0x40c4 (0x4) 
	double EndMatchHeartbeatTimestamp; // 0x40c8 (0x8)
	class AFortPlayerStartWarmup* WarmupPlayerStart; // 0x40d0 (0x8)
	class UInputComponent* FullScreenScoreboardInputComponent; // 0x40d8 (0x8)
	class UInputComponent* CurrentFullscreenInputComponent; // 0x40e0 (0x8)
	class UInputComponent* GameChannelRecommendationInputComponent; // 0x40e8 (0x8)
	class UInputComponent* QuickWeaponInputComponent; // 0x40f0 (0x8)
	unsigned char unreflected_40f8[0x16d]; // 0x40f8 (0x16d) 
	bool bUseTrapPicker; // 0x4265 (0x1)
	unsigned char unreflected_4266[0x22]; // 0x4266 (0x22) 
	bool bRichPresenceUsesCreativeActivityName; // 0x4288 (0x1)
	unsigned char unreflected_4289[0x2f]; // 0x4289 (0x2f) 
	float DoubleTapEditTime; // 0x42b8 (0x4)
	unsigned char unreflected_42bc[0x4]; // 0x42bc (0x4) 
	class UAthenaPlayerMatchReport* MatchReport; // 0x42c0 (0x8)
	unsigned char unreflected_42c8[0x10]; // 0x42c8 (0x10) 
	class UClass* MinimapIndicatorClass; // 0x42d8 (0x8)
	class UClass* MinimapChallengeIndicatorClass; // 0x42e0 (0x8)
	class UFortMiniMapChallengeIndicators* MinimapChallengeIndicators; // 0x42e8 (0x8)
	bool bEnableInGameChallengeLocationIndicators; // 0x42f0 (0x1)
	unsigned char unreflected_42f1[0x7]; // 0x42f1 (0x7) 
	class UClass* SquadMarkerActorClass; // 0x42f8 (0x8)
	unsigned char unreflected_4300[0xc]; // 0x4300 (0xc) 
	int UnprocessedXp; // 0x430c (0x4)
	float XpReceivedLastAtTime; // 0x4310 (0x4)
	int BuildingsCreated; // 0x4314 (0x4)
	int BuildingsEdited; // 0x4318 (0x4)
	int BuildingsRepaired; // 0x431c (0x4)
	int BuildingsUpgraded; // 0x4320 (0x4)
	float BuildingActionDoneLastAtTime; // 0x4324 (0x4)
	struct FBuildingStats BuildingMatchStats; // 0x4328 (0x20)
	struct TArray<struct FBuildingEditAnalyticEvent> BuildingAnalyticsArray; // 0x4348 (0x10)
	float TimeStartedTrackingBuildingAnalytics; // 0x4358 (0x4)
	unsigned char unreflected_435c[0xdc]; // 0x435c (0xdc) 
	class AFortVolume* CreativePlotLinkedVolume; // 0x4438 (0x8)
	struct FCreativePlotSessionData CreativePlotSessionData; // 0x4440 (0x14)
	unsigned char unreflected_4454[0x4]; // 0x4454 (0x4) 
	class AFortAthenaCreativePortal* OwnedPortal; // 0x4458 (0x8)
	class AFortAthenaPartyRiftPortal* OwnedPartyRiftPortal; // 0x4460 (0x8)
	unsigned char unreflected_4468[0x48]; // 0x4468 (0x48) 
	struct FMulticastInlineDelegate OnHUDMessageToggled; // 0x44b0 (0x10)
	struct TArray<struct FItemAndCount> CachedPurchasedItems; // 0x44c0 (0x10)
	struct FMinigameSpawnData PendingMinigameSpawnData; // 0x44d0 (0x3)
	unsigned char unreflected_44d3[0x15]; // 0x44d3 (0x15) 
	class UFortPlaysetItemDefinition* CurrentPlayset; // 0x44e8 (0x8)
	float DestructedBuildingInGridTimeoutOverride; // 0x44f0 (0x4)
	unsigned char unreflected_44f4[0x4]; // 0x44f4 (0x4) 
	struct FText ClientRespawnText; // 0x44f8 (0x18)
	struct FText ClientRebootingText; // 0x4510 (0x18)
	struct FText ClientIslandTravelText; // 0x4528 (0x18)
	struct FText ClientTravelToCreativeHubText; // 0x4540 (0x18)
	struct TArray<class AActor*> VolumesLoading; // 0x4558 (0x10)
	struct TArray<class AActor*> VolumesUnloading; // 0x4568 (0x10)
	class UAthenaMarkerComponent* MarkerComponent; // 0x4578 (0x8)
	class UAthenaResurrectionComponent* ResurrectionComponent; // 0x4580 (0x8)
	class UFortControllerComponent_SeasonItem* SeasonItemComponent; // 0x4588 (0x8)
	unsigned char unreflected_4590[0x8]; // 0x4590 (0x8) 
	class UFortControllerComponent_HeldDeviceUsage* HeldDeviceUsageComponent; // 0x4598 (0x8)
	unsigned char unreflected_45a0[0x18]; // 0x45a0 (0x18) 
	class UFortPlayerControllerAthenaXPComponent* XPComponent; // 0x45b8 (0x8)
	class UFortControllerComponent_MapDiscoverability* DiscoverabilityComponent; // 0x45c0 (0x8)
	class UFortControllerComponent_TransientQuests* TransientQuestsComponent; // 0x45c8 (0x8)
	class UFortControllerComponent_Quests* QuestsComponent; // 0x45d0 (0x8)
	class UFortControllerComponent_SkydiveFeedback* SkydiveFeedback; // 0x45d8 (0x8)
	class UFortControllerComponent_IndicatedActorManagement* IndicatedActorManagementComponent; // 0x45e0 (0x8)
	class UFortControllerComponent_LocalizationService* LocalizationServiceComponent; // 0x45e8 (0x8)
	class UFortControllerComponent_ToxicityService* ToxicityServiceComponent; // 0x45f0 (0x8)
	class UFortControllerComponent_RechargeWeapons* RechargingWeaponsComponent; // 0x45f8 (0x8)
	class UFortControllerComponent_InventoryService* InventoryServiceComponent; // 0x4600 (0x8)
	class UFortControllerComponent_RadiusTracker* RadiusTrackerComponent; // 0x4608 (0x8)
	class UFortControllerComponent_MinigameActivity* MinigameActivityComponent; // 0x4610 (0x8)
	class UCreativeAnalyticsComponent* CreativeAnalyticsComponent; // 0x4618 (0x8)
	struct FScalableFloat SightWeatherCapRadius; // 0x4620 (0x28)
	double TimeSinceLastCreativeSpawn; // 0x4648 (0x8)
	unsigned char unreflected_4650[0x20]; // 0x4650 (0x20) 
	struct FCompositeBool IgnoreSignifanceBasedCustomDepthRendering; // 0x4670 (0x18)
	class UCreativeUserContentManager* CreativeUserContentManager; // 0x4688 (0x8)
	struct TWeakObjectPtr<class UClass> CreativeUserContentManagerClassSoftClassPtr; // 0x4690 (0x28)
	unsigned char unreflected_46b8[0x10]; // 0x46b8 (0x10) 
	class UFortCreativeObjectTrackingComponent* CreativeObjectTrackingComponent; // 0x46c8 (0x8)
	class UFortCreativeEntitlementComponent* CreativeEntitlementComponent; // 0x46d0 (0x8)
	struct FMulticastInlineDelegate OnPreviewScreenshotCameraActivated; // 0x46d8 (0x10)
	unsigned char unreflected_46e8[0x118]; // 0x46e8 (0x118) 
	struct FQuickBarEquippedItemGuids PrimaryQuickBarSlotItemGuids; // 0x4800 (0xa4)
	unsigned char unreflected_48a4[0x34]; // 0x48a4 (0x34) 
	bool bIgnoreSpectatorViewRotation; // 0x48d8 (0x1)
	bool bIgnorePlayerInfoAbandonStateForSpecialEventRtmm; // 0x48d9 (0x1)
	unsigned char padding_48da[0x6]; // 0x48da (0x6)

	/* Functions */

	// Function /Script/FortniteGame.FortPlayerControllerAthena.WriteCreateBuildingAnalytics (Underlying native function: WriteCreateBuildingAnalytics 0x812666c)
	void WriteCreateBuildingAnalytics(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortPlayerControllerAthena.UpdateUGCRestrictedForVolume (Underlying native function: UpdateUGCRestrictedForVolume 0x8126574)
	void UpdateUGCRestrictedForVolume(class AFortVolume*& Volume, bool& bRestricted); // (Net | NetReliable | Native | Event | Public | NetServer | 0x80000000)

	// Function /Script/FortniteGame.FortPlayerControllerAthena.UpdateRichPresenceTimer (Underlying native function: UpdateRichPresenceTimer 0x8126560)
	void UpdateRichPresenceTimer(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortPlayerControllerAthena.UpdateCreativePlotName (Underlying native function: UpdateCreativePlotName 0x81263ec)
