// Class /Script/FortniteGame.FortCreativeMoveTool
// Size: 0x1850
class AFortCreativeMoveTool : public AFortWeapon
{
	class UFortObjectMoverInputComponent* CreativeMoveToolInputComponent; // 0x1028 (0x8)
	unsigned char unreflected_1030[0x78]; // 0x1030 (0x78) 
	struct FMulticastInlineDelegate OnFinishedSpawningDelegate; // 0x10a8 (0x10)
	struct TMap<class AActor*, class AActor*> PreviewToOriginalActors; // 0x10b8 (0x50)
	unsigned char unreflected_1108[0x8]; // 0x1108 (0x8) 
	struct TArray<struct FOriginalAndSpawnedPair> SpawnHelperNewlyPlacedActors; // 0x1110 (0x10)
	struct TArray<struct FActorAndTransformPair> ToDuplicateActors; // 0x1120 (0x10)
	unsigned char unreflected_1130[0x8]; // 0x1130 (0x8) 
	struct FMulticastInlineDelegate OnFinishedSpawningSelectedActors; // 0x1138 (0x10)
	struct FMulticastInlineDelegate OnFinishedSpawningPreviewActors; // 0x1148 (0x10)
	struct FMulticastInlineDelegate OnFinishedSpawningForCut; // 0x1158 (0x10)
	struct TArray<struct FCreativeSelectedActorInfo> SelectedActorsReplicateToRemoteClients; // 0x1168 (0x10)
	class UObjectInteractionBehavior* ActiveMovementModeReplicateToRemoteClients; // 0x1178 (0x8)
	float MaxRange; // 0x1180 (0x4)
	unsigned char unreflected_1184[0x4]; // 0x1184 (0x4) 
	class UObjectInteractionBehavior* ActiveMovementMode; // 0x1188 (0x8)
	bool bIsPreviewingMove; // 0x1190 (0x1)
	unsigned char unreflected_1191[0x7]; // 0x1191 (0x7) 
	struct TArray<class UObjectInteractionBehavior*> InteractionBehaviors; // 0x1198 (0x10)
	unsigned char unreflected_11a8[0x10]; // 0x11a8 (0x10) 
	class UDeleteObjects* DeleteObjectsInteractionBehavior; // 0x11b8 (0x8)
	class UPlaysetPreview* PlaysetPreviewInteractionBehavior; // 0x11c0 (0x8)
	unsigned char unreflected_11c8[0x10]; // 0x11c8 (0x10) 
	struct FMulticastInlineDelegate OnMoveToolInteractionStarted; // 0x11d8 (0x10)
	struct FMulticastInlineDelegate OnMoveToolInteractionStopped; // 0x11e8 (0x10)
	struct FMulticastInlineDelegate OnMoveToolRotationAxisChanged; // 0x11f8 (0x10)
	struct FMulticastInlineDelegate OnMoveToolScaleAxisChanged; // 0x1208 (0x10)
	struct FMulticastInlineDelegate OnMoveToolLineOfSightBlockingChanged; // 0x1218 (0x10)
	struct FMulticastInlineDelegate OnMoveToolDropToFloorChanged; // 0x1228 (0x10)
	struct FMulticastInlineDelegate OnMoveToolPrecisionChanged; // 0x1238 (0x10)
	struct FMulticastInlineDelegate OnMoveToolTransformationModeChanged; // 0x1248 (0x10)
	struct FMulticastInlineDelegate OnMoveToolScaleInsteadOfRotateChanged; // 0x1258 (0x10)
	struct FMulticastInlineDelegate OnAddedSelectedActor; // 0x1268 (0x10)
	struct FMulticastInlineDelegate OnCouldNotAddReachedSelectionLimit; // 0x1278 (0x10)
	struct FMulticastInlineDelegate OnRemovedSelectedActor; // 0x1288 (0x10)
	struct FMulticastInlineDelegate OnSelectedActorsCleared; // 0x1298 (0x10)
	struct FMulticastInlineDelegate OnSelectionPropertyChanged; // 0x12a8 (0x10)
	struct FMulticastInlineDelegate OnMoveToolScaleModified; // 0x12b8 (0x10)
	struct FMulticastInlineDelegate OnMoveToolRotationModified; // 0x12c8 (0x10)
	struct FMulticastInlineDelegate OnMoveToolBuildingAsPropSettingChanged; // 0x12d8 (0x10)
	struct FMulticastInlineDelegate OnMoveToolFocusChanged; // 0x12e8 (0x10)
	unsigned char unreflected_12f8[0x59]; // 0x12f8 (0x59) 
	enum ETransformationType CurrentTransformationType; // 0x1351 (0x1)
	unsigned char unreflected_1352[0x6]; // 0x1352 (0x6) 
	struct TArray<struct FCreativeSelectedActorInfo> SelectedActors; // 0x1358 (0x10)
	struct TArray<struct FLogicalConnectionChain> ServerSelectedActorLogicalConnections; // 0x1368 (0x10)
	struct TArray<struct FValidPlacementPair> ConnectedActorStates; // 0x1378 (0x10)
	struct FVector ScaleModifier; // 0x1388 (0x18)
	struct FTransform SelectionToWorld; // 0x13a0 (0x60)
	struct FBox SelectionSpaceActorsBounds; // 0x1400 (0x38)
	unsigned char unreflected_1438[0xc8]; // 0x1438 (0xc8) 
	bool bIsScaleUpPressed; // 0x1500 (0x1)
	unsigned char unreflected_1501[0x2f]; // 0x1501 (0x2f) 
	bool bIsMultiselectEnabled; // 0x1530 (0x1)
	bool bIsQuickbarSupported; // 0x1531 (0x1)
	bool bIsImmersiveEditModeEnabled; // 0x1532 (0x1)
	enum ESelectionProperty SelectionProperty; // 0x1533 (0x1)
	unsigned char unreflected_1534[0x2]; // 0x1534 (0x2) 
	bool bIsScaleDownPressed; // 0x1536 (0x1)
	bool bIsPushPressed; // 0x1537 (0x1)
	bool bIsPullPressed; // 0x1538 (0x1)
	bool bIsAutoTractorBeamRunning; // 0x1539 (0x1)
	unsigned char unreflected_153a[0xa]; // 0x153a (0xa) 
	bool bIsRotateClockwisePressed; // 0x1544 (0x1)
	bool bIsRotateCounterclockwisePressed; // 0x1545 (0x1)
	bool bIsScalingInsteadOfRotating; // 0x1546 (0x1)
	unsigned char unreflected_1547[0x9]; // 0x1547 (0x9) 
	struct FQuat TargetRotationOffset; // 0x1550 (0x20)
	struct FQuat RotationOffset; // 0x1570 (0x20)
	struct TArray<struct FRotator> RotationAxes; // 0x1590 (0x10)
	unsigned char RotationAxisIndex; // 0x15a0 (0x1)
	enum EScaleAxis SelectedScaleAxis; // 0x15a1 (0x1)
	unsigned char unreflected_15a2[0x6]; // 0x15a2 (0x6) 
	struct TSet<class UMeshComponent*> HoveredComponents; // 0x15a8 (0x50)
	struct TMap<class UMeshComponent*, float> ComponentsToReclaimMIDsFrom; // 0x15f8 (0x50)
	struct TArray<struct FCreativePooledMID> AllMIDs; // 0x1648 (0x10)
	unsigned char unreflected_1658[0x50]; // 0x1658 (0x50) 
	float MaxUnhoverAnimationTime; // 0x16a8 (0x4)
	unsigned char unreflected_16ac[0x4]; // 0x16ac (0x4) 
	struct TArray<struct FOriginalAndSpawnedPair> NewlyPlacedActors; // 0x16b0 (0x10)
	struct FFlashCountedActorInfo CutActors; // 0x16c0 (0x18)
	struct TArray<struct FCreativeSelectedActorInfo> CutActorsPrereplication; // 0x16d8 (0x10)
	struct TArray<class AActor*> DisableCollisionActors; // 0x16e8 (0x10)
	struct TArray<class AActor*> DisableCollisionActorsPrereplication; // 0x16f8 (0x10)
	struct TSet<class AActor*> AlreadyProcessedNewlyPlacedActorsOnClient; // 0x1708 (0x50)
	struct FAgingActorArray RecentlyPlacedAgingActors; // 0x1758 (0x10)
	bool bShouldDestroyPropsWhenPlacing; // 0x1768 (0x1)
	bool bAllowGravityOnPlace; // 0x1769 (0x1)
	unsigned char unreflected_176a[0x2]; // 0x176a (0x2) 
	struct FCreativeOptionVariableBase* WantsGravityOnPlace; // 0x176c (0x8)
	bool bShouldUsePrecisionGridSnapping; // 0x1774 (0x1)
	unsigned char GridSnapIndex; // 0x1775 (0x1)
	unsigned char unreflected_1776[0x2]; // 0x1776 (0x2) 
	struct FCreativeOptionVariableBase* WantsPrecisionGridSnapping; // 0x1778 (0x8)
	struct TArray<struct FVector> GridSnapRatios; // 0x1780 (0x10)
	bool bDoesRequireCreatePermission; // 0x1790 (0x1)
	enum EHitTraceType TraceType; // 0x1791 (0x1)
	bool bClientNeedsToProcessNewlyPlacedActors; // 0x1792 (0x1)
	unsigned char unreflected_1793[0x1]; // 0x1793 (0x1) 
	struct FCreativeOptionVariableBase* WantedHitTraceRule; // 0x1794 (0x8)
	unsigned char unreflected_179c[0x4]; // 0x179c (0x4) 
	struct FGameplayTagContainer MoveToolActivatedTags; // 0x17a0 (0x20)
	struct FGameplayTag ProgressTimerCueTag; // 0x17c0 (0x4)
	unsigned char unreflected_17c4[0x4]; // 0x17c4 (0x4) 
	class ULevelRecordSpawner* ActiveRecordSpawner; // 0x17c8 (0x8)
	class UClass* VolumeClassToSpawn; // 0x17d0 (0x8)
	struct FCreativeOptionVariableBase* WantedIgnoreRecentlyPlacedTime; // 0x17d8 (0x8)
	bool bAlwaysMoveFreely; // 0x17e0 (0x1)
	unsigned char unreflected_17e1[0x7]; // 0x17e1 (0x7) 
	bool bBuildingsAsPropsSnapToCenter; // 0x17e8 (0x1)
	unsigned char unreflected_17e9[0x3]; // 0x17e9 (0x3) 
	struct FCreativeOptionVariableBase* WantedAlwaysMoveFreely; // 0x17ec (0x8)
	struct FCreativeOptionVariableBase* WantedCameraSpacePositioning; // 0x17f4 (0x8)
	struct FCreativeOptionVariableBase* WantsAutoTractorBeam; // 0x17fc (0x8)
	unsigned char unreflected_1804[0x4]; // 0x1804 (0x4) 
	class AActor* HoveredActor; // 0x1808 (0x8)
	class AFortCreativeHeatmapThermometerPreview* CreativeHeatmapThermometerPreview; // 0x1810 (0x8)
	struct FGameplayTagContainer WeaponEquipContextTags; // 0x1818 (0x20)
	struct FString PlacementLocale; // 0x1838 (0x10)
	unsigned char padding_1848[0x8]; // 0x1848 (0x8)

	/* Functions */

	// Function /Script/FortniteGame.FortCreativeMoveTool.UnholsterWeapon (Underlying native function: UnholsterWeapon 0x8e11c04)
	void UnholsterWeapon(); // (Final | Native | Protected | BlueprintCallable)

	// Function /Script/FortniteGame.FortCreativeMoveTool.TurboBuildAttemptToPlace (Underlying native function: TurboBuildAttemptToPlace 0x8e11bf0)
	void TurboBuildAttemptToPlace(); // (Final | Native | Protected)

	// Function /Script/FortniteGame.FortCreativeMoveTool.SpawnPlaysetVolumeOnServer (Underlying native function: SpawnPlaysetVolumeOnServer 0x8e11aa8)
	void SpawnPlaysetVolumeOnServer(class UFortPlaysetItemDefinition*& Playset, struct FVector& SpawnLocation, struct FRotator& SpawnRotation); // (Net | NetReliable | Native | Event | Protected | NetServer | HasDefaults | 0x80000000)

