// Class /Script/FortniteGame.FortAthenaVehicle
// Size: 0x1940
class AFortAthenaVehicle : public AFortPhysicsPawn
{
	unsigned char unreflected_480[0x68]; // 0x480 (0x68) 
	struct FPredictionReplicationProxy_AP NetPredictionProxyAP; // 0x4e8 (0x18)
	struct FPredictionReplicationProxy_SP NetPredictionProxySP; // 0x500 (0x18)
	struct TWeakObjectPtr<class UAthenaItemWrapDefinition> SoftOverrideItemWrap; // 0x518 (0x28)
	class UAthenaItemWrapDefinition* OverrideItemWrap; // 0x540 (0x8)
	struct FMulticastInlineDelegate OnSpringCompressionDelegate; // 0x548 (0x10)
	struct TSet<class AFortPlayerPawnAthena*> PlayersBasedOnVehicle; // 0x558 (0x50)
	unsigned char unreflected_5a8[0x20]; // 0x5a8 (0x20) 
	struct FMulticastInlineDelegate OnSleepStateChangedDelegate; // 0x5c8 (0x10)
	struct FWaterSurfaceInfo WaterSurfaceDataCache; // 0x5d8 (0x68)
	unsigned char unreflected_640[0x8]; // 0x640 (0x8) 
	struct TWeakObjectPtr<class AController> LastDamageInstigator; // 0x648 (0x8)
	struct TWeakObjectPtr<class AController> LastOutOfHealthInstigator; // 0x650 (0x8)
	struct TWeakObjectPtr<class AActor> LastOutOfHealthDamageCauser; // 0x658 (0x8)
	class USplineComponent* BoundsXYSplineComponent; // 0x660 (0x8)
	class USkeletalMeshComponentBudgeted* SkeletalMesh; // 0x668 (0x8)
	unsigned char unreflected_670[0x28]; // 0x670 (0x28) 
	int CustomDepthStencilValue; // 0x698 (0x4)
	int CustomDepthStencilValueForHighlightedVehicle; // 0x69c (0x4)
	unsigned char SquadId; // 0x6a0 (0x1)
	unsigned char TeamId; // 0x6a1 (0x1)
	struct TEnumAsByte<EVehicleInitialOverlapBehavior> InitialOverlapBehavior; // 0x6a2 (0x1)
	unsigned char bDisableUpdateForcedDebugInput; // 0x6a3 (0x1)
	unsigned char bDisableUpdateAutoRun; // 0x6a3 (0x1)
	unsigned char bDisableUpdateHonk; // 0x6a3 (0x1)
	unsigned char bDisableUpdateIgnoredBuildingActors; // 0x6a3 (0x1)
	unsigned char bDisableUpdateIngoredPawnsForDamage; // 0x6a3 (0x1)
	unsigned char bDisableUpdateSafeTeleport; // 0x6a3 (0x1)
	unsigned char bUseForceHeading; // 0x6a3 (0x1)
	unsigned char bDestroyOnLastExit; // 0x6a4 (0x1)
	unsigned char bShowDamageNumbers; // 0x6a4 (0x1)
	unsigned char bShowDamageNumbersAtImpactLocation; // 0x6a4 (0x1)
	unsigned char bPlayDamageAudio; // 0x6a4 (0x1)
	unsigned char bShowVehicleHealthBarOnPlayerHUD; // 0x6a4 (0x1)
	unsigned char bDestroyBuildingSMActorOnForceExit; // 0x6a4 (0x1)
	unsigned char bIgnoreAllFallingDamage; // 0x6a4 (0x1)
	unsigned char bIgnoreNextFallingDamage; // 0x6a4 (0x1)
	unsigned char bShouldClearFallDamageImmunityForPawnsOnExit; // 0x6a5 (0x1)
	unsigned char bIsBraking; // 0x6a5 (0x1)
	unsigned char bPlayedDying; // 0x6a5 (0x1)
	unsigned char bForceDeath; // 0x6a5 (0x1)
	unsigned char bPlayInstantDeathEffects; // 0x6a5 (0x1)
	unsigned char bHasDriver; // 0x6a5 (0x1)
	unsigned char bHasPassengers; // 0x6a5 (0x1)
	unsigned char bCanSleepWhileNotTouchingAnything; // 0x6a5 (0x1)
	unsigned char bIsTouchingAnything; // 0x6a6 (0x1)
	unsigned char bIsInWater; // 0x6a6 (0x1)
	unsigned char bIsInWaterBody; // 0x6a6 (0x1)
	unsigned char bIsOverlappingWaterBody; // 0x6a6 (0x1)
	unsigned char bIsFullyInWaterBody; // 0x6a6 (0x1)
	unsigned char bCanDriveOnIncline; // 0x6a6 (0x1)
	unsigned char bCanCoastOnIncline; // 0x6a6 (0x1)
	unsigned char bWheelsOnGround; // 0x6a6 (0x1)
	unsigned char bAnyWheelsOnGround; // 0x6a7 (0x1)
	unsigned char bIsTouchingDrivableGround; // 0x6a7 (0x1)
	unsigned char bIsTouchingGroundWithoutWheels; // 0x6a7 (0x1)
	unsigned char bPossiblyTouchingTop; // 0x6a7 (0x1)
	unsigned char unreflected_6a8[0x2]; // 0x6a8 (0x2) 
	unsigned char bUseGravity; // 0x6aa (0x1)
	unsigned char bAllowInteractBetweenFortVolumes; // 0x6aa (0x1)
	unsigned char bCanPassengerPawnsTakeDamage; // 0x6aa (0x1)
	unsigned char bServerIsInUndergroundVolume; // 0x6ab (0x1)
	unsigned char bEnableCurieMaterial; // 0x6ab (0x1)
	unsigned char bEnforceTeamRestrictionForMiniGame; // 0x6ab (0x1)
	unsigned char bEnforceMinigameClassRestriction; // 0x6ab (0x1)
	unsigned char bUseCustomDepthStencilValue; // 0x6ab (0x1)
	unsigned char bStencilEnabled; // 0x6ab (0x1)
	unsigned char bCachedSquadRestrictionEnabled; // 0x6ab (0x1)
	unsigned char bEnforceTeamRestriction; // 0x6ac (0x1)
	unsigned char unreflected_6ad[0x3]; // 0x6ad (0x3) 
	int MinigameClassID; // 0x6b0 (0x4)
	unsigned char unreflected_6b4[0x4]; // 0x6b4 (0x4) 
	struct FMulticastInlineDelegate OnPawnEnteredVehicleAtSeat; // 0x6b8 (0x10)
	struct FMulticastInlineDelegate OnPawnEnteredVehicleSeat; // 0x6c8 (0x10)
	struct FMulticastInlineDelegate OnPawnExitedVehicleSeat; // 0x6d8 (0x10)
	struct FMulticastInlineDelegate OnPawnExitedVehicleFromSeat; // 0x6e8 (0x10)
	struct FMulticastInlineDelegate OnPawnFinishEnteringVehicle; // 0x6f8 (0x10)
	struct FMulticastInlineDelegate OnVehicleHornEvent; // 0x708 (0x10)
	struct FMulticastInlineDelegate OnVehicleOwnerChanged; // 0x718 (0x10)
	unsigned char bWaitingForSleep; // 0x728 (0x1)
	unsigned char bAttemptAsyncOrientationCorrection; // 0x728 (0x1)
	unsigned char bIsAsyncCorrectingOrientation; // 0x728 (0x1)
	unsigned char bAlwaysCreateNavComponent; // 0x729 (0x1)
	unsigned char bAllowInteractBetweenFortVolumesRuntime; // 0x729 (0x1)
	unsigned char bTricksEnabled; // 0x729 (0x1)
	unsigned char unreflected_72a[0x6]; // 0x72a (0x6) 
	float FireDamageTickTimer; // 0x730 (0x4)
	float CurrentFOV; // 0x734 (0x4)
	struct FGameplayTagContainer FireEnvDamageTags; // 0x738 (0x20)
	struct FGameplayTagContainer PawnIgnoreBumpTags; // 0x758 (0x20)
	class USlateBrushAsset* DriverReticleBrush; // 0x778 (0x8)
	struct FGameplayTagContainer AppliedVehicleModTags; // 0x780 (0x20)
	class UFortVehicleModCollectedData* CollectedVehicleModData; // 0x7a0 (0x8)
	unsigned char unreflected_7a8[0x4]; // 0x7a8 (0x4) 
	float WaterEffectsVehicleMaxSpeedKmh; // 0x7ac (0x4)
	class UNiagaraSystem* WaterEffectsAsset; // 0x7b0 (0x8)
	class UNiagaraComponent* WaterEffectsComponent; // 0x7b8 (0x8)
	unsigned char unreflected_7c0[0x8]; // 0x7c0 (0x8) 
	struct FGameplayTagContainer GameplayTags; // 0x7c8 (0x20)
	struct TSet<struct FIgnoredPawn> PawnsToIgnoreForDamge; // 0x7e8 (0x50)
	struct TArray<class AFortPawn*> PawnsToIgnoreForCollision; // 0x838 (0x10)
	struct TArray<class AFortPawn*> IgnoredPawnsPendingTeleport; // 0x848 (0x10)
	float LastPropImpactImpulseTime; // 0x858 (0x4)
	unsigned char unreflected_85c[0x4]; // 0x85c (0x4) 
	struct TArray<struct FPredictedDestroyedBuilding> PredictedDestroyedBuildings; // 0x860 (0x10)
	struct TArray<class UBuildingEditModeMetadata*> WallsVehicleCanDestroy; // 0x870 (0x10)
	struct TArray<class UBuildingEditModeMetadata*> WallsVehicleCannotDestroyWhenBoosting; // 0x880 (0x10)
	struct TArray<class UClass*> BuildingPropClassesVehicleCanDestroy; // 0x890 (0x10)
	struct TArray<class UClass*> BuildingPropClassesVehicleCannotDestroyWhenBoosting; // 0x8a0 (0x10)
	struct TArray<struct TScriptInterface<class IVehicleSeatInputHookProvider>> SeatInputProviders; // 0x8b0 (0x10)
	struct FFortAthenaVehicleInputState EmptyDriverInputState; // 0x8c0 (0x40)
	struct FVector AverageSpringNormal; // 0x900 (0x18)
	float TopSpeedCurrentMultiplier; // 0x918 (0x4)
	float PushForceCurrentMultiplier; // 0x91c (0x4)
	struct FVector2D LastStickInput; // 0x920 (0x10)
	unsigned char unreflected_930[0x10]; // 0x930 (0x10) 
	float SteeringAngle; // 0x940 (0x4)
	unsigned char unreflected_944[0x24]; // 0x944 (0x24) 
	float FrontLateralFrictionRuntimeMultiplier; // 0x968 (0x4)
	float RearLateralFrictionRuntimeMultiplier; // 0x96c (0x4)
	struct FVector LocalRearFrictionPt; // 0x970 (0x18)
	struct FVector LocalFrontFrictionPt; // 0x988 (0x18)
	float FrontMassRatio; // 0x9a0 (0x4)
	float RearMassRatio; // 0x9a4 (0x4)
	unsigned char unreflected_9a8[0x20]; // 0x9a8 (0x20) 
	float TotalBrakingDelta; // 0x9c8 (0x4)
	unsigned char unreflected_9cc[0x69]; // 0x9cc (0x69) 
	struct TEnumAsByte<EPhysicalSurface> PrimarySurfaceType; // 0xa35 (0x1)
	struct TEnumAsByte<EFortBaseWeaponDamage> WeaponResponseType; // 0xa36 (0x1)
	unsigned char VTDMode; // 0xa37 (0x1)
	unsigned char unreflected_a38[0x3]; // 0xa38 (0x3) 
	struct TEnumAsByte<EPhysicalSurface> SurfaceTypeVehicleOn; // 0xa3b (0x1)
	unsigned char unreflected_a3c[0x14]; // 0xa3c (0x14) 
	int ForcedMaterialVariantIndex; // 0xa50 (0x4)
	unsigned char unreflected_a54[0x4]; // 0xa54 (0x4) 
	struct FFortRechargingActionTimer FuelCharge; // 0xa58 (0xd8)
	struct FMulticastInlineDelegate OnRechargeableFuelAboveThreshold; // 0xb30 (0x10)
	struct FMulticastInlineDelegate OnRechargeableFuelBelowThreshold; // 0xb40 (0x10)
	struct FMulticastInlineDelegate OnOutOfRechargeableFuel; // 0xb50 (0x10)
	struct FMulticastInlineDelegate OnNotOutOfRechargeableFuel; // 0xb60 (0x10)
	struct FMulticastInlineDelegate OnMountedWeaponFiredEvent; // 0xb70 (0x10)
	unsigned char unreflected_b80[0x4]; // 0xb80 (0x4) 
	float SeatSwitchCooldown; // 0xb84 (0x4)
	struct FGameplayTagContainer VehicleTags; // 0xb88 (0x20)
	struct TArray<struct FVehicleSpringInfo> Springs; // 0xba8 (0x10)
	struct FSpringGroundTriangle GroundTriangle; // 0xbb8 (0xc)
	unsigned char unreflected_bc4[0x4]; // 0xbc4 (0x4) 
	struct TArray<struct FSMVehicleGear> Gears; // 0xbc8 (0x10)
	struct TArray<struct FSMVehicleGear> SprintGears; // 0xbd8 (0x10)
	struct TArray<struct FSMVehicleGear> ReverseGears; // 0xbe8 (0x10)
	float ForwardDrivingAntiGravityScaler; // 0xbf8 (0x4)
	float CameraSpaceForwardDistanceOffset; // 0xbfc (0x4)
	unsigned char unreflected_c00[0x4]; // 0xc00 (0x4) 
	float CameraAssistStrength; // 0xc04 (0x4)
	float CameraAssistRampUp; // 0xc08 (0x4)
	bool bAllowAutoCamera; // 0xc0c (0x1)
	unsigned char unreflected_c0d[0x3]; // 0xc0d (0x3) 
	float TimeToAutoCamera; // 0xc10 (0x4)
	float MinSpeedForAutoCamera; // 0xc14 (0x4)
	float CameraAssistBaseHeight; // 0xc18 (0x4)
	float CameraAssistUpHillScaler; // 0xc1c (0x4)
	float CameraAssistSteerScaler; // 0xc20 (0x4)
	float CameraAssistForwardScale; // 0xc24 (0x4)
	float AngleDegreesThresholdFromCurrentCameraToTarget; // 0xc28 (0x4)
	float CameraFOVOffset; // 0xc2c (0x4)
	class UClass* TetheredCamera; // 0xc30 (0x8)
	unsigned char unreflected_c38[0x30]; // 0xc38 (0x30) 
	class UClass* PlayerCollisionGameplayEffect; // 0xc68 (0x8)
	class UPrimitiveComponent* OverlapComponent; // 0xc70 (0x8)
	class UPrimitiveComponent* WaterOverlapComponent; // 0xc78 (0x8)
	unsigned char unreflected_c80[0x4]; // 0xc80 (0x4) 
	float WaterLevel; // 0xc84 (0x4)
	int WaterOverlapCount; // 0xc88 (0x4)
	float VehicleMinHorSpeedToDamage; // 0xc8c (0x4)
	float VehicleMaxHorSpeedToDamage; // 0xc90 (0x4)
	float VehicleMinHorSpeedDamage; // 0xc94 (0x4)
	float VehicleMaxHorSpeedDamage; // 0xc98 (0x4)
	float TargetingZOffset; // 0xc9c (0x4)
	float BrakeAboveTopSpeedDelta; // 0xca0 (0x4)
	float TimeToIdleBrake; // 0xca4 (0x4)
	float DragCoefficient; // 0xca8 (0x4)
	float PrimaryCameraPitchConstraint; // 0xcac (0x4)
	float PrimaryCameraYawConstraint; // 0xcb0 (0x4)
	float CachedSpeed; // 0xcb4 (0x4)
	struct FName MainBodyCollision; // 0xcb8 (0x4)
	unsigned char unreflected_cbc[0x4]; // 0xcbc (0x4) 
	struct FVector TestInitialLinearVelocity; // 0xcc0 (0x18)
	struct FVector TestInitialAngularVelocity; // 0xcd8 (0x18)
	struct FHitResult LookAheadHit; // 0xcf0 (0xe0)
	class UFortVehicleTrickSet* TrickSet; // 0xdd0 (0x8)
	struct FName PushForceSocket; // 0xdd8 (0x4)
	struct FName FrontWheelsSocket; // 0xddc (0x4)
	struct FName RearWheelSockets; // 0xde0 (0x4)
	unsigned char unreflected_de4[0x4]; // 0xde4 (0x4) 
	class UWeaponHitNotifyAudioBank* DefaultHitNotifyAudioBank; // 0xde8 (0x8)
	struct FMulticastInlineDelegate OnHandleOutOfHealthDelegate; // 0xdf0 (0x10)
	struct FMulticastInlineDelegate OnHealthChanged; // 0xe00 (0x10)
	unsigned char unreflected_e10[0x18]; // 0xe10 (0x18) 
	struct FMulticastInlineDelegate OnDamageablePartHealthChanged; // 0xe28 (0x10)
	struct FName BulletCollisionComponentTag; // 0xe38 (0x4)
	unsigned char unreflected_e3c[0x4]; // 0xe3c (0x4) 
	class UClass* GEDamagePassengersOnDeath; // 0xe40 (0x8)
	struct FMulticastInlineDelegate OnVehicleSquadChanged; // 0xe48 (0x10)
	float LifespanAfterDeath; // 0xe58 (0x4)
	float LastDamagedTime; // 0xe5c (0x4)
	struct TArray<struct FSeatTransitionMontage> SeatTransitions; // 0xe60 (0x10)
	unsigned char unreflected_e70[0x30]; // 0xe70 (0x30) 
	struct FMulticastInlineDelegate OnVehicleEnteredWaterBody; // 0xea0 (0x10)
	struct FMulticastInlineDelegate OnVehicleExitedWaterBody; // 0xeb0 (0x10)
	struct FVehicleRuntimeModifiers RuntimeModifiedProperties; // 0xec0 (0x18)
	struct TArray<class ABuildingActor*> LocallyIgnoredBuildingActors; // 0xed8 (0x10)
	struct FVector PreviousBuildingQueryPosition; // 0xee8 (0x18)
	float ImpulseResponseMultiplier; // 0xf00 (0x4)
	float ImpulseResponseZBias; // 0xf04 (0x4)
	unsigned char unreflected_f08[0x28]; // 0xf08 (0x28) 
	struct FTimerHandle* WaterSubmergedTimerHandle; // 0xf30 (0x8)
	unsigned char unreflected_f38[0x20]; // 0xf38 (0x20) 
	class USoundEffectSourcePresetChain* EmoteAudioSourcePresetChain; // 0xf58 (0x8)
	class USoundAttenuation* EmoteAudioAttenuation; // 0xf60 (0x8)
	struct FMarkedActorDisplayInfo MarkerDisplay; // 0xf68 (0x98)
	struct FMulticastInlineDelegate OnSurfaceTypeVehicleIsOnChangedDelegate; // 0x1000 (0x10)
	class UFortAbilitySet* StartupAbilitySet; // 0x1010 (0x8)
	class UFortVehicleSeatComponent* VehicleSeatComponent; // 0x1018 (0x8)
	class UFortVehicleInteractionOverrideComponent* VehicleInteractionOverrideComponent; // 0x1020 (0x8)
	class UFortSkyTubePhysicsComponent* SkyTubePhysicsComponent; // 0x1028 (0x8)
	class UFortVehiclePontoonsComponent* PontoonsComponent; // 0x1030 (0x8)
	class UFortAthenaTrackableAIObjectComponent* TrackableAIObjectComponent; // 0x1038 (0x8)
	struct TArray<struct FAthenaCarPlayerSlot> PlayerSlots; // 0x1040 (0x10)
	struct TArray<struct FAthenaCarPlayerSlot> PlayerSlotsBackup; // 0x1050 (0x10)
	struct TArray<struct FAthenaCarPlayerSlotUnreplicated*> PlayerSlotsUnreplicated; // 0x1060 (0x10)
	class UFortVehicleMovementSet* VehicleMovementSet; // 0x1070 (0x8)
	struct FReplicatedAthenaVehicleAttributes VehicleAttributes; // 0x1078 (0x20)
	class UFortVehiclePhysicsCollisionDamageComponent* CachedVehiclePhysicsCollisionDamageComponent; // 0x1098 (0x8)
	class UFortVehicleFuelComponent* CachedFuelComponent; // 0x10a0 (0x8)
	struct TArray<struct FText> ReasonsWhyCantContainPlayers; // 0x10a8 (0x10)
	struct TArray<class ABuildingActor*> IgnoredBuildingActors; // 0x10b8 (0x10)
	struct TArray<struct FVehicleDamageablePart> DamageableParts; // 0x10c8 (0x10)
	struct TArray<struct FVehicleToggleablePart*> ToggledParts; // 0x10d8 (0x10)
	unsigned char unreflected_10e8[0x268]; // 0x10e8 (0x268) 
	struct FVehicleTargetOrientation CorrectTargetOrientation; // 0x1350 (0x48)
	class UClass* CameraModeClass; // 0x1398 (0x8)
	class UClass* DrivingAnimClass; // 0x13a0 (0x8)
	class UClass* DriverAnimLayerOverlayClass; // 0x13a8 (0x8)
	class UClass* PassengerAnimLayerOverlayClass; // 0x13b0 (0x8)
	class UFortVehicleAnimSet* AnimSet; // 0x13b8 (0x8)
	unsigned char unreflected_13c0[0x138]; // 0x13c0 (0x138) 
	struct FFortAttributeInitializationKey* AttributeInitKey; // 0x14f8 (0x8)
	class UFortAbilitySystemComponent* AbilitySystemComponent; // 0x1500 (0x8)
	class UFortHealthSet* HealthSet; // 0x1508 (0x8)
	class UFortAthenaImpulseResponseSet* ImpulseResponseSet; // 0x1510 (0x8)
	class UFortDamageSet* DamageSet; // 0x1518 (0x8)
	class UFortHealthBarIndicator* HealthBarIndicator; // 0x1520 (0x8)
	struct FVehicleCosmeticInfo VehicleCosmeticInfo; // 0x1528 (0x38)
	unsigned char unreflected_1560[0x18]; // 0x1560 (0x18) 
	class UFortVehicleNavModifierComponent* NavModifierComponent; // 0x1578 (0x8)
	bool bShouldSleepAtSpawn; // 0x1580 (0x1)
	bool bSpawnedSleepLockActive; // 0x1581 (0x1)
	unsigned char unreflected_1582[0x2]; // 0x1582 (0x2) 
	uint32_t ForceKinematicOnClientCount; // 0x1584 (0x4)
	class AActor* ImpactInstigator; // 0x1588 (0x8)
	unsigned char unreflected_1590[0x58]; // 0x1590 (0x58) 
	float NormalizedRPM; // 0x15e8 (0x4)
	unsigned char unreflected_15ec[0x4]; // 0x15ec (0x4) 
	struct TArray<struct FVehicleSpecificUIDetails> CustomUI; // 0x15f0 (0x10)
	struct TArray<struct FActiveVehicleUI> ActiveCustomUI; // 0x1600 (0x10)
	struct TArray<struct FVehicleSpecificUIDetails> MobileCustomUI; // 0x1610 (0x10)
	unsigned char unreflected_1620[0x8]; // 0x1620 (0x8) 
	struct FMulticastInlineDelegate OnModAppliedOnClientDelegate; // 0x1628 (0x10)
	struct FGameplayTag AlwaysDamageVehiclesWithTag; // 0x1638 (0x4)
	unsigned char unreflected_163c[0x4]; // 0x163c (0x4) 
	struct FTireInfo BaseTireInfo; // 0x1640 (0x1d0)
	class UPrimitiveComponent* CurrentOverlapComponent; // 0x1810 (0x8)
	class UClass* VehicleConfigsClass; // 0x1818 (0x8)
	class UFortPhysicsVehicleConfigs* FortPhysicsVehicleConfigs; // 0x1820 (0x8)
	unsigned char unreflected_1828[0x4]; // 0x1828 (0x4) 
	bool bBoosting; // 0x182c (0x1)
	unsigned char unreflected_182d[0x3]; // 0x182d (0x3) 
	float BoostEndTime; // 0x1830 (0x4)
	unsigned char unreflected_1834[0x4]; // 0x1834 (0x4) 
	struct FMulticastInlineDelegate OnBoostStartedDelegate; // 0x1838 (0x10)
	struct FMulticastInlineDelegate OnBoostFinishedDelegate; // 0x1848 (0x10)
	class UFortSoundIndicatorComponent* SoundIndicatorComponent; // 0x1858 (0x8)
	bool bShouldDealDamage; // 0x1860 (0x1)
	unsigned char unreflected_1861[0x7]; // 0x1861 (0x7) 
	class UNiagaraComponent* NativeCompLowFuelSputter; // 0x1868 (0x8)
	class UNiagaraSystem* NativeSysLowFuelSputter; // 0x1870 (0x8)
	struct FMulticastInlineDelegate OnOutOfFuelDelegate; // 0x1878 (0x10)
	struct FMulticastInlineDelegate OnGainedFuelDelegate; // 0x1888 (0x10)
	struct FMulticastInlineDelegate OnLowFuelDelegate; // 0x1898 (0x10)
	int DebugDestroyLogCount; // 0x18a8 (0x4)
	float ServerCriticalHealth; // 0x18ac (0x4)
	float HealthZeroTime; // 0x18b0 (0x4)
	unsigned char bExploded; // 0x18b4 (0x1)
	unsigned char bPendingDeath; // 0x18b4 (0x1)
	unsigned char bOnFire; // 0x18b4 (0x1)
	unsigned char unreflected_18b5[0x3]; // 0x18b5 (0x3) 
	struct FMulticastInlineDelegate OnStartCriticalHealth; // 0x18b8 (0x10)
	struct FMulticastInlineDelegate OnExplode; // 0x18c8 (0x10)
	unsigned char unreflected_18d8[0x18]; // 0x18d8 (0x18) 
	bool bOnRoad; // 0x18f0 (0x1)
	bool bOnLandscape; // 0x18f1 (0x1)
	bool bOnDirt; // 0x18f2 (0x1)
	bool bOnGrass; // 0x18f3 (0x1)
	bool bOnIce; // 0x18f4 (0x1)
	bool bOnSnow; // 0x18f5 (0x1)
	bool bOnVehicle; // 0x18f6 (0x1)
	unsigned char unreflected_18f7[0x1]; // 0x18f7 (0x1) 
	struct TArray<enum ETireSurfaces> TireSurfaces; // 0x18f8 (0x10)
	struct FMulticastInlineDelegate OnTirePoppedDelegate; // 0x1908 (0x10)
	float LastPopTireTime; // 0x1918 (0x4)
	unsigned char unreflected_191c[0x4]; // 0x191c (0x4) 
	struct TArray<enum ETireStates> TireStates; // 0x1920 (0x10)
	float RimScrapeDamageTimer; // 0x1930 (0x4)
	unsigned char padding_1934[0xc]; // 0x1934 (0xc)

	/* Functions */

	// Function /Script/FortniteGame.FortAthenaVehicle.WheelsOnGround (Underlying native function: WheelsOnGround 0x2fd17c8)
	bool WheelsOnGround(); // (0x00000002 | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteGame.FortAthenaVehicle.WeaponFired (Has no native function)
	void WeaponFired(class UFortVehicleSeatWeaponComponent*& WeaponComponent, float& Overheat); // (0x00000002 | Event | Public | BlueprintEvent)

	// Function /Script/FortniteGame.FortAthenaVehicle.WakeUpOnGroundDied (Underlying native function: WakeUpOnGroundDied 0x8041ab4)
	void WakeUpOnGroundDied(class AActor*& DamagedActor, float& Damage, class AController*& InstigatedBy, class AActor*& DamageCauser, struct FVector& HitLocation, class UPrimitiveComponent*& FHitComponent, struct FName& BoneName, struct FVector& Momentum); // (Final | Native | Public | HasDefaults)

