// Class /Script/Engine.PlayerController
// Size: 0x848
class APlayerController : public AController
{
	unsigned char unreflected_320[0x8]; // 0x320 (0x8) 
	class UPlayer* Player; // 0x328 (0x8)
	class APawn* AcknowledgedPawn; // 0x330 (0x8)
	class AHUD* MyHUD; // 0x338 (0x8)
	class APlayerCameraManager* PlayerCameraManager; // 0x340 (0x8)
	class UClass* PlayerCameraManagerClass; // 0x348 (0x8)
	bool bAutoManageActiveCameraTarget; // 0x350 (0x1)
	unsigned char unreflected_351[0x7]; // 0x351 (0x7) 
	struct FRotator TargetViewRotation; // 0x358 (0x18)
	unsigned char unreflected_370[0x18]; // 0x370 (0x18) 
	float SmoothTargetViewRotationSpeed; // 0x388 (0x4)
	unsigned char unreflected_38c[0x4]; // 0x38c (0x4) 
	struct TArray<class AActor*> HiddenActors; // 0x390 (0x10)
	struct TArray<struct TWeakObjectPtr<class UPrimitiveComponent>> HiddenPrimitiveComponents; // 0x3a0 (0x10)
	unsigned char unreflected_3b0[0x4]; // 0x3b0 (0x4) 
	float LastSpectatorStateSynchTime; // 0x3b4 (0x4)
	struct FVector LastSpectatorSyncLocation; // 0x3b8 (0x18)
	struct FRotator LastSpectatorSyncRotation; // 0x3d0 (0x18)
	int ClientCap; // 0x3e8 (0x4)
	unsigned char unreflected_3ec[0x4]; // 0x3ec (0x4) 
	class UCheatManager* CheatManager; // 0x3f0 (0x8)
	class UClass* CheatClass; // 0x3f8 (0x8)
	class UPlayerInput* PlayerInput; // 0x400 (0x8)
	struct TArray<struct FActiveForceFeedbackEffect> ActiveForceFeedbackEffects; // 0x408 (0x10)
	class UClass* AsyncPhysicsDataClass; // 0x418 (0x8)
	class UAsyncPhysicsInputComponent* AsyncPhysicsDataComponent; // 0x420 (0x8)
	unsigned char unreflected_428[0x80]; // 0x428 (0x80) 
	unsigned char bPlayerIsWaiting; // 0x4a8 (0x1)
	unsigned char unreflected_4a9[0x3]; // 0x4a9 (0x3) 
	unsigned char NetPlayerIndex; // 0x4ac (0x1)
	unsigned char unreflected_4ad[0x5b]; // 0x4ad (0x5b) 
	class UNetConnection* PendingSwapConnection; // 0x508 (0x8)
	class UNetConnection* NetConnection; // 0x510 (0x8)
	unsigned char unreflected_518[0x18]; // 0x518 (0x18) 
	float InputYawScale; // 0x530 (0x4)
	float InputPitchScale; // 0x534 (0x4)
	float InputRollScale; // 0x538 (0x4)
	unsigned char bShowMouseCursor; // 0x53c (0x1)
	unsigned char bEnableClickEvents; // 0x53c (0x1)
	unsigned char bEnableTouchEvents; // 0x53c (0x1)
	unsigned char bEnableMouseOverEvents; // 0x53c (0x1)
	unsigned char bEnableTouchOverEvents; // 0x53c (0x1)
	unsigned char bForceFeedbackEnabled; // 0x53c (0x1)
	unsigned char bEnableMotionControls; // 0x53c (0x1)
	unsigned char bEnableStreamingSource; // 0x53c (0x1)
	unsigned char bStreamingSourceShouldActivate; // 0x53d (0x1)
	unsigned char bStreamingSourceShouldBlockOnSlowStreaming; // 0x53d (0x1)
	unsigned char unreflected_53e[0x2]; // 0x53e (0x2) 
	enum EStreamingSourcePriority StreamingSourcePriority; // 0x540 (0x1)
	unsigned char unreflected_541[0x3]; // 0x541 (0x3) 
	struct FColor StreamingSourceDebugColor; // 0x544 (0x4)
	struct TArray<struct FStreamingSourceShape> StreamingSourceShapes; // 0x548 (0x10)
	float ForceFeedbackScale; // 0x558 (0x4)
	unsigned char unreflected_55c[0x4]; // 0x55c (0x4) 
	struct TArray<struct FKey> ClickEventKeys; // 0x560 (0x10)
	struct TEnumAsByte<EMouseCursor> DefaultMouseCursor; // 0x570 (0x1)
	struct TEnumAsByte<EMouseCursor> CurrentMouseCursor; // 0x571 (0x1)
	struct TEnumAsByte<ECollisionChannel> DefaultClickTraceChannel; // 0x572 (0x1)
	struct TEnumAsByte<ECollisionChannel> CurrentClickTraceChannel; // 0x573 (0x1)
	float HitResultTraceDistance; // 0x574 (0x4)
	uint16_t SeamlessTravelCount; // 0x578 (0x2)
	uint16_t LastCompletedSeamlessTravelCount; // 0x57a (0x2)
	unsigned char unreflected_57c[0x84]; // 0x57c (0x84) 
	class UInputComponent* InactiveStateInputComponent; // 0x600 (0x8)
	unsigned char bShouldPerformFullTickWhenPaused; // 0x608 (0x1)
	unsigned char unreflected_609[0x17]; // 0x609 (0x17) 
	class UTouchInterface* CurrentTouchInterface; // 0x620 (0x8)
	class UClass* OverridePlayerInputClass; // 0x628 (0x8)
	unsigned char unreflected_630[0x78]; // 0x630 (0x78) 
	class ASpectatorPawn* SpectatorPawn; // 0x6a8 (0x8)
	unsigned char unreflected_6b0[0x4]; // 0x6b0 (0x4) 
	bool bIsLocalPlayerController; // 0x6b4 (0x1)
	unsigned char unreflected_6b5[0x3]; // 0x6b5 (0x3) 
	struct FVector SpawnLocation; // 0x6b8 (0x18)
	unsigned char padding_6d0[0x178]; // 0x6d0 (0x178)

	/* Functions */

	// Function /Script/Engine.PlayerController.WasInputKeyJustReleased (Underlying native function: WasInputKeyJustReleased 0x9d4e43c)
	bool WasInputKeyJustReleased(struct FKey& Key); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/Engine.PlayerController.WasInputKeyJustPressed (Underlying native function: WasInputKeyJustPressed 0x9d4e358)
	bool WasInputKeyJustPressed(struct FKey& Key); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/Engine.PlayerController.ToggleSpeaking (Underlying native function: ToggleSpeaking 0x9d4e2d4)
	void ToggleSpeaking(bool& bInSpeaking); // (Exec | Native | Public)

	// Function /Script/Engine.PlayerController.TestServerLevelVisibilityChange (Underlying native function: TestServerLevelVisibilityChange 0x9d4e230)
