// ScriptStruct /Game/Characters/Player/Male/Male_Avg_Base/Fortnite_M_Avg_Player_AnimBlueprint.Fortnite_M_Avg_Player_AnimBlueprint_C.AnimBlueprintGeneratedConstantData
// Size: 0x418
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty2320; // 0x4 (0x4)
	struct FName NameProperty2321; // 0x8 (0x4)
	struct FName NameProperty2322; // 0xc (0x4)
	struct FName NameProperty2323; // 0x10 (0x4)
	struct FName NameProperty2324; // 0x14 (0x4)
	struct FName NameProperty2325; // 0x18 (0x4)
	struct FName NameProperty2326; // 0x1c (0x4)
	struct FName NameProperty2327; // 0x20 (0x4)
	struct FName NameProperty2328; // 0x24 (0x4)
	struct FName NameProperty2329; // 0x28 (0x4)
	struct FName NameProperty2330; // 0x2c (0x4)
	struct FName NameProperty2331; // 0x30 (0x4)
	struct FName NameProperty2332; // 0x34 (0x4)
	struct FName NameProperty2333; // 0x38 (0x4)
	struct FName NameProperty2334; // 0x3c (0x4)
	float FloatProperty2335; // 0x40 (0x4)
	struct FName NameProperty2336; // 0x44 (0x4)
	float FloatProperty2337; // 0x48 (0x4)
	struct FName NameProperty2338; // 0x4c (0x4)
	float FloatProperty2339; // 0x50 (0x4)
	struct FName NameProperty2340; // 0x54 (0x4)
	struct FName NameProperty2341; // 0x58 (0x4)
	struct FName NameProperty2342; // 0x5c (0x4)
	struct FName NameProperty2343; // 0x60 (0x4)
	float FloatProperty2344; // 0x64 (0x4)
	struct FName NameProperty2345; // 0x68 (0x4)
	unsigned char unreflected_6c[0x4]; // 0x6c (0x4) 
	struct TArray<float> ArrayProperty2346; // 0x70 (0x10)
	struct TArray<float> ArrayProperty2347; // 0x80 (0x10)
	struct TArray<int> ArrayProperty2348; // 0x90 (0x10)
	struct FName NameProperty2349; // 0xa0 (0x4)
	unsigned char unreflected_a4[0x4]; // 0xa4 (0x4) 
	struct TArray<int> ArrayProperty2350; // 0xa8 (0x10)
	struct TArray<int> ArrayProperty2351; // 0xb8 (0x10)
	struct TArray<float> ArrayProperty2352; // 0xc8 (0x10)
	struct TArray<int> ArrayProperty2353; // 0xd8 (0x10)
	struct TArray<float> ArrayProperty2354; // 0xe8 (0x10)
	struct TArray<int> ArrayProperty2355; // 0xf8 (0x10)
	struct TArray<float> ArrayProperty2356; // 0x108 (0x10)
	struct TArray<int> ArrayProperty2357; // 0x118 (0x10)
	struct FName NameProperty2358; // 0x128 (0x4)
	struct FName NameProperty2359; // 0x12c (0x4)
	struct FName NameProperty2360; // 0x130 (0x4)
	struct FName NameProperty2361; // 0x134 (0x4)
	struct FName NameProperty2362; // 0x138 (0x4)
	struct FName NameProperty2363; // 0x13c (0x4)
	struct FName NameProperty2364; // 0x140 (0x4)
	struct FName NameProperty2365; // 0x144 (0x4)
	struct FName NameProperty2366; // 0x148 (0x4)
	struct FName NameProperty2367; // 0x14c (0x4)
	struct FName NameProperty2368; // 0x150 (0x4)
	struct FName NameProperty2369; // 0x154 (0x4)
	struct FName NameProperty2370; // 0x158 (0x4)
	struct FName NameProperty2371; // 0x15c (0x4)
	struct FName NameProperty2372; // 0x160 (0x4)
	struct FName NameProperty2373; // 0x164 (0x4)
	struct TArray<float> ArrayProperty2374; // 0x168 (0x10)
	struct FName NameProperty2375; // 0x178 (0x4)
	struct FName NameProperty2376; // 0x17c (0x4)
	struct FName NameProperty2377; // 0x180 (0x4)
	struct FName NameProperty2378; // 0x184 (0x4)
	struct TArray<float> ArrayProperty2379; // 0x188 (0x10)
	struct FName NameProperty2380; // 0x198 (0x4)
	struct FName NameProperty2381; // 0x19c (0x4)
	struct FName NameProperty2382; // 0x1a0 (0x4)
	enum EBlendListTransitionType EnumProperty2383; // 0x1a4 (0x1)
	unsigned char unreflected_1a5[0x3]; // 0x1a5 (0x3) 
	struct TArray<float> ArrayProperty2384; // 0x1a8 (0x10)
	struct FName NameProperty2385; // 0x1b8 (0x4)
	enum EAlphaBlendOption EnumProperty2386; // 0x1bc (0x1)
	unsigned char unreflected_1bd[0x3]; // 0x1bd (0x3) 
	struct TArray<float> ArrayProperty2387; // 0x1c0 (0x10)
	struct TArray<int> ArrayProperty2388; // 0x1d0 (0x10)
	enum EAnimSyncMethod EnumProperty2389; // 0x1e0 (0x1)
	unsigned char unreflected_1e1[0x3]; // 0x1e1 (0x3) 
	struct FName NameProperty2390; // 0x1e4 (0x4)
	struct FName NameProperty2391; // 0x1e8 (0x4)
	struct TEnumAsByte<ERefPoseType> ByteProperty2392; // 0x1ec (0x1)
	unsigned char unreflected_1ed[0x3]; // 0x1ed (0x3) 
	struct FName NameProperty2393; // 0x1f0 (0x4)
	struct FName NameProperty2394; // 0x1f4 (0x4)
	struct FName NameProperty2395; // 0x1f8 (0x4)
	struct FName NameProperty2396; // 0x1fc (0x4)
	struct FName NameProperty2397; // 0x200 (0x4)
	unsigned char unreflected_204[0x4]; // 0x204 (0x4) 
	struct TArray<float> ArrayProperty2398; // 0x208 (0x10)
	struct FName NameProperty2399; // 0x218 (0x4)
	struct FName NameProperty2400; // 0x21c (0x4)
	struct FName NameProperty2401; // 0x220 (0x4)
	int IntProperty2402; // 0x224 (0x4)
	struct FName NameProperty2403; // 0x228 (0x4)
	int IntProperty2404; // 0x22c (0x4)
	struct TArray<int> ArrayProperty2405; // 0x230 (0x10)
	struct FName NameProperty2406; // 0x240 (0x4)
	int IntProperty2407; // 0x244 (0x4)
	struct FName NameProperty2408; // 0x248 (0x4)
	int IntProperty2409; // 0x24c (0x4)
	struct FName NameProperty2410; // 0x250 (0x4)
	int IntProperty2411; // 0x254 (0x4)
	bool BoolProperty2412; // 0x258 (0x1)
	unsigned char unreflected_259[0x3]; // 0x259 (0x3) 
	float FloatProperty2413; // 0x25c (0x4)
	struct FInputScaleBiasClampConstants StructProperty2414; // 0x260 (0x2c)
	float FloatProperty2415; // 0x28c (0x4)
	enum EAnimSyncMethod EnumProperty2416; // 0x290 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty2417; // 0x291 (0x1)
	unsigned char unreflected_292[0x2]; // 0x292 (0x2) 
	struct FName NameProperty2418; // 0x294 (0x4)
	int IntProperty2419; // 0x298 (0x4)
	struct FName NameProperty2420; // 0x29c (0x4)
	int IntProperty2421; // 0x2a0 (0x4)
	unsigned char unreflected_2a4[0x4]; // 0x2a4 (0x4) 
	struct TArray<float> ArrayProperty2422; // 0x2a8 (0x10)
	struct TArray<float> ArrayProperty2423; // 0x2b8 (0x10)
	struct FName NameProperty2424; // 0x2c8 (0x4)
	struct FName NameProperty2425; // 0x2cc (0x4)
	int IntProperty2426; // 0x2d0 (0x4)
	unsigned char unreflected_2d4[0x4]; // 0x2d4 (0x4) 
	class UBlendProfile* BlendProfile2427; // 0x2d8 (0x8)
	class UCurveFloat* CurveFloat2428; // 0x2e0 (0x8)
	bool BoolProperty2429; // 0x2e8 (0x1)
	enum EAlphaBlendOption EnumProperty2430; // 0x2e9 (0x1)
	enum EBlendListTransitionType EnumProperty2431; // 0x2ea (0x1)
	unsigned char unreflected_2eb[0x5]; // 0x2eb (0x5) 
	struct TArray<float> ArrayProperty2432; // 0x2f0 (0x10)
	struct FAnimNodeFunctionRef StructProperty2433; // 0x300 (0x18)
	struct FAnimSubsystem_Tag AnimBlueprintExtensionTag; // 0x318 (0x60)
	struct FAnimSubsystem* AnimBlueprintExtensionSharedLinkedAnimLayers; // 0x378 (0x8)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x380 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x400 (0x18)
};

