// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C.AnimBlueprintGeneratedMutableData
// Size: 0x29
struct FAnimBlueprintGeneratedMutableData : FAnimBlueprintMutableData
{
	bool BoolProperty; // 0x1 (0x1)
	bool BoolProperty0; // 0x2 (0x1)
	unsigned char unreflected_3[0x1]; // 0x3 (0x1) 
	float FloatProperty1; // 0x4 (0x4)
	float FloatProperty2; // 0x8 (0x4)
	float FloatProperty3; // 0xc (0x4)
	float FloatProperty4; // 0x10 (0x4)
	bool BoolProperty5; // 0x14 (0x1)
	bool BoolProperty6; // 0x15 (0x1)
	bool BoolProperty7; // 0x16 (0x1)
	bool BoolProperty8; // 0x17 (0x1)
	bool BoolProperty9; // 0x18 (0x1)
	bool BoolProperty10; // 0x19 (0x1)
	bool BoolProperty11; // 0x1a (0x1)
	bool BoolProperty12; // 0x1b (0x1)
	bool BoolProperty13; // 0x1c (0x1)
	bool BoolProperty14; // 0x1d (0x1)
	bool BoolProperty15; // 0x1e (0x1)
	bool BoolProperty16; // 0x1f (0x1)
	bool BoolProperty17; // 0x20 (0x1)
	bool BoolProperty18; // 0x21 (0x1)
	bool BoolProperty19; // 0x22 (0x1)
	bool BoolProperty20; // 0x23 (0x1)
	float FloatProperty21; // 0x24 (0x4)
	bool BoolProperty22; // 0x28 (0x1)
};

