// ScriptStruct /Game/Characters/Player/AnimationBlueprints/LinkedAnimGraphs/Player_TacticalState_AnimBP.Player_TacticalState_AnimBP_C.AnimBlueprintGeneratedConstantData
// Size: 0x1b8
struct FAnimBlueprintGeneratedConstantData : FAnimBlueprintConstantData
{
	unsigned char unreflected_1[0x3]; // 0x1 (0x3) 
	struct FName NameProperty984; // 0x4 (0x4)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty985; // 0x8 (0x1)
	unsigned char unreflected_9[0x3]; // 0x9 (0x3) 
	struct FName NameProperty986; // 0xc (0x4)
	int IntProperty987; // 0x10 (0x4)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty988; // 0x14 (0x1)
	unsigned char unreflected_15[0x3]; // 0x15 (0x3) 
	struct FName NameProperty989; // 0x18 (0x4)
	struct FName NameProperty990; // 0x1c (0x4)
	struct FName NameProperty991; // 0x20 (0x4)
	struct FName NameProperty992; // 0x24 (0x4)
	struct FName NameProperty993; // 0x28 (0x4)
	struct FName NameProperty994; // 0x2c (0x4)
	struct FName NameProperty995; // 0x30 (0x4)
	struct FName NameProperty996; // 0x34 (0x4)
	int IntProperty997; // 0x38 (0x4)
	struct FName NameProperty998; // 0x3c (0x4)
	int IntProperty999; // 0x40 (0x4)
	struct FName NameProperty1000; // 0x44 (0x4)
	int IntProperty1001; // 0x48 (0x4)
	struct FName NameProperty1002; // 0x4c (0x4)
	int IntProperty1003; // 0x50 (0x4)
	struct FName NameProperty1004; // 0x54 (0x4)
	struct FName NameProperty1005; // 0x58 (0x4)
	struct FName NameProperty1006; // 0x5c (0x4)
	struct FName NameProperty1007; // 0x60 (0x4)
	struct FName NameProperty1008; // 0x64 (0x4)
	int IntProperty1009; // 0x68 (0x4)
	struct FName NameProperty1010; // 0x6c (0x4)
	struct FName NameProperty1011; // 0x70 (0x4)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty1012; // 0x74 (0x1)
	unsigned char unreflected_75[0x3]; // 0x75 (0x3) 
	struct FName NameProperty1013; // 0x78 (0x4)
	struct FName NameProperty1014; // 0x7c (0x4)
	enum EAnimSyncMethod EnumProperty1015; // 0x80 (0x1)
	unsigned char unreflected_81[0x3]; // 0x81 (0x3) 
	struct FName NameProperty1016; // 0x84 (0x4)
	struct FName NameProperty1017; // 0x88 (0x4)
	int IntProperty1018; // 0x8c (0x4)
	struct FName NameProperty1019; // 0x90 (0x4)
	int IntProperty1020; // 0x94 (0x4)
	bool BoolProperty1021; // 0x98 (0x1)
	unsigned char unreflected_99[0x3]; // 0x99 (0x3) 
	float FloatProperty1022; // 0x9c (0x4)
	struct FInputScaleBiasClampConstants StructProperty1023; // 0xa0 (0x2c)
	float FloatProperty1024; // 0xcc (0x4)
	enum EAnimSyncMethod EnumProperty1025; // 0xd0 (0x1)
	struct TEnumAsByte<EAnimGroupRole> ByteProperty1026; // 0xd1 (0x1)
	unsigned char unreflected_d2[0x2]; // 0xd2 (0x2) 
	struct FName NameProperty1027; // 0xd4 (0x4)
	struct FName NameProperty1028; // 0xd8 (0x4)
	int IntProperty1029; // 0xdc (0x4)
	class UBlendProfile* BlendProfile1030; // 0xe0 (0x8)
	class UCurveFloat* CurveFloat1031; // 0xe8 (0x8)
	bool BoolProperty1032; // 0xf0 (0x1)
	enum EAlphaBlendOption EnumProperty1033; // 0xf1 (0x1)
	enum EBlendListTransitionType EnumProperty1034; // 0xf2 (0x1)
	unsigned char unreflected_f3[0x5]; // 0xf3 (0x5) 
	struct TArray<float> ArrayProperty1035; // 0xf8 (0x10)
	struct FAnimNodeFunctionRef StructProperty1036; // 0x108 (0x18)
	struct FAnimSubsystem_PropertyAccess AnimBlueprintExtensionPropertyAccess; // 0x120 (0x80)
	struct FAnimSubsystem_Base AnimBlueprintExtensionBase; // 0x1a0 (0x18)
};

