// ScriptStruct /Script/FortniteGame.FortPartyRepData
// Size: 0x728
struct FFortPartyRepData : FPartyRepData
{
	struct FString PrimaryGameSessionId; // 0x80 (0x10)
	unsigned char unreflected_90[0x30]; // 0x90 (0x30) 
	enum EFortPartyState PartyState; // 0xc0 (0x1)
	unsigned char unreflected_c1[0x37]; // 0xc1 (0x37) 
	bool LobbyConnectionStarted; // 0xf8 (0x1)
	unsigned char unreflected_f9[0x37]; // 0xf9 (0x37) 
	enum EMatchmakingCompleteResult MatchmakingResult; // 0x130 (0x1)
	unsigned char unreflected_131[0x37]; // 0x131 (0x37) 
	struct TEnumAsByte<EMatchmakingState> MatchmakingState; // 0x168 (0x1)
	unsigned char unreflected_169[0x37]; // 0x169 (0x37) 
	bool SessionIsCriticalMission; // 0x1a0 (0x1)
	unsigned char unreflected_1a1[0x37]; // 0x1a1 (0x37) 
	int ZoneTileIndex; // 0x1d8 (0x4)
	unsigned char unreflected_1dc[0x34]; // 0x1dc (0x34) 
	struct FString ZoneInstanceId; // 0x210 (0x10)
	unsigned char unreflected_220[0x30]; // 0x220 (0x30) 
	struct FString TheaterId; // 0x250 (0x10)
	unsigned char unreflected_260[0x30]; // 0x260 (0x30) 
	struct TArray<bool> TileStates; // 0x290 (0x10)
	unsigned char unreflected_2a0[0x30]; // 0x2a0 (0x30) 
	struct FFortPartyMatchmakingInfo PartyMatchmakingInfo; // 0x2d0 (0x50)
	unsigned char unreflected_320[0x30]; // 0x320 (0x30) 
	struct TArray<struct FFortCreativeDiscoverySurfaceRevision*> CreativeDiscoverySurfaceRevisions; // 0x350 (0x10)
	unsigned char unreflected_360[0x30]; // 0x360 (0x30) 
	struct FString CustomMatchKey; // 0x390 (0x10)
	unsigned char unreflected_3a0[0x30]; // 0x3a0 (0x30) 
	struct FPlaylistData PlaylistData; // 0x3d0 (0x58)
	unsigned char unreflected_428[0x30]; // 0x428 (0x30) 
	struct FOnlineLinkId CurrentGameMode; // 0x458 (0x18)
	unsigned char unreflected_470[0x30]; // 0x470 (0x30) 
	struct FDateTime* CreativePortalCountdownStartTime; // 0x4a0 (0x8)
	unsigned char unreflected_4a8[0x30]; // 0x4a8 (0x30) 
	struct FString ActivityName; // 0x4d8 (0x10)
	unsigned char unreflected_4e8[0x30]; // 0x4e8 (0x30) 
	enum EFortGameActivityType ActivityType; // 0x518 (0x1)
	unsigned char unreflected_519[0x37]; // 0x519 (0x37) 
	bool AllowJoinInProgress; // 0x550 (0x1)
	unsigned char unreflected_551[0x37]; // 0x551 (0x37) 
	struct FDateTime* LFGTime; // 0x588 (0x8)
	unsigned char unreflected_590[0x30]; // 0x590 (0x30) 
	bool AthenaSquadFill; // 0x5c0 (0x1)
	unsigned char unreflected_5c1[0x37]; // 0x5c1 (0x37) 
	bool AthenaPrivateMatch; // 0x5f8 (0x1)
	unsigned char unreflected_5f9[0x37]; // 0x5f9 (0x37) 
	bool PartyIsJoinedInProgress; // 0x630 (0x1)
	unsigned char unreflected_631[0x37]; // 0x631 (0x37) 
	struct FString GameSessionKey; // 0x668 (0x10)
	unsigned char unreflected_678[0x30]; // 0x678 (0x30) 
	struct TArray<struct FFortPartySquadAssignment> RawSquadAssignments; // 0x6a8 (0x10)
	unsigned char unreflected_6b8[0x30]; // 0x6b8 (0x30) 
	struct FString CurrentRegionId; // 0x6e8 (0x10)
	unsigned char padding_6f8[0x30]; // 0x6f8 (0x30)
};

