// ScriptStruct /Script/FortniteGame.FortPartyMemberRepData
// Size: 0xcf8
struct FFortPartyMemberRepData : FPartyMemberRepData
{
	struct FPartyMemberPackedState PackedState; // 0x268 (0x9)
	unsigned char unreflected_271[0x1b7]; // 0x271 (0x1b7) 
	struct FPartyMemberCampaignHero CampaignHero; // 0x428 (0x38)
	unsigned char unreflected_460[0x30]; // 0x460 (0x30) 
	struct FPartyMemberCampaignInfo CampaignInfo; // 0x490 (0x20)
	unsigned char unreflected_4b0[0x90]; // 0x4b0 (0x90) 
	struct FPartyMemberFrontendEmote FrontendEmote; // 0x540 (0x40)
	unsigned char unreflected_580[0x30]; // 0x580 (0x30) 
	unsigned char NumAthenaPlayersLeft; // 0x5b0 (0x1)
	unsigned char unreflected_5b1[0x37]; // 0x5b1 (0x37) 
	struct FDateTime* UtcTimeStartedMatchAthena; // 0x5e8 (0x8)
	unsigned char unreflected_5f0[0x30]; // 0x5f0 (0x30) 
	struct FPartyMemberLobbyState LobbyState; // 0x620 (0xc)
	unsigned char unreflected_62c[0x124]; // 0x62c (0x124) 
	struct FPartyMemberAssistedChallengeInfo AssistedChallengeInfo; // 0x750 (0x10)
	unsigned char unreflected_760[0x30]; // 0x760 (0x30) 
	class UFortFeatItemDefinition* FeatDefinition; // 0x790 (0x8)
	unsigned char unreflected_798[0x30]; // 0x798 (0x30) 
	struct FPartyMemberSquadAssignmentRequest MemberSquadAssignmentRequest; // 0x7c8 (0x40)
	unsigned char unreflected_808[0x30]; // 0x808 (0x30) 
	struct FPartyMemberFrontEndMapMarker FrontEndMapMarker; // 0x838 (0x18)
	unsigned char unreflected_850[0x30]; // 0x850 (0x30) 
	struct FPartyMemberCosmeticLoadout AthenaCosmeticLoadout; // 0x880 (0x168)
	unsigned char unreflected_9e8[0x30]; // 0x9e8 (0x30) 
	struct FPartyMemberVariantCache AthenaCosmeticLoadoutVariants; // 0xa18 (0x58)
	unsigned char unreflected_a70[0x30]; // 0xa70 (0x30) 
	struct TArray<struct FString> ArbitraryCustomDataStore; // 0xaa0 (0x10)
	unsigned char unreflected_ab0[0x30]; // 0xab0 (0x30) 
	struct FPartyMemberAthenaBannerInfo AthenaBannerInfo; // 0xae0 (0x28)
	unsigned char unreflected_b08[0x30]; // 0xb08 (0x30) 
	struct FPartyMemberBattlePassInfo BattlePassInfo; // 0xb38 (0x10)
	unsigned char unreflected_b48[0x30]; // 0xb48 (0x30) 
	struct FPartyMemberSharedQuestData SharedQuests; // 0xb78 (0x60)
	unsigned char unreflected_bd8[0x30]; // 0xbd8 (0x30) 
	float DownloadOnDemandProgress; // 0xc08 (0x4)
	unsigned char unreflected_c0c[0x34]; // 0xc0c (0x34) 
	bool bIsPartyUsingPartySignal; // 0xc40 (0x1)
	unsigned char unreflected_c41[0x37]; // 0xc41 (0x37) 
	struct FPartyMemberSpectateInfo SpectateInfo; // 0xc78 (0x20)
	unsigned char padding_c98[0x60]; // 0xc98 (0x60)
};

