// VerseStruct /CompanionAI/_Verse/VNI/CompanionAI.ping_info
// Size: 0x38
struct Fping_info
{
	enum command_type verse0x72E298E9Type; // 0x0 (0x1)
	enum entity_type verse0x6CF7C7E8EntityType; // 0x1 (0x1)
	unsigned char unreflected_2[0x6]; // 0x2 (0x6) 
	struct Fvector3 verse0xB0C27E0ALocation; // 0x8 (0x18)
	unsigned char verse0x0FA78E7ELocationOnHorizontalSurface; // 0x20 (0x1)
	unsigned char unreflected_21[0x7]; // 0x21 (0x7) 
	unsigned char verse0x459049A1Target_28[0x8]; // 0x28 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
	unsigned char verse0xFD64D7AAEmitter_30[0x8]; // 0x30 (0x8) (UNHANDLED PROPERTY TYPE: OptionProperty UID: 0)
};

