// Class /Script/FortniteUI.AthenaHUDContext
// Size: 0x488
class UAthenaHUDContext : public UBlueprintContextBase
{
	unsigned char unreflected_30[0x8]; // 0x30 (0x8) 
	struct FMulticastInlineDelegate OnLocalPlayerWon; // 0x38 (0x10)
	struct FMulticastInlineDelegate OnLocalPlayerDeathOnWin; // 0x48 (0x10)
	struct FMulticastInlineDelegate OnLocalTeamWon; // 0x58 (0x10)
	struct FMulticastInlineDelegate OnLocalTeamLost; // 0x68 (0x10)
	struct FMulticastInlineDelegate OnLocalPlayerLost; // 0x78 (0x10)
	struct FMulticastInlineDelegate OnLocalPlayerKilledPlayer; // 0x88 (0x10)
	struct FMulticastInlineDelegate OnLocalPlayerDBNOStateChanged; // 0x98 (0x10)
	struct FMulticastInlineDelegate OnPawnEmoteStopped; // 0xa8 (0x10)
	struct FMulticastInlineDelegate OnUIGameplayCue; // 0xb8 (0x10)
	struct FMulticastInlineDelegate OnLocalPlayerBeginSkydiving; // 0xc8 (0x10)
	struct FMulticastInlineDelegate OnAthenaAutoFireChanged; // 0xd8 (0x10)
	struct FMulticastInlineDelegate OnAthenaGamePhaseChanged; // 0xe8 (0x10)
	struct FMulticastInlineDelegate OnPlayerFiredWeapon; // 0xf8 (0x10)
	struct FMulticastInlineDelegate OnShowUrgentQuestMessage; // 0x108 (0x10)
	struct FMulticastInlineDelegate OnDuelChange; // 0x118 (0x10)
	struct FMulticastInlineDelegate OnLowPerformanceMode; // 0x128 (0x10)
	struct FMulticastInlineDelegate OnPTTStateChange; // 0x138 (0x10)
	struct FMulticastInlineDelegate OnCanPTTChange; // 0x148 (0x10)
	struct FMulticastInlineDelegate ShowMobilePickerDelegate; // 0x158 (0x10)
	struct FMulticastInlineDelegate OnPlayerNameChangeDelegate; // 0x168 (0x10)
	struct FMulticastInlineDelegate OnResurrectingNowDelegate; // 0x178 (0x10)
	struct FMulticastInlineDelegate OnAllWinnersAnnouncedDelegate; // 0x188 (0x10)
	struct FMulticastInlineDelegate OnSignalQualityChangeDelegate; // 0x198 (0x10)
	struct FMulticastInlineDelegate OnForwardStartedFalling; // 0x1a8 (0x10)
	struct FMulticastInlineDelegate OnSpecialActorListChanged; // 0x1b8 (0x10)
	unsigned char unreflected_1c8[0x18]; // 0x1c8 (0x18) 
	struct FMulticastInlineDelegate OnFireStopped; // 0x1e0 (0x10)
	struct FMulticastInlineDelegate OnPostGameWidgetPlacementChange; // 0x1f0 (0x10)
	struct FMulticastInlineDelegate OnForceStartPostGameFlow; // 0x200 (0x10)
	struct FMulticastInlineDelegate OnForceAllQuickbarsMinimizedChanged; // 0x210 (0x10)
	struct FMulticastInlineDelegate OnPlaylistExtensionWidgetCreatedNotSupported; // 0x220 (0x10)
	struct FMulticastInlineDelegate OnClearPlaylistExtensionWidgetNotSupported; // 0x230 (0x10)
	struct FMulticastInlineDelegate OnStartPostGameMenu; // 0x240 (0x10)
	struct FMulticastInlineDelegate OnRecoverFromPostGameMenu; // 0x250 (0x10)
	struct FMulticastInlineDelegate OnOverrideInventoryPanel; // 0x260 (0x10)
	unsigned char unreflected_270[0x1a0]; // 0x270 (0x1a0) 
	struct TWeakObjectPtr<class UWidget> MoveButtonWidgetPtr; // 0x410 (0x8)
	struct FAthenaWinnerInfo WinnerInfo; // 0x418 (0x20)
	unsigned char unreflected_438[0x1]; // 0x438 (0x1) 
	bool bMoveButtonMode; // 0x439 (0x1)
	bool bPendingAttachToHUD; // 0x43a (0x1)
	bool bLocalPlayerWonMatch; // 0x43b (0x1)
	struct TWeakObjectPtr<class AFortPlayerPawnAthena> BoundPlayerPawn; // 0x43c (0x8)
	unsigned char unreflected_444[0x4]; // 0x444 (0x4) 
	class UAthenaPlayerViewModel* PlayerViewModel; // 0x448 (0x8)
	unsigned char padding_450[0x38]; // 0x450 (0x38)

	/* Functions */

	// Function /Script/FortniteUI.AthenaHUDContext.VictoryStingerTimeUntilFadeOut (Underlying native function: VictoryStingerTimeUntilFadeOut 0xa4b5a34)
	float VictoryStingerTimeUntilFadeOut(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteUI.AthenaHUDContext.UseTapToShoot (Underlying native function: UseTapToShoot 0x8744110)
	bool UseTapToShoot(); // (Final | Native | Public | BlueprintCallable | BlueprintPure | Const)

	// Function /Script/FortniteUI.AthenaHUDContext.UseOrRleoadFromHUDStop (Underlying native function: UseOrRleoadFromHUDStop 0xa4b5a08)
	void UseOrRleoadFromHUDStop(); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteUI.AthenaHUDContext.UseOrRleoadFromHUDStart (Underlying native function: UseOrRleoadFromHUDStart 0xa4b59dc)
	void UseOrRleoadFromHUDStart(); // (Final | Native | Public | BlueprintCallable)

