// VerseClass /VerseUI/_Verse/VNI/VerseUI.Canvas
// Size: 0xc8
class UCanvas : public UWidget
{
	unsigned char unreflected_78[0x40]; // 0x78 (0x40) 
	struct TArray<struct Fcanvas_slot> verse0x5AE077E0Slots; // 0xb8 (0x10)
	unsigned char verse0xE10E3FA4L2fEpicGames2ecom2fTemporary2fUI2fcanvasNRAddWidgetLNpositionedcanvasslotR_88[0x10]; // 0x88 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0xDDD0DE92L2fEpicGames2ecom2fTemporary2fUI2fcanvasNRAddWidgetLNpositionedsizedcanvasslotR_98[0x10]; // 0x98 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char verse0x9F17D489L2fEpicGames2ecom2fTemporary2fUI2fcanvasNRAddWidgetLNcanvasslotR_78[0x10]; // 0x78 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char unreflected_88[0x20]; // 0x88 (0x20) 
	unsigned char verse0x421EABFDL2fEpicGames2ecom2fTemporary2fUI2fcanvasNRRemoveWidgetLNwidgetR_a8[0x10]; // 0xa8 (0x10) (UNHANDLED PROPERTY TYPE: VerseFunctionProperty UID: 0)
	unsigned char padding_b8[0x10]; // 0xb8 (0x10)

	/* Functions */

	// Function /VerseUI/_Verse/VNI/VerseUI.Canvas._L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RRemoveWidget_L_Nwidget_R (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RRemoveWidget_L_Nwidget_R 0x6cf9af8)
	void L2fEpicGames2ecom2fTemporary2fUI2fcanvasNRRemoveWidgetLNwidgetR(class UWidget*& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.Canvas._L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Ncanvas__slot_R (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Ncanvas__slot_R 0x6cf9ae0)
	void L2fEpicGames2ecom2fTemporary2fUI2fcanvasNRAddWidgetLNcanvasslotR(struct Fcanvas_slot& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.Canvas._L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Npositioned__sized__canvas__slot_R (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Npositioned__sized__canvas__slot_R 0x6cf9af0)
	void L2fEpicGames2ecom2fTemporary2fUI2fcanvasNRAddWidgetLNpositionedsizedcanvasslotR(struct Fpositioned_sized_canvas_slot& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.Canvas._L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Npositioned__canvas__slot_R (Underlying native function: _L_2fEpicGames_2ecom_2fTemporary_2fUI_2fcanvas_N_RAddWidget_L_Npositioned__canvas__slot_R 0x6cf9ae8)
	void L2fEpicGames2ecom2fTemporary2fUI2fcanvasNRAddWidgetLNpositionedcanvasslotR(struct Fpositioned_canvas_slot& verse0xB2CDDD72Argument); // (Native | Public | BlueprintCallable)

	// Function /VerseUI/_Verse/VNI/VerseUI.Canvas.$InitInstance (Has no native function)
	void $InitInstance(); // ()

	// Function /VerseUI/_Verse/VNI/VerseUI.Canvas.$Block (Has no native function)
	void $Block(); // ()

	// Function /VerseUI/_Verse/VNI/VerseUI.Canvas.$InitCDO (Has no native function)
	void $InitCDO(struct TArray<struct Fcanvas_slot>& $ExprResult0, struct TArray<enum EVerseFalse>& verse0xFFC68BC5Array1, struct TArray<struct Fcanvas_slot>& $ForResult1, int64_t& $ForIndex2, int64_t& $ForLength3, enum EVerseFalse& verse0xFB88B569Item3, unsigned char& $ExprResult4); // (HasDefaults)
};

