// Class /Script/FortniteGame.FortPlayerAnimInstance_ATVDriver
// Size: 0x1d80
class UFortPlayerAnimInstance_ATVDriver : public UFortPlayerAnimInstance
{
	struct FFortAnimInput_Quad QuadBikeInput; // 0x1a98 (0x80)
	struct FFortAnimInput_VelocityImpact VelocityImpact; // 0x1b18 (0xf0)
	struct FVector ImpactDisplacement; // 0x1c08 (0x18)
	float AbsSteerAngle; // 0x1c20 (0x4)
	unsigned char unreflected_1c24[0x4]; // 0x1c24 (0x4) 
	bool bInAir; // 0x1c28 (0x1)
	bool bIsInRollAngleThreshold; // 0x1c29 (0x1)
	bool bIsDriveStarting; // 0x1c2a (0x1)
	unsigned char unreflected_1c2b[0x5]; // 0x1c2b (0x5) 
	struct FVector LocalLeftOffset; // 0x1c30 (0x18)
	struct FVector WorldPosLeft; // 0x1c48 (0x18)
	struct FRotator LocalRotLeftOffset; // 0x1c60 (0x18)
	struct FRotator WorldRotLeft; // 0x1c78 (0x18)
	struct FVector LocalRightOffset; // 0x1c90 (0x18)
	struct FVector WorldPosRight; // 0x1ca8 (0x18)
	struct FRotator LocalRotRightOffset; // 0x1cc0 (0x18)
	struct FRotator WorldRotRight; // 0x1cd8 (0x18)
	bool bIsSteeringRotating; // 0x1cf0 (0x1)
	bool bIsStopped; // 0x1cf1 (0x1)
	bool bIsSlowingDown; // 0x1cf2 (0x1)
	bool bIsDrivingFast; // 0x1cf3 (0x1)
	bool bIsTurningRightHard; // 0x1cf4 (0x1)
	bool bIsTurningLeftHard; // 0x1cf5 (0x1)
	bool bIsBraking; // 0x1cf6 (0x1)
	unsigned char unreflected_1cf7[0x1]; // 0x1cf7 (0x1) 
	bool bIsBoosting; // 0x1cf8 (0x1)
	bool bIsJumpTrick; // 0x1cf9 (0x1)
	unsigned char unreflected_1cfa[0x2]; // 0x1cfa (0x2) 
	float JumpPlayRate; // 0x1cfc (0x4)
	bool bIsJumpFlipping; // 0x1d00 (0x1)
	bool bShouldEnableAO; // 0x1d01 (0x1)
	bool bIsBodyDragging; // 0x1d02 (0x1)
	unsigned char unreflected_1d03[0x1]; // 0x1d03 (0x1) 
	float FallDistanceJumpingThreshold; // 0x1d04 (0x4)
	float FallDistanceJumpTrickThreshold; // 0x1d08 (0x4)
	float RollAngleThreshold; // 0x1d0c (0x4)
	float StartSpeedThreshold; // 0x1d10 (0x4)
	float SlowingSpeedThreshold; // 0x1d14 (0x4)
	float FastSpeedThreshold; // 0x1d18 (0x4)
	float BrakingDeltaThreshold; // 0x1d1c (0x4)
	float SteerHardAngleThreshold; // 0x1d20 (0x4)
	float GroundTraceUpOffset; // 0x1d24 (0x4)
	float GroundTraceLength; // 0x1d28 (0x4)
	unsigned char unreflected_1d2c[0x4]; // 0x1d2c (0x4) 
	struct FVector2D JumpPlayRateInRange; // 0x1d30 (0x10)
	struct FVector2D JumpPlayRateOutRange; // 0x1d40 (0x10)
	bool bIsJumpingAndNotRolling; // 0x1d50 (0x1)
	bool bIsOnGroundAndNotRolling; // 0x1d51 (0x1)
	bool bIsOnGroundAndBoosting; // 0x1d52 (0x1)
	bool bPlayPivotOnGroundAndNotBoosting; // 0x1d53 (0x1)
	unsigned char unreflected_1d54[0x4]; // 0x1d54 (0x4) 
	struct FVector2D LandStartPosInRange; // 0x1d58 (0x10)
	struct FVector2D LandStartPosOutRange; // 0x1d68 (0x10)
	float LandStartPosition; // 0x1d78 (0x4)
	unsigned char padding_1d7c[0x4]; // 0x1d7c (0x4)

	/* Functions */

	// Function /Script/FortniteGame.FortPlayerAnimInstance_ATVDriver.AnimNotify_JumpEntered (Underlying native function: AnimNotify_JumpEntered 0x7f75a38)
	void AnimNotifyJumpEntered(); // (Final | Native | Public)
};

