// Class /Script/FortniteGame.FortPlayerAnimInstance_OstrichDriver
// Size: 0x1ba0
class UFortPlayerAnimInstance_OstrichDriver : public UFortPlayerAnimInstance_OstrichOccupant
{
	float BouncePlayRateValue; // 0x1b88 (0x4)
	float LegsBounceAlphaValue; // 0x1b8c (0x4)
	float LegsBounceAlphaWhenSkytubing; // 0x1b90 (0x4)
	float LegsBounceAlphaNoSkytubing; // 0x1b94 (0x4)
	float LegsBounceAlphaInterpSpeed; // 0x1b98 (0x4)
	unsigned char bIsSkyTubing; // 0x1b9c (0x1)
	unsigned char bIsMechMoving2D; // 0x1b9c (0x1)
	unsigned char padding_1b9d[0x3]; // 0x1b9d (0x3)
};

