// Class /Script/FortniteGame.FortPlayerAnimInstance_FerretDriver
// Size: 0x1e90
class UFortPlayerAnimInstance_FerretDriver : public UFortPlayerAnimInstance
{
	struct FFortAnimInput_FerretVehicle FerretVehicleInput; // 0x1a98 (0xb8)
	struct FFortAnimInput_VelocityImpact VelocityImpact; // 0x1b50 (0xf0)
	struct FVector ImpactDisplacement; // 0x1c40 (0x18)
	float AbsSteerAngle; // 0x1c58 (0x4)
	unsigned char unreflected_1c5c[0x4]; // 0x1c5c (0x4) 
	unsigned char bInAir; // 0x1c60 (0x1)
	unsigned char bOnGround; // 0x1c60 (0x1)
	unsigned char bIsInRollAngleThreshold; // 0x1c60 (0x1)
	unsigned char bIsDriveStarting; // 0x1c60 (0x1)
	unsigned char unreflected_1c61[0x7]; // 0x1c61 (0x7) 
	struct FVector LocalLeftOffset; // 0x1c68 (0x18)
	struct FVector WorldPosLeft; // 0x1c80 (0x18)
	struct FRotator LocalRotLeftOffset; // 0x1c98 (0x18)
	struct FRotator WorldRotLeft; // 0x1cb0 (0x18)
	struct FVector LocalRightOffset; // 0x1cc8 (0x18)
	struct FVector WorldPosRight; // 0x1ce0 (0x18)
	struct FRotator LocalRotRightOffset; // 0x1cf8 (0x18)
	struct FRotator WorldRotRight; // 0x1d10 (0x18)
	unsigned char bIsSteeringRotating; // 0x1d28 (0x1)
	unsigned char bIsStopped; // 0x1d28 (0x1)
	unsigned char bIsSlowingDown; // 0x1d28 (0x1)
	unsigned char bIsDrivingFast; // 0x1d28 (0x1)
	unsigned char bIsTurningRightHard; // 0x1d28 (0x1)
	unsigned char bIsTurningLeftHard; // 0x1d28 (0x1)
	unsigned char bIsBraking; // 0x1d28 (0x1)
	unsigned char bIsBoosting; // 0x1d29 (0x1)
	unsigned char bIsJumpTrick; // 0x1d29 (0x1)
	unsigned char unreflected_1d2a[0x2]; // 0x1d2a (0x2) 
	float JumpPlayRate; // 0x1d2c (0x4)
	unsigned char bIsJumpFlipping; // 0x1d30 (0x1)
	unsigned char bShouldEnableAO; // 0x1d30 (0x1)
	unsigned char bIsBodyDragging; // 0x1d30 (0x1)
	unsigned char unreflected_1d31[0x3]; // 0x1d31 (0x3) 
	float FallDistanceJumpingThreshold; // 0x1d34 (0x4)
	float FallDistanceJumpTrickThreshold; // 0x1d38 (0x4)
	float RollAngleThreshold; // 0x1d3c (0x4)
	float StartSpeedThreshold; // 0x1d40 (0x4)
	float SlowingSpeedThreshold; // 0x1d44 (0x4)
	float FastSpeedThreshold; // 0x1d48 (0x4)
	float BrakingDeltaThreshold; // 0x1d4c (0x4)
	float SteerHardAngleThreshold; // 0x1d50 (0x4)
	float GroundTraceUpOffset; // 0x1d54 (0x4)
	float GroundTraceLength; // 0x1d58 (0x4)
	unsigned char unreflected_1d5c[0x4]; // 0x1d5c (0x4) 
	struct FVector2D JumpPlayRateInRange; // 0x1d60 (0x10)
	struct FVector2D JumpPlayRateOutRange; // 0x1d70 (0x10)
	unsigned char bIsJumpingAndNotRolling; // 0x1d80 (0x1)
	unsigned char bIsOnGroundAndNotRolling; // 0x1d80 (0x1)
	unsigned char bIsOnGroundAndBoosting; // 0x1d80 (0x1)
	unsigned char bPlayPivotOnGroundAndNotBoosting; // 0x1d80 (0x1)
	unsigned char unreflected_1d81[0x7]; // 0x1d81 (0x7) 
	struct FVector2D LandStartPosInRange; // 0x1d88 (0x10)
	struct FVector2D LandStartPosOutRange; // 0x1d98 (0x10)
	float LandStartPosition; // 0x1da8 (0x4)
	float DriverAimPitch; // 0x1dac (0x4)
	float DriverAimYaw; // 0x1db0 (0x4)
	enum EPlaneDirection FerretCardinalDirection; // 0x1db4 (0x1)
	unsigned char unreflected_1db5[0x3]; // 0x1db5 (0x3) 
	float ElevatorDeadZone; // 0x1db8 (0x4)
	float RudderDeadZone; // 0x1dbc (0x4)
	unsigned char bFerretShouldPlayStartTransition; // 0x1dc0 (0x1)
	unsigned char bFerretShouldPlayStopTransition; // 0x1dc0 (0x1)
	enum EPlaneDirection FerretStopCardinalDirection; // 0x1dc1 (0x1)
	enum EPlaneDirection FerretPrePivotCardinalDirection; // 0x1dc2 (0x1)
	unsigned char bFerretShouldPlayPivotTransition; // 0x1dc3 (0x1)
	unsigned char bIsFerretRotating; // 0x1dc3 (0x1)
	unsigned char bIsFerretShooting; // 0x1dc3 (0x1)
	float ElevatorRotation; // 0x1dc4 (0x4)
	unsigned char bIsRollingRight; // 0x1dc8 (0x1)
	unsigned char bIsRollingLeft; // 0x1dc8 (0x1)
	unsigned char unreflected_1dc9[0x7]; // 0x1dc9 (0x7) 
	struct FVector LeftHandLocalTranslateOffset; // 0x1dd0 (0x18)
	struct FVector RightHandLocalTranslateOffset; // 0x1de8 (0x18)
	struct FRotator LeftHandLocalRotateOffset; // 0x1e00 (0x18)
	struct FRotator RightHandLocalRotateOffset; // 0x1e18 (0x18)
	struct FVector LeftHandComponentTranslateOffset; // 0x1e30 (0x18)
	struct FVector RightHandComponentTranslateOffset; // 0x1e48 (0x18)
	struct FRotator LeftHandComponentRotateOffset; // 0x1e60 (0x18)
	struct FRotator RightHandComponentRotateOffset; // 0x1e78 (0x18)

	/* Functions */

	// Function /Script/FortniteGame.FortPlayerAnimInstance_FerretDriver.AnimNotify_JumpEntered (Underlying native function: AnimNotify_JumpEntered 0x7f95f9c)
	void AnimNotifyJumpEntered(); // (Final | Native | Public)
};

