// Class /Script/FortniteUI.FortGlobalUIContext
// Size: 0x568
class UFortGlobalUIContext : public UFortLocalPlayerSubsystem
{
	unsigned char unreflected_30[0x20]; // 0x30 (0x20) 
	struct FMulticastInlineDelegate SubGameChanged; // 0x50 (0x10)
	unsigned char unreflected_60[0x40]; // 0x60 (0x40) 
	bool bShouldSubgameSelectStartOnCampaignUpsell; // 0xa0 (0x1)
	unsigned char unreflected_a1[0x7]; // 0xa1 (0x7) 
	struct FMulticastInlineDelegate OnKeybindsChanged; // 0xa8 (0x10)
	struct FMulticastInlineDelegate OnInputActionHoldStarted; // 0xb8 (0x10)
	struct FMulticastInlineDelegate OnInputActionHoldStopped; // 0xc8 (0x10)
	struct FMulticastInlineDelegate OnRefreshHUDForRespawn; // 0xd8 (0x10)
	struct FMulticastInlineDelegate OnEnterVehicleDriver; // 0xe8 (0x10)
	struct FMulticastInlineDelegate OnEnterVehiclePassenger; // 0xf8 (0x10)
	struct FMulticastInlineDelegate OnExitVehicle; // 0x108 (0x10)
	struct FMulticastInlineDelegate OnVehicleSeatChanged; // 0x118 (0x10)
	unsigned char unreflected_128[0x30]; // 0x128 (0x30) 
	struct FMulticastInlineDelegate OnScoreReportChanged; // 0x158 (0x10)
	unsigned char unreflected_168[0x60]; // 0x168 (0x60) 
	struct FMulticastInlineDelegate OnLoadingScreenVisibilityChanged; // 0x1c8 (0x10)
	struct FMulticastInlineDelegate OnLocalPlayerControllerConnectionChanged; // 0x1d8 (0x10)
	unsigned char unreflected_1e8[0x18]; // 0x1e8 (0x18) 
	struct TMap<struct FName, class UFortUIMessageManager*> MessageManagersByName; // 0x200 (0x50)
	struct TMap<enum EFortUIFeature, struct FFortUIFeatureStruct> Features; // 0x250 (0x50)
	unsigned char unreflected_2a0[0x140]; // 0x2a0 (0x140) 
	class UAthenaMatchReadyDesktopPopup* AthenaMatchReadyNotificationWidget; // 0x3e0 (0x8)
	unsigned char unreflected_3e8[0x10]; // 0x3e8 (0x10) 
	class UFortHelpItem* ActiveContextSpecificHelpItem; // 0x3f8 (0x8)
	bool bIsUIVisible; // 0x400 (0x1)
	bool bShowRateWidget; // 0x401 (0x1)
	unsigned char unreflected_402[0x6]; // 0x402 (0x6) 
	struct TMap<enum ESubGame, bool> IsAllContentInstalledCacheMap; // 0x408 (0x50)
	struct FText FeedbackTitle; // 0x458 (0x18)
	struct FDateTime* FirstLoginTime; // 0x470 (0x8)
	struct FTimerHandle* AddictionMsgTimer; // 0x478 (0x8)
	struct FUniqueNetIdRepl CurrentLocalPlayerUniqueNetId; // 0x480 (0x30)
	unsigned char unreflected_4b0[0x14]; // 0x4b0 (0x14) 
	bool bQuestMapTabRequested; // 0x4c4 (0x1)
	unsigned char unreflected_4c5[0x3]; // 0x4c5 (0x3) 
	struct FGameplayTag QuestMapChallengeTabRequested; // 0x4c8 (0x4)
	unsigned char padding_4cc[0x9c]; // 0x4cc (0x9c)

	/* Functions */

	// Function /Script/FortniteUI.FortGlobalUIContext.UnregisterScriptedActions (Underlying native function: UnregisterScriptedActions 0xa4d7bd8)
	void UnregisterScriptedActions(struct TArray<class UClass*>& ScriptedActions); // (Final | 0x00000002 | Native | Public | HasOutParms | BlueprintCallable)

	// Function /Script/FortniteUI.FortGlobalUIContext.UnregisterScriptedAction (Underlying native function: UnregisterScriptedAction 0xa4d7b1c)
	void UnregisterScriptedAction(class UClass*& ScriptedAction); // (Final | 0x00000002 | Native | Public | HasOutParms | BlueprintCallable)

	// Function /Script/FortniteUI.FortGlobalUIContext.UnregisterInputAction (Underlying native function: UnregisterInputAction 0xa4d7a14)
	void UnregisterInputAction(class UUserWidget*& UserWidget, struct FDataTableRowHandle& InputActionRow); // (Final | Native | Public | BlueprintCallable)

