// Class /Script/FortniteGame.FortMcpContext
// Size: 0x460
class UFortMcpContext : public UBlueprintContextBase
{
	unsigned char unreflected_30[0x8]; // 0x30 (0x8) 
	struct FMulticastInlineDelegate OnHeroesChanged; // 0x38 (0x10)
	struct FMulticastInlineDelegate OnGiftBoxRemovedDelegate; // 0x48 (0x10)
	struct FMulticastInlineDelegate OnXpBoostChanged; // 0x58 (0x10)
	struct FMulticastInlineDelegate OnFounderGranted; // 0x68 (0x10)
	struct FMulticastInlineDelegate OnDailyRewardTokenGranted; // 0x78 (0x10)
	unsigned char unreflected_88[0x18]; // 0x88 (0x18) 
	struct FMulticastInlineDelegate OnPhoenixXpChanged; // 0xa0 (0x10)
	struct FMulticastInlineDelegate OnLocalAccountInfoChanged; // 0xb0 (0x10)
	struct FMulticastInlineDelegate OnCurrentlyViewedAccountInfoChanged; // 0xc0 (0x10)
	struct FMcpPrivacySettings PrivacySettings; // 0xd0 (0x2)
	unsigned char unreflected_d2[0x6]; // 0xd2 (0x6) 
	struct FMulticastInlineDelegate OnMissionRewardsOpened; // 0xd8 (0x10)
	struct FMulticastInlineDelegate OnMissionRewardsOpenFailed; // 0xe8 (0x10)
	struct FMulticastInlineDelegate OnMissionAlertRewardsOpened; // 0xf8 (0x10)
	struct FMulticastInlineDelegate OnDifficultyIncreaseRewardsClaimed; // 0x108 (0x10)
	struct FMulticastInlineDelegate OnDifficultyIncreaseRewardsClaimFailed; // 0x118 (0x10)
	struct FMulticastInlineDelegate OnItemCacheRewardsClaimed; // 0x128 (0x10)
	struct FMulticastInlineDelegate OnItemCacheRewardsClaimFailed; // 0x138 (0x10)
	struct FMulticastInlineDelegate OnResourceCollectorClaimed; // 0x148 (0x10)
	struct FMulticastInlineDelegate OnConversionBegin; // 0x158 (0x10)
	struct FMulticastInlineDelegate OnConversionComplete; // 0x168 (0x10)
	struct FMulticastInlineDelegate OnRarityUpgradeBegin; // 0x178 (0x10)
	struct FMulticastInlineDelegate OnRarityUpgradeComplete; // 0x188 (0x10)
	struct FMulticastInlineDelegate OnPromotionComplete; // 0x198 (0x10)
	struct FMulticastInlineDelegate OnTransmogComplete; // 0x1a8 (0x10)
	struct FMulticastInlineDelegate OnTransmogFailed; // 0x1b8 (0x10)
	struct FMulticastInlineDelegate OnRefundBegin; // 0x1c8 (0x10)
	struct FMulticastInlineDelegate OnRefundComplete; // 0x1d8 (0x10)
	struct FMulticastInlineDelegate OnLiveStreamingQuestWindowStarts; // 0x1e8 (0x10)
	struct FMulticastInlineDelegate OnLiveStreamingQuestWindowEnds; // 0x1f8 (0x10)
	struct FMulticastInlineDelegate OnLiveStreamingQuestWindowSelectedViewers; // 0x208 (0x10)
	struct FMulticastInlineDelegate OnOfferPurchaseComplete; // 0x218 (0x10)
	struct FMulticastInlineDelegate OnRealMoneyPurchaseComplete; // 0x228 (0x10)
	unsigned char unreflected_238[0x88]; // 0x238 (0x88) 
	struct TArray<struct FFriendCode> CachedFriendCodes; // 0x2c0 (0x10)
	struct TArray<struct FDelegate> PendingFriendCodeOnCompleteDelegates; // 0x2d0 (0x10)
	unsigned char unreflected_2e0[0x10]; // 0x2e0 (0x10) 
	double MinTimeBetweenFriendCodeRequestsSeconds; // 0x2f0 (0x8)
	struct FText FriendCodeMessageBody; // 0x2f8 (0x18)
	struct TArray<struct FString> EUCountryCodes; // 0x310 (0x10)
	unsigned char unreflected_320[0x68]; // 0x320 (0x68) 
	struct TArray<class UFortGiftBoxItem*> RequestedGiftBoxesToDisplay; // 0x388 (0x10)
	unsigned char unreflected_398[0x70]; // 0x398 (0x70) 
	struct FDelegate DisplayPurchaseWidget; // 0x408 (0xc)
	struct FDelegate DismissPurchaseWidget; // 0x414 (0xc)
	struct FDelegate DisplayLoginWidget; // 0x420 (0xc)
	struct FDelegate DismissLoginWidget; // 0x42c (0xc)
	struct FDelegate DisplayAccountCreationWidget; // 0x438 (0xc)
	struct FDelegate DismissAccountCreationWidget; // 0x444 (0xc)
	unsigned char padding_450[0x10]; // 0x450 (0x10)

	/* Functions */

	// Function /Script/FortniteGame.FortMcpContext.UpgradeItemRarity (Underlying native function: UpgradeItemRarity 0x8a1c18c)
	void UpgradeItemRarity(class UFortItem*& ItemToUpgrade); // (Final | Native | Public | BlueprintCallable)

	// Function /Script/FortniteGame.FortMcpContext.UpdatePrivacySettings (Underlying native function: UpdatePrivacySettings 0x8a1be70)
	void UpdatePrivacySettings(struct FMcpPrivacySettings& NewSettings, struct FDelegate& OnComplete); // (Final | 0x00000002 | Native | Public | HasOutParms | BlueprintCallable)

	// Function /Script/FortniteGame.FortMcpContext.TransmogItem (Underlying native function: TransmogItem 0x8a1bd8c)
	void TransmogItem(class UFortConversionControlItemDefinition*& ControlKeyItem, struct TArray<class UFortItem*>& ItemsToSacrifice); // (Final | Native | Public | HasOutParms | BlueprintCallable)

