// Class /Script/FortniteGame.FortPlayerAnimInstance_ShoppingCartDriver
// Size: 0x1c10
class UFortPlayerAnimInstance_ShoppingCartDriver : public UFortPlayerAnimInstance
{
	struct FFortAnimInput_ShoppingCart ShoppingCartInput; // 0x1a98 (0x5c)
	unsigned char unreflected_1af4[0x4]; // 0x1af4 (0x4) 
	struct FFortAnimInput_VelocityImpact VelocityImpact; // 0x1af8 (0xf0)
	struct FVector ImpactDisplacement; // 0x1be8 (0x18)
	bool bIsInAirFarFromGround; // 0x1c00 (0x1)
	bool bForwardVelocityGT400; // 0x1c01 (0x1)
	bool bForwardSpeedKmHLT5; // 0x1c02 (0x1)
	unsigned char padding_1c03[0xd]; // 0x1c03 (0xd)
};

