// Class /Script/FortniteGame.FortPlaylistAthena
// Size: 0xde0
class UFortPlaylistAthena : public UFortPlaylist
{
	bool bRewardsTrackPlacement; // 0x410 (0x1)
	bool bRewardsAllowXPProgression; // 0x411 (0x1)
	bool bRewardForRevivingTeammates; // 0x412 (0x1)
	enum ERewardPlacementBonusType RewardPlacementBonusType; // 0x413 (0x1)
	int RewardsPlacementThreshold; // 0x414 (0x4)
	enum ERewardTimePlayedType RewardTimePlayedType; // 0x418 (0x1)
	unsigned char unreflected_419[0x3]; // 0x419 (0x3) 
	int RewardTimePlayedXPPerMinute; // 0x41c (0x4)
	int RewardTimePlayedXPFlatValue; // 0x420 (0x4)
	unsigned char unreflected_424[0x4]; // 0x424 (0x4) 
	struct FScalableFloat InMatchXPRewardScalar; // 0x428 (0x28)
	struct TWeakObjectPtr<class UDataTable> QuestEventXPTableOverride; // 0x450 (0x28)
	struct TArray<struct TWeakObjectPtr<class UFortItemDefinition>> FirstWinRewards; // 0x478 (0x10)
	struct TArray<struct FString> CalendarEventsForEndOfMatchUpdate; // 0x488 (0x10)
	bool bAllowSinglePartyMatches; // 0x498 (0x1)
	bool bRequeueAfterFailedSessionAssignment; // 0x499 (0x1)
	bool bIsTournament; // 0x49a (0x1)
	bool bUseMultidivisionQueues; // 0x49b (0x1)
	int CompetitivePointClamp; // 0x49c (0x4)
	struct FString Strategy; // 0x4a0 (0x10)
	struct FName BotVersionPlaylistName; // 0x4b0 (0x4)
	int MaxBucketCapacity; // 0x4b4 (0x4)
	int MaxPendingMatches; // 0x4b8 (0x4)
	unsigned char unreflected_4bc[0x4]; // 0x4bc (0x4) 
	struct TArray<struct FRatingExpansion*> PriorityRatingExpansion; // 0x4c0 (0x10)
	struct TArray<struct FBracketDefinition*> BracketDefinitions; // 0x4d0 (0x10)
	bool bUseInputRules; // 0x4e0 (0x1)
	bool bAllowBackfill; // 0x4e1 (0x1)
	unsigned char unreflected_4e2[0x2]; // 0x4e2 (0x2) 
	int MinBackfillMatchPlayers; // 0x4e4 (0x4)
	int MaxTeamScoreAllowedForBackfill; // 0x4e8 (0x4)
	int MinPlayersForPrivateServer; // 0x4ec (0x4)
	float MaxTeamScoreDiscrepancyPercent; // 0x4f0 (0x4)
	bool bUsePlayerRating; // 0x4f4 (0x1)
	bool bEnableRatingUpdate; // 0x4f5 (0x1)
	bool bEnableDynamicBotBackfill; // 0x4f6 (0x1)
	unsigned char unreflected_4f7[0x1]; // 0x4f7 (0x1) 
	struct FString RatingType; // 0x4f8 (0x10)
	bool bRequireCrossplayEnabled; // 0x508 (0x1)
	bool bLimitedPoolMatchmakingEnabled; // 0x509 (0x1)
	bool bAllowedInLeto; // 0x50a (0x1)
	unsigned char unreflected_50b[0x1]; // 0x50b (0x1) 
	int LastQueuedPlaylistPriority; // 0x50c (0x4)
	bool bAllowInGameMatchMaking; // 0x510 (0x1)
	bool bAllowReturnToMatchmakingOriginOnMatchEnd; // 0x511 (0x1)
	bool bAllowBotsInHumanTeams; // 0x512 (0x1)
	bool bForceNewPlayerStateOnReconnect; // 0x513 (0x1)
	bool bShouldErrorOnAdditionalContentFailure; // 0x514 (0x1)
	bool bRemoveFromSquadOnLogout; // 0x515 (0x1)
	unsigned char unreflected_516[0x2]; // 0x516 (0x2) 
	int DADTestValue; // 0x518 (0x4)
	unsigned char unreflected_51c[0x4]; // 0x51c (0x4) 
	struct FString RequiredEntitlementToken; // 0x520 (0x10)
	float DelayForPreServerTransitionAnimation; // 0x530 (0x4)
	enum EAthenaWinCondition WinConditionType; // 0x534 (0x1)
	unsigned char unreflected_535[0x3]; // 0x535 (0x3) 
	struct FScalableFloat TimedWinConditionTime; // 0x538 (0x28)
	struct FScalableFloat FinalWinConditionTime; // 0x560 (0x28)
	struct FWinConditionScoreData ScoringData; // 0x588 (0x60)
	struct FScalableFloat TimedSafeZonePhaseTime; // 0x5e8 (0x28)
	int WinConditionPlayersRemaining; // 0x610 (0x4)
	unsigned char unreflected_614[0x4]; // 0x614 (0x4) 
	struct FScalableFloat NumWinningTeamsCN; // 0x618 (0x28)
	bool bIsLargeTeamGame; // 0x640 (0x1)
	bool bShouldSpreadTeams; // 0x641 (0x1)
	bool bIgnoreDefaultQuests; // 0x642 (0x1)
	bool bDisallowMultipleWeaponsOfType; // 0x643 (0x1)
	bool bAllowEditingEnemyWalls; // 0x644 (0x1)
	unsigned char unreflected_645[0x3]; // 0x645 (0x3) 
	int LootDropRounds; // 0x648 (0x4)
	float ForceKickAfterDeathTime; // 0x64c (0x4)
	enum EForceKickAfterDeathMode ForceKickAfterDeathMode; // 0x650 (0x1)
	enum EWeaponSelectionPreservationType QuickbarSelectionPreservationMode; // 0x651 (0x1)
	unsigned char unreflected_652[0x6]; // 0x652 (0x6) 
	struct FGameplayTagContainer AlwaysAllowedNativeActions; // 0x658 (0x20)
	struct FScalableFloat PawnForcedCullDistance; // 0x678 (0x28)
	struct FScalableFloat TransientMatchStartBonusCurrency; // 0x6a0 (0x28)
	struct TArray<struct FItemAndCount> InventoryItemsToGrant; // 0x6c8 (0x10)
	bool bIgnoreGameModeStartingInventory; // 0x6d8 (0x1)
	unsigned char unreflected_6d9[0x7]; // 0x6d9 (0x7) 
	struct FGameplayTagContainer MatchingQuestTags; // 0x6e0 (0x20)
	bool bRequirePickaxeInStartingInventory; // 0x700 (0x1)
	unsigned char unreflected_701[0x3]; // 0x701 (0x3) 
	float DestructedBuildingInGridTimeout; // 0x704 (0x4)
	bool bTeamFilterDestructedBuildingsInGrid; // 0x708 (0x1)
	bool bOwnerFilterDestructedBuildingsInGrid; // 0x709 (0x1)
	bool bEnableBuildingCreatedEvent; // 0x70a (0x1)
	unsigned char unreflected_70b[0x1]; // 0x70b (0x1) 
	float MaximumAspectRatio; // 0x70c (0x4)
	bool bVehiclesDestroyAllBuildingSMActorsOnContact; // 0x710 (0x1)
	unsigned char unreflected_711[0x7]; // 0x711 (0x7) 
	class UClass* VehicleBoundsXYSplineClass; // 0x718 (0x8)
	bool bAutoAcquireSpawnChip; // 0x720 (0x1)
	unsigned char unreflected_721[0x7]; // 0x721 (0x7) 
	class USoundMix* SoundMix; // 0x728 (0x8)
	bool bAllowHardcoreModifiers; // 0x730 (0x1)
	bool bForceCameraFadeOnRespawn; // 0x731 (0x1)
	unsigned char unreflected_732[0x2]; // 0x732 (0x2) 
	float MinTimeBeforeRespawnCameraFade; // 0x734 (0x4)
	enum EAthenaRespawnType RespawnType; // 0x738 (0x1)
	unsigned char unreflected_739[0x7]; // 0x739 (0x7) 
	struct FScalableFloat RespawnHeight; // 0x740 (0x28)
	struct FScalableFloat MaxRespawnHeight; // 0x768 (0x28)
	struct FScalableFloat RespawnTime; // 0x790 (0x28)
	bool bRespawnInAir; // 0x7b8 (0x1)
	unsigned char unreflected_7b9[0x7]; // 0x7b9 (0x7) 
	struct FScalableFloat RespawnLevelStreamDistanceToForceScreenFade; // 0x7c0 (0x28)
	bool bForceRespawnLocationInsideOfVolume; // 0x7e8 (0x1)
	bool bSkipWarmup; // 0x7e9 (0x1)
	bool bSkipAircraft; // 0x7ea (0x1)
	bool bAllowWarmupPlayerStartInSetupPhase; // 0x7eb (0x1)
	float WarmupEarlyRequiredPlayerPercent; // 0x7ec (0x4)
	enum EAirCraftBehavior AirCraftBehavior; // 0x7f0 (0x1)
	bool bUseCustomAircraftPathSelection; // 0x7f1 (0x1)
	bool bUseSameDirectionForOpposingAircraft; // 0x7f2 (0x1)
	bool bAircraftDropOnlyWithinSafeZone; // 0x7f3 (0x1)
	unsigned char unreflected_7f4[0x4]; // 0x7f4 (0x4) 
	struct FScalableFloat AircraftSafetyMarginPct; // 0x7f8 (0x28)
	float AircraftPathOffsetFromMapCenterMin; // 0x820 (0x4)
	float AircraftPathOffsetFromMapCenterMax; // 0x824 (0x4)
	float AircraftPathMidpointSelectionRadiusMin; // 0x828 (0x4)
	float AircraftPathMidpointSelectionRadiusMax; // 0x82c (0x4)
	float LastStepPushAircraftCenterLineMagnitude; // 0x830 (0x4)
	float LastStepPushAircraftCenterLineDirection; // 0x834 (0x4)
	bool bDisableAudioShapes; // 0x838 (0x1)
	unsigned char unreflected_839[0x3]; // 0x839 (0x3) 
	float NonRenderedCharacterAnimationScale; // 0x83c (0x4)
	class UClass* PlaylistMissionGen; // 0x840 (0x8)
	bool bForceLTMLoadingScreenBackground; // 0x848 (0x1)
	unsigned char unreflected_849[0x7]; // 0x849 (0x7) 
	struct TWeakObjectPtr<class UClass> LoadingScreenWidget; // 0x850 (0x28)
	struct TArray<struct FUIExtension> UIExtensions; // 0x878 (0x10)
	struct TWeakObjectPtr<class UFortPlaylistUIInfo> PlaylistUIData; // 0x888 (0x28)
	struct TWeakObjectPtr<class UFortAthenaHUDInfoDataAsset> HUDInfoDataAsset; // 0x8b0 (0x28)
	class UTexture2D* MissionIcon; // 0x8d8 (0x8)
	struct FText UIDisplaySubName; // 0x8e0 (0x18)
	bool bLimitedTimeMode; // 0x8f8 (0x1)
	bool bDisableReportAPlayerReasonTeamingUpWithEnemiesWhileInGame; // 0x8f9 (0x1)
	bool bDisplayScoreInHUD; // 0x8fa (0x1)
	bool bDisplayRespawnWidget; // 0x8fb (0x1)
	bool bDisableMatchStatsDisplay; // 0x8fc (0x1)
	unsigned char unreflected_8fd[0x3]; // 0x8fd (0x3) 
	struct FDataTableRowHandle SpecialActorInputActionDataTableRow; // 0x900 (0x10)
	bool bEnforceFullSquadInUI; // 0x910 (0x1)
	bool bShowEliminationIndicatorForSelf; // 0x911 (0x1)
	bool bShowEliminationIndicatorForSquadmates; // 0x912 (0x1)
	bool bShowEliminationIndicatorForTeammates; // 0x913 (0x1)
	bool bShowEliminationIndicatorForEnemies; // 0x914 (0x1)
	unsigned char unreflected_915[0x3]; // 0x915 (0x3) 
	struct FScalableFloat EliminationIndicatorMaxDistance; // 0x918 (0x28)
	bool bLeaderboardDisplaysIndividuals; // 0x940 (0x1)
	bool bUsePointLeaderAsTeamLeaderInLeaderboard; // 0x941 (0x1)
	enum EFortLeaderboardMetric TypeOfLeaderboard; // 0x942 (0x1)
	unsigned char unreflected_943[0x5]; // 0x943 (0x5) 
	struct FScalableFloat OnlyRespectsGlobalSettingForReplayRecording; // 0x948 (0x28)
	struct FScalableFloat DisableReplays; // 0x970 (0x28)
	struct FScalableFloat EnableServerReplays; // 0x998 (0x28)
	struct FScalableFloat ShouldUseCustomGameChannel; // 0x9c0 (0x28)
	struct FScalableFloat ShouldRejectDefaultGameChat; // 0x9e8 (0x28)
	enum ECustomGameVoiceChannel CustomGameChannel; // 0xa10 (0x1)
	unsigned char unreflected_a11[0x7]; // 0xa11 (0x7) 
	struct FScalableFloat ShouldRecommendCustomGameChannel; // 0xa18 (0x28)
	bool bForceGameChannel; // 0xa40 (0x1)
	unsigned char unreflected_a41[0xf]; // 0xa41 (0xf) 
	struct FSlateBrush MapImageOverride; // 0xa50 (0xc0)
	float MapScaleOverride; // 0xb10 (0x4)
	bool bDrawCreativeDynamicIslands; // 0xb14 (0x1)
	unsigned char unreflected_b15[0x3]; // 0xb15 (0x3) 
	struct TWeakObjectPtr<class UClass> MapManagerClass; // 0xb18 (0x28)
	bool bUseAsyncPhysics; // 0xb40 (0x1)
	enum EFortServerTickRate ServerMaxTickRate; // 0xb41 (0x1)
	bool bOverrideServerPerClientMaxAI; // 0xb42 (0x1)
	unsigned char unreflected_b43[0x1]; // 0xb43 (0x1) 
	int ServerPerClientMaxAI; // 0xb44 (0x4)
	enum ESafeZoneStartUp SafeZoneStartUp; // 0xb48 (0x1)
	bool bWarmUpInStorm; // 0xb49 (0x1)
	unsigned char unreflected_b4a[0x2]; // 0xb4a (0x2) 
	float StormEffectDelay; // 0xb4c (0x4)
	bool bDisplayFinalStormPosition; // 0xb50 (0x1)
	bool bDrawLineToStormCircleIfOutside; // 0xb51 (0x1)
	unsigned char unreflected_b52[0x2]; // 0xb52 (0x2) 
	int LastSafeZoneIndex; // 0xb54 (0x4)
	struct TWeakObjectPtr<class UCurveTable> SafeZoneLocationBlacklist; // 0xb58 (0x28)
	struct TWeakObjectPtr<class UDataTable> CreativeItemListSource; // 0xb80 (0x28)
	struct TWeakObjectPtr<class UDataTable> UpgradeBenchData; // 0xba8 (0x28)
	struct TWeakObjectPtr<class UDataTable> AILootOnDeathData; // 0xbd0 (0x28)
	struct TWeakObjectPtr<class UDataTable> HeroStats; // 0xbf8 (0x28)
	bool bUseDefaultSupplyDrops; // 0xc20 (0x1)
	unsigned char unreflected_c21[0x7]; // 0xc21 (0x7) 
	struct TArray<struct FSupplyDropModifierData> SupplyDropModifierList; // 0xc28 (0x10)
	struct TArray<struct TWeakObjectPtr<class UFortSupplyDropInfo>> SupplyDropInfoList; // 0xc38 (0x10)
	struct TArray<struct TWeakObjectPtr<class UDataTable>> QueryNameToLootChanceScaleTables; // 0xc48 (0x10)
	struct TArray<struct TWeakObjectPtr<class UDataTable>> QueryNameToLootCountScaleTables; // 0xc58 (0x10)
	struct TWeakObjectPtr<class UFortAthenaExitCraftInfo> ExitCraftInfo; // 0xc68 (0x28)
	bool bPlaylistUsesCustomCharacterParts; // 0xc90 (0x1)
	unsigned char unreflected_c91[0x7]; // 0xc91 (0x7) 
	struct TArray<struct FCharacterPreloadBlock> CharactersToPreload; // 0xc98 (0x10)
	struct TArray<struct FCharacterFallbackPreloadBlock*> CharacterFallbackTagsToPreload; // 0xca8 (0x10)
	struct TArray<struct FGameplayTag> AIPawnCustomizationFallbackTagsToPreload; // 0xcb8 (0x10)
	struct TArray<struct TWeakObjectPtr<class UFortSpawnActorInfo>> SpawnActorInfoList; // 0xcc8 (0x10)
	int NetActorDiscoveryBudgetInKBytesPerSec; // 0xcd8 (0x4)
	int NetDormancyNumFramesUntilObsolete; // 0xcdc (0x4)
	unsigned char bEnableCreativeMode; // 0xce0 (0x1)
	unsigned char bEnableSpawningStartup; // 0xce0 (0x1)
	unsigned char bAllowTeamSwitching; // 0xce0 (0x1)
	unsigned char bShowTeamSelectButton; // 0xce0 (0x1)
	unsigned char bAllowLayoutRequirementsFeature; // 0xce0 (0x1)
	unsigned char bUseCreativeStarterIsland; // 0xce0 (0x1)
	unsigned char bForceCustomMinigame; // 0xce0 (0x1)
	unsigned char bPreloadAthenaMapsForMatchmaking; // 0xce0 (0x1)
	bool bUsesAnimationSharing; // 0xce1 (0x1)
	unsigned char unreflected_ce2[0x6]; // 0xce2 (0x6) 
	struct TWeakObjectPtr<class UAnimationSharingSetup> AnimationSharingSetup; // 0xce8 (0x28)
	bool bAllowBroadcasting; // 0xd10 (0x1)
	bool bAllowSpectateAPartyMember; // 0xd11 (0x1)
	bool bActivateCurie; // 0xd12 (0x1)
	unsigned char unreflected_d13[0x5]; // 0xd13 (0x5) 
	class UFortCurieSettings* CurieSettings; // 0xd18 (0x8)
	struct TArray<struct FName> CurieManagerConfigOverrides; // 0xd20 (0x10)
	int PlaylistStatId; // 0xd30 (0x4)
	bool bAccumulateToProfileStats; // 0xd34 (0x1)
	bool bSaveToRecentGameList; // 0xd35 (0x1)
	bool bEnableStatsV2Stats; // 0xd36 (0x1)
	unsigned char unreflected_d37[0x1]; // 0xd37 (0x1) 
	struct TWeakObjectPtr<class UAthenaAISettings> AISettings; // 0xd38 (0x28)
	struct TWeakObjectPtr<class UClass> DefaultCreativeTOD; // 0xd60 (0x28)
	struct FScalableFloat MaxVehiclesCanSpawnWithTireMod; // 0xd88 (0x28)
	struct FScalableFloat PercentChanceSpawnWithTireMod; // 0xdb0 (0x28)
	float WaitForServerInitializationTimeoutSecondsOverride; // 0xdd8 (0x4)
	unsigned char padding_ddc[0x4]; // 0xddc (0x4)

	/* Functions */

	// Function /Script/FortniteGame.FortPlaylistAthena.GetMaxTeamSize (Underlying native function: GetMaxTeamSize 0x815caec)
	static int GetMaxTeamSize(class UObject*& InWorldContext, class UFortPlaylistAthena*& InPlaylist); // (Final | 0x00000002 | Native | Static | Public | BlueprintCallable | BlueprintPure)

	// Function /Script/FortniteGame.FortPlaylistAthena.GetMaxPlayerCount (Underlying native function: GetMaxPlayerCount 0x815ca28)
	static int GetMaxPlayerCount(class UObject*& InWorldContext, class UFortPlaylistAthena*& InPlaylist); // (Final | 0x00000002 | Native | Static | Public | BlueprintCallable | BlueprintPure)

	// Function /Script/FortniteGame.FortPlaylistAthena.GetMaxNumberOfTeams (Underlying native function: GetMaxNumberOfTeams 0x815c964)
	static int GetMaxNumberOfTeams(class UObject*& InWorldContext, class UFortPlaylistAthena*& InPlaylist); // (Final | 0x00000002 | Native | Static | Public | BlueprintCallable | BlueprintPure)

	// Function /Script/FortniteGame.FortPlaylistAthena.GetLastTeamNumber (Underlying native function: GetLastTeamNumber 0x815c8a0)
	static int GetLastTeamNumber(class UObject*& InWorldContext, class UFortPlaylistAthena*& InPlaylist); // (Final | 0x00000002 | Native | Static | Public | BlueprintCallable | BlueprintPure)

	// Function /Script/FortniteGame.FortPlaylistAthena.CreateCalendarPayload_RegionalOverride (Underlying native function: CreateCalendarPayload_RegionalOverride 0x273fd14)
	void CreateCalendarPayloadRegionalOverride(); // (Final | Exec | Native | Public)

	// Function /Script/FortniteGame.FortPlaylistAthena.CreateCalendarPayload_Enabling (Underlying native function: CreateCalendarPayload_Enabling 0x273fd14)
	void CreateCalendarPayloadEnabling(); // (Final | Exec | Native | Public)
};

